{"content":{"parts":[{"text":"{\n  \"Overall\": \"The survey comments reveal a deeply bifurcated experience within the Co-op. On one hand, there is strong, almost enthusiastic, appreciation for the Co-op's core values, its dedication to a positive and inclusive workplace culture (especially regarding diversity, equity, and inclusion efforts), and the supportive relationships employees often share with their direct managers and colleagues. Many employees describe their job as the \\\"best\\\" they've had, feeling valued, respected, and finding purpose, often choosing to stay despite knowing they could earn more elsewhere due to the positive environment and comprehensive benefits. The fully paid health insurance, staff discount, and snack shack are particularly lauded as critical supports.\\n\\nHowever, beneath this positive surface lies significant and pervasive frustration, particularly concerning management practices, communication, and compensation. A profound distrust in upper management and the People & Culture (HR) department is evident, with frequent accusations of dismissiveness, defensiveness, inconsistency in policy application, and failure to address serious issues like discrimination and poor performance. This lack of accountability and fairness, especially when it comes to inconsistent standards among staff, leads to immense frustration and burnout for diligent employees who feel undervalued and forced to \\\"pick up the slack.\\\" Furthermore, while benefits are praised, wages are widely seen as inadequate, failing to keep pace with Bozeman's high cost of living, which impacts employee retention and the Co-op's ability to maintain a diverse, adult workforce. Systemic communication breakdowns—especially between departments and locations—and critical deficiencies in training, tools, and cleanliness in some departments further contribute to operational inefficiencies and a sense of disorganization. In essence, while the Co-op's mission, values, and frontline culture are a source of great pride and satisfaction for many, the execution and support from higher-level management, coupled with pressing economic realities for staff, create significant friction and undermine the potential for a truly thriving and equitable workplace. The organization appears to be grappling with scaling its positive intentions and practices consistently across all levels and operational areas.\",\n  \"10. Comments about Co-op Ends?\": {\n    \"Sentiment\": [\n      \"0.8\",\n      \"0.0\",\n      \"-0.8\",\n      \"0.9\",\n      \"0.7\",\n      \"0.1\",\n      \"0.8\",\n      \"0.0\",\n      \"0.2\",\n      \"-0.7\",\n      \"0.7\",\n      \"0.0\",\n      \"0.9\",\n      \"0.8\",\n      \"0.1\",\n      \"0.0\",\n      \"0.7\",\n      \"-0.6\",\n      \"0.0\",\n      \"-0.2\",\n      \"-0.5\",\n      \"-0.8\",\n      \"-0.3\",\n      \"-0.4\",\n      \"-0.3\",\n      \"-0.6\",\n      \"0.2\",\n      \"0.2\",\n      \"0.0\",\n      \"0.4\",\n      \"0.9\",\n      \"0.6\",\n      \"-0.4\",\n      \"-0.7\",\n      \"-0.8\",\n      \"-0.3\",\n      \"0.9\",\n      \"0.9\",\n      \"0.6\",\n      \"0.0\",\n      \"0.0\"\n    ],\n    \"Highlights\": [\n      \"Numerous comments highlight a significant disconnect between the Co-op's stated \\\"Ends\\\" (especially around diversity, inclusion, and worker dignity) and the actual experiences of staff, citing instances of disrespect, soft discrimination, and lack of support for marginalized employees.\",\n      \"There's notable criticism regarding the Co-op's sustainability practices (e.g., global sourcing, non-recyclable packaging) and the high cost of goods, which limits access primarily to \\\"well-to-dos\\\" in Bozeman, contradicting a broader community-serving mission.\",\n      \"Despite criticisms, many employees express deep appreciation for the Co-op's dedication to being an enjoyable, accepting workplace that values diversity, open-mindedness, and creates a positive impact on employees and customers.\"\n    ]\n  },\n  \"20. Comments about Co-op management practices overall?\": {\n    \"Sentiment\": [\n      \"0.9\",\n      \"0.3\",\n      \"0.7\",\n      \"-0.4\",\n      \"0.7\",\n      \"-0.5\",\n      \"-0.9\",\n      \"0.9\",\n      \"0.0\",\n      \"-0.5\",\n      \"-0.8\",\n      \"0.6\",\n      \"0.7\",\n      \"-0.6\",\n      \"-0.4\",\n      \"-0.5\",\n      \"-0.9\",\n      \"0.9\",\n      \"0.0\",\n      \"0.8\",\n      \"-0.7\",\n      \"-0.7\",\n      \"-0.5\",\n      \"0.9\",\n      \"-0.5\",\n      \"-0.8\",\n      \"-0.7\",\n      \"0.0\",\n      \"-0.8\",\n      \"0.0\",\n      \"-0.4\",\n      \"0.0\",\n      \"-0.5\",\n      \"-0.6\",\n      \"0.7\",\n      \"0.6\",\n      \"0.3\",\n      \"-0.4\",\n      \"0.2\",\n      \"0.8\",\n      \"-0.3\",\n      \"-0.9\",\n      \"-0.9\",\n      \"-0.4\",\n      \"-0.9\",\n      \"-0.6\",\n      \"-0.3\",\n      \"-0.1\",\n      \"0.8\",\n      \"0.9\",\n      \"-0.8\",\n      \"-0.7\",\n      \"0.3\",\n      \"-0.2\",\n      \"0.0\",\n      \"0.7\"\n    ],\n    \"Highlights\": [\n      \"A pervasive theme is a deep distrust in upper management and the People & Culture (HR) team, frequently cited for dismissiveness, defensiveness, lack of empathy, favoritism, and failure to address serious issues, leading employees to feel unsafe or ignored when reporting concerns.\",\n      \"Many comments highlight significant inconsistency in applying corrective action and holding employees accountable, leading to frustration, burnout, and a perception of unfairness among diligent staff who feel burdened by others' underperformance.\",\n      \"Despite widespread criticisms of higher-level management and systemic issues, numerous employees express strong satisfaction, trust, and appreciation for their direct managers, praising their support, listening skills, and ability to foster a positive local work environment.\"\n    ]\n  },\n  \"27. Comments about workplace communications?\": {\n    \"Sentiment\": [\n      \"0.9\",\n      \"-0.3\",\n      \"-0.4\",\n      \"0.9\",\n      \"-0.5\",\n      \"-0.6\",\n      \"0.6\",\n      \"-0.4\",\n      \"-0.8\",\n      \"0.8\",\n      \"0.4\",\n      \"0.0\",\n      \"0.8\",\n      \"-0.8\",\n      \"0.2\",\n      \"0.0\",\n      \"0.7\",\n      \"-0.6\",\n      \"0.5\",\n      \"0.0\",\n      \"0.5\",\n      \"-0.9\",\n      \"-0.8\",\n      \"0.7\",\n      \"0.2\",\n      \"0.5\",\n      \"-0.8\",\n      \"0.0\",\n      \"0.7\",\n      \"-0.5\",\n      \"-0.6\",\n      \"-0.9\",\n      \"0.7\",\n      \"-0.7\",\n      \"0.7\",\n      \"-0.3\",\n      \"-0.3\",\n      \"-0.9\",\n      \"-0.7\",\n      \"-0.6\",\n      \"0.3\",\n      \"0.8\",\n      \"-0.3\",\n      \"0.6\",\n      \"-0.8\",\n      \"-0.4\",\n      \"-0.5\"\n    ],\n    \"Highlights\": [\n      \"A dominant and severe issue is the widespread breakdown of communication, particularly between departments and store locations (CWM and CDT). Comments describe it as \\\"notoriously terrible,\\\" \\\"nonexistent,\\\" and \\\"information falling through the cracks,\\\" leading to inefficiencies, missed information, and a sense of disconnect.\",\n      \"Many employees feel that manager check-ins are often ineffective, issues they raise are dismissed, and they lack input in significant decisions. There's a perceived culture where managers may blame each other rather than problem-solve, and employees are not included in conversations about changes impacting their work.\",\n      \"Despite the systemic issues, several comments highlight positive, open, and supportive communication within individual teams and with direct managers, fostering a comfortable atmosphere for face-to-face interactions and a sense of belonging among immediate colleagues.\"\n    ]\n  },\n  \"34. Comments about compensation and benefits?\": {\n    \"Sentiment\": [\n      \"0.8\",\n      \"-0.7\",\n      \"-0.9\",\n      \"0.9\",\n      \"-0.4\",\n      \"0.3\",\n      \"-0.6\",\n      \"0.8\",\n      \"0.9\",\n      \"-0.5\",\n      \"0.0\",\n      \"-0.3\",\n      \"-0.6\",\n      \"-0.7\",\n      \"0.9\",\n      \"0.4\",\n      \"0.9\",\n      \"-0.4\",\n      \"0.7\",\n      \"0.0\",\n      \"0.3\",\n      \"0.0\",\n      \"0.5\",\n      \"0.0\",\n      \"0.7\",\n      \"-0.7\",\n      \"-0.9\",\n      \"-0.5\",\n      \"0.0\",\n      \"0.2\",\n      \"0.9\",\n      \"0.0\",\n      \"0.0\",\n      \"0.7\",\n      \"0.5\",\n      \"-0.7\",\n      \"0.7\",\n      \"-0.6\",\n      \"0.2\",\n      \"0.7\",\n      \"0.0\",\n      \"0.1\",\n      \"0.8\",\n      \"-0.7\",\n      \"0.9\",\n      \"0.7\",\n      \"0.6\",\n      \"-0.5\"\n    ],\n    \"Highlights\": [\n      \"Employees overwhelmingly value the comprehensive benefits package, especially 100% paid health, dental, and vision insurance, along with the staff discount and snack shack, which are critical for supporting employee well-being. However, there is significant and widespread dissatisfaction with wages, particularly regarding their failure to keep pace with the high cost of living in Bozeman.\",\n      \"A recurring theme is the strong desire for merit-based raises and pay differentiation for added responsibility. Many feel the current system of standardized annual raises, based primarily on tenure, disincentivizes high performance and creates unfairness, leading to frustration among employees who go \\\"above and beyond\\\" but are compensated similarly to those doing the \\\"bare minimum.\\\"\",\n      \"The struggle to earn a living wage in Bozeman, coupled with perceptions of lower pay compared to similar roles elsewhere and inadequate raises relative to inflation, raises concerns about the Co-op's ability to retain experienced, adult staff and ensure economic sustainability for its employees.\"\n    ]\n  },\n  \"42. Comments about store/location operations?\": {\n    \"Sentiment\": [\n      \"0.5\",\n      \"-0.7\",\n      \"-0.6\",\n      \"-0.5\",\n      \"0.0\",\n      \"0.2\",\n      \"-0.6\",\n      \"0.6\",\n      \"-0.6\",\n      \"0.0\",\n      \"-0.5\",\n      \"-0.8\",\n      \"0.3\",\n      \"-0.9\",\n      \"-0.7\",\n      \"0.9\",\n      \"-0.4\",\n      \"0.2\",\n      \"-0.9\",\n      \"0.0\",\n      \"-0.7\",\n      \"0.6\",\n      \"-0.9\",\n      \"-0.6\",\n      \"0.7\",\n      \"0.0\",\n      \"-0.3\",\n      \"-0.4\",\n      \"0.8\",\n      \"-0.4\",\n      \"-0.5\",\n      \"-0.3\"\n    ],\n    \"Highlights\": [\n      \"Multiple comments raise serious concerns about safety, including crowded working conditions in coolers leading to injuries, a dangerous parking lot, and critically, severe cleanliness issues (mold, unaddressed buildup) and food safety protocol lapses in departments like Produce and Bakery.\",\n      \"Communication breakdowns, lack of cooperation, and perceived silos between departments and locations are highlighted as major impediments to efficiency. Employees report difficulty in modifying outdated operational processes, resistance to change, and a lack of cohesive vision across the organization, leading to frustration and animosity.\",\n      \"Employees express a strong need for improved technology and tools to perform their jobs effectively, with current resources sometimes seen as insufficient or outdated, contributing to inefficiencies and a sense of being unsupported.\"\n    ]\n  },\n  \"51. Comments about department operations?\": {\n    \"Sentiment\": [\n      \"0.9\",\n      \"0.9\",\n      \"0.6\",\n      \"-0.9\",\n      \"-0.7\",\n      \"0.0\",\n      \"0.3\",\n      \"-1.0\",\n      \"0.9\",\n      \"0.8\",\n      \"0.0\",\n      \"-0.6\",\n      \"-0.8\",\n      \"-0.4\",\n      \"-1.0\",\n      \"0.9\",\n      \"-0.9\",\n      \"0.0\",\n      \"0.9\",\n      \"0.0\",\n      \"-0.5\",\n      \"0.0\",\n      \"0.4\",\n      \"-0.7\",\n      \"-0.3\",\n      \"-0.4\",\n      \"-0.3\",\n      \"-0.6\",\n      \"0.1\",\n      \"-0.5\",\n      \"0.9\",\n      \"0.3\",\n      \"-0.5\",\n      \"0.3\",\n      \"0.0\"\n    ],\n    \"Highlights\": [\n      \"A pervasive and deeply frustrating issue is the stark difference in performance expectations and accountability across employees. Many report that some staff are \\\"extremely lazy\\\" or perform \\\"sub-par jobs\\\" without consequence, while others are held to unfairly high standards, leading to feelings of unfairness, disrespect, and being \\\"held to a much higher standard.\\\"\",\n      \"Several comments highlight department managers, particularly in Produce, being resistant to new ideas or systemic improvements, often dismissing suggestions with \\\"That's not the way we have done it in the past.\\\" This, combined with feedback being \\\"ignored\\\" or \\\"brushed off,\\\" creates a demoralizing environment where efficiency issues (e.g., mold, improper rotation) persist.\",\n      \"The sentiment of being \\\"overwhelmed\\\" and \\\"barely able to keep up\\\" due to heavy workloads and perceived understaffing (e.g., hesitation in hiring, reliance on staff \\\"giving so much extra\\\") is prominent, making work mentally and emotionally exhausting, despite high confidence and positive relationships within some individual teams.\"\n    ]\n  },\n  \"58. Comments about People & Culture practices?\": {\n    \"Sentiment\": [\n      \"-0.9\",\n      \"-0.4\",\n      \"0.9\",\n      \"-0.2\",\n      \"0.6\",\n      \"-0.8\",\n      \"0.0\",\n      \"-0.6\",\n      \"-0.9\",\n      \"0.1\",\n      \"0.0\",\n      \"-0.9\",\n      \"-1.0\",\n      \"0.5\",\n      \"-0.8\",\n      \"-0.7\",\n      \"0.9\",\n      \"0.6\",\n      \"0.8\",\n      \"-0.4\",\n      \"0.9\",\n      \"-0.9\",\n      \"-0.8\",\n      \"-0.9\",\n      \"-0.5\",\n      \"-0.9\",\n      \"0.7\",\n      \"0.8\",\n      \"0.7\"\n    ],\n    \"Highlights\": [\n      \"The most overwhelming sentiment is a deep and widespread distrust in the P&C department. Employees frequently perceive P&C as biased towards management, lacking impartiality, inconsistent in policy application, dismissive of complaints, and defensive, leading many to avoid reporting serious issues to them.\",\n      \"Despite some positive comments about the Co-op's overall inclusivity, numerous serious concerns are raised about P&C's perceived failure to adequately address instances of misgendering, transphobia, homophobia, and microaggressions, particularly from customers. This creates fear and doubt among marginalized employees about their actual protection.\",\n      \"Employees express a desire for P&C to be more connected to the daily realities of floor staff, to clarify reporting processes for discrimination/harassment, to demonstrate greater accountability, and to foster an environment where all voices are heard and treated fairly, rather than being seen as mere rebranding or \\\"HR.\\\"\"\n    ]\n  },\n  \"67. Comments on training and development?\": {\n    \"Sentiment\": [\n      \"-0.3\",\n      \"0.0\",\n      \"-0.6\",\n      \"0.0\",\n      \"0.7\",\n      \"0.9\",\n      \"-0.5\",\n      \"0.6\",\n      \"0.6\",\n      \"0.7\",\n      \"-0.9\",\n      \"0.6\",\n      \"-0.3\",\n      \"0.0\",\n      \"0.2\",\n      \"-0.4\",\n      \"-0.4\",\n      \"-0.7\",\n      \"-0.8\",\n      \"-0.3\",\n      \"0.3\",\n      \"0.6\",\n      \"-0.4\",\n      \"-0.9\",\n      \"0.2\",\n      \"-0.6\",\n      \"-0.9\",\n      \"0.7\",\n      \"0.0\",\n      \"0.8\",\n      \"0.2\",\n      \"0.5\"\n    ],\n    \"Highlights\": [\n      \"A significant concern is the chaotic, rushed, and often inadequate nature of training, especially for new employees and those without prior experience. This leads to new staff feeling overwhelmed, lacking basic knowledge and procedures, and managers failing to address their training needs effectively.\",\n      \"While some find check-ins useful, many long-term or established employees view them as \\\"pointless bi-annual stress\\\" or too generalized, lacking individualized goals or meaningful development opportunities. There's a perceived lack of a clear development program for career growth, with some feeling they are unfairly passed over for promotions.\",\n      \"A critical issue is managers misrepresenting job descriptions, attempting to force employees into tasks beyond their scope without compensation or proper training. This is compounded by instances of \\\"tone-deaf\\\" and unhelpful feedback from management, dismissing valid concerns about workload with unsupportive responses.\"\n    ]\n  },\n  \"79. Comments about supervision?\": {\n    \"Sentiment\": [\n      \"0.9\",\n      \"-0.4\",\n      \"0.5\",\n      \"-0.9\",\n      \"-0.4\",\n      \"-0.2\",\n      \"0.8\",\n      \"-1.0\",\n      \"0.7\",\n      \"0.8\",\n      \"-0.2\",\n      \"0.9\",\n      \"-1.0\",\n      \"0.9\",\n      \"-0.7\",\n      \"-0.3\",\n      \"0.9\",\n      \"0.0\",\n      \"0.9\",\n      \"0.7\",\n      \"0.9\",\n      \"-0.4\",\n      \"-0.8\",\n      \"-0.2\",\n      \"-1.0\",\n      \"0.7\",\n      \"0.8\",\n      \"0.9\",\n      \"0.7\",\n      \"0.8\"\n    ],\n    \"Highlights\": [\n      \"A deeply negative and recurring issue is the extreme inconsistency in applying standards and holding employees accountable. Many comments describe scenarios where some staff \\\"goof around\\\" or underperform without consequence, while others are held to unfairly high standards, leading to widespread frustration, resentment, and a feeling that \\\"action is hardly taken.\\\"\",\n      \"Numerous employees report managers making arbitrary decisions, being defensive, dismissive of concerns, and even creating hostile environments that lead to panic attacks. There are instances of managers misrepresenting job duties or giving inappropriate feedback (e.g., \\\"be more mean\\\"), causing employees to feel disrespected, insecure, and forced to defend their roles and schedules.\",\n      \"Despite the significant criticisms of inconsistent and unsupportive managerial practices, many employees express high satisfaction, trust, and loyalty towards their direct managers, praising their approachability, listening skills, support for independence, and ability to foster a positive team environment. This contrasts sharply with experiences with less effective or higher-level supervision.\"\n    ]\n  },\n  \"88. Comments about job satisfaction?\": {\n    \"Sentiment\": [\n      \"-0.6\",\n      \"0.5\",\n      \"-0.7\",\n      \"0.7\",\n      \"0.9\",\n      \"-0.8\",\n      \"-0.4\",\n      \"-0.7\",\n      \"-0.1\",\n      \"0.5\",\n      \"0.0\",\n      \"0.3\",\n      \"0.5\",\n      \"0.9\",\n      \"1.0\",\n      \"-0.3\",\n      \"0.8\",\n      \"-0.3\",\n      \"-0.6\",\n      \"0.7\",\n      \"0.9\",\n      \"1.0\",\n      \"1.0\",\n      \"-0.3\"\n    ],\n    \"Highlights\": [\n      \"Many employees express strong job satisfaction, describing the Co-op as the \\\"best job\\\" they've ever had, a place where they feel valued, build relationships, and appreciate the inclusive and supportive culture, often preferring it over higher-paying but more stressful alternatives.\",\n      \"A major detractor from satisfaction is the perceived lack of recognition for hard work and contributions that go \\\"above and beyond.\\\" This is directly tied to the absence of merit-based wage increases and the feeling that compensation is not fairly distributed based on effort, leading to employees feeling \\\"taken for granted\\\" and undervalued.\",\n      \"The high cost of living in Bozeman, coupled with wages that many find insufficient to live comfortably or save, creates significant financial stress and uncertainty, making it difficult for some to \\\"afford the cost of living here\\\" and casting a shadow over otherwise positive work experiences.\"\n    ]\n  },\n  \"93. If you chose \\\"other\\\" above, please note\": {\n    \"Sentiment\": [\n      \"0.0\",\n      \"0.0\"\n    ],\n    \"Highlights\": [\n      \"The \\\"other\\\" category allowed for diverse personal expressions, ranging from humorous identity claims to nationality, showcasing a relaxed environment for such notes.\",\n      \"This section did not contain substantive issue-oriented feedback about the Co-op's operations or culture, indicating that the primary concerns were likely covered in preceding questions.\",\n      \"These brief notes provide a small, informal glimpse into the varied personalities and backgrounds of the survey respondents.\"\n    ]\n  }\n}"}],"role":"model"},"finishReason":"STOP","index":0}