{"comments":[{"Question":"12. Comments on BriarPatch values?","Comments":["I believe there to be more training opportunities for employees that are not being utilized. These trainings would help to improve not only customer service on the floor but also help to further educate employees on various different topics and products.","BriarPatch could take more advantage of training opportunities, griup communication, and valuing employee opinions more.","I think we are inclusive and offer good careers. Some people do feel underheard, I am not one of those. I can easily talk to management or hr, and never feel stressed having to do so.","IT FEEL GOOD TO WORK WHER WE CAN BE OURSELVES","I believe BriarPatch has very good values as a whole everyone is very accepting","BP fell off","varies by department","open to all that qualify and competent hopefully.","I believe briar patch shows everyone kindness","todo esta muy bien","I am so grateful to be working at a place that has such wonderful values that I can stand behind","BP values their employees and actually takes the time to know everyone as individuals and not just another warm body that works in the coop. I really like that kindness matters, because how we all treat each other makes a huge impact on self esteem that lead to a greater performance, teamwork and customer service.","Briarpatch Food Co-Op has been instrumental in my growth as a person, internally and externally. I started to work here because the values and the ends policies of the Co-Op align with my own values and personal beliefs and every situation and experience that I have met while working here has only exemplified that. I love working here and I appreciate everything that the Co-Op offers to its members, customers, and employees.","I believe a good majority of the people who work for, and shop at, Briar Patch believe and agree on our Values as a company. I also believe that due to the location of the store, (Auburn), it can feel as if we partially hide our support in certain ways. I understand the need for customers, because that's how a business runs, however if someone is openly against what we believe and we just allow comments to be made, I think it could lead to problems down the line with our employees. It's very important that if we truly stand by these values, that we outwardly show it to our shoppers as well. I would also like to add, that I do believe Briar Patch does stand strong about our beliefs, however sometimes I have noticed that we allow certain comments to be made about one's personal identity, go with just a \"I'm sorry you feel that way,\" instead of defending what we believe to be right.","I've never worked in a place that makes me feel accepted in the way my team does, people respect my identity and make an effort to make the front end an overall supportive environment","I think that Briar Patch values diversity and inclusion, however, I also believe that diversity, inclusion, and tolerance are organic and sometimes the focus on DEI seems forced.","I think we preach a lot more than we practice in theory. We preach always put yourself first but I personally feel like for a lot of people the store comes first, if by choice or not, and we feel like we can not put ourselves actually first without having needs ignored or being questioned as to why or in some cases even fear retaliation from management who sometimes take things personally. This has improved but occurs when everyone is feeling the stress, and a lot of us are feeling the stress because we are stretched too thin because instead of filling gaps with employees we are filling them with people who already have a significant workload without any increase in pay or compensation.","While I support the values of the co-op in theory - such as community, equity and collaboration- I feel there's a disconnect between those values and how they are applied in practice. In my experience, certain voices are prioritized over others, and there isnt always space for open, respectful dialogue or accountability. I believe the coop could greatly benifit from a more inclusive and transparent culture where all employees feel genuinely heard, valued and supported.","I believe we could be more resilient by working with more local producers and smaller businesses. \nIt feels a lot like there is a contrived image diversity but most of the management is white men. True value would put more diverse voices at the table.","Having a medical disability, I have been harassed and heard comments made between managers that are unprofessional.","I do not feel like I’ve been given enough information so that I can talk knowledgeably about cooperatives with customers. The only training I have received on this was when I was first hired. Might be good to have refresher trainings to be able to provide customers with accurate information about cooperatives. I am part of the deli, maybe this is different for Front End/Center Store staff. \n\nI partly agreed/disagreed with the co-op honoring and accepting our differences. It seems like most of our workers with differences/hardships (at least in the Deli) are not accepted in the Front of House or Back of House, and are put in the Bakery. Kind of feels like they are hidden away or no one else wants to work with them so it falls on the Bakery","we have decent values here at briarpatch, but sometimes it seems like we enforce them a little too hard","BriarPatch wishes us to work the values of the co-op, but the lack of consistent, open communication and leadership.  When feedback is given or requested there is no answer.  There are days it feels like a vacuum.  A lot of time is spent developing managers but not so much with those under them.","BriarPatch is the most accepting company I have ever worked for.","They are pretty great. Teaches, encourages and gives space for people to safely be themselves.","As a whole the coop hits some of the diversity goals and values but could work on being more inclusive, tolerant and accepting of limitations within disability and pregnancy. I do feel that good progress has been made for sustainability.","While I do agree that briar patch operates with most of the core values I think that we could always be moving closer towards those goals and continuously striving to be better. I also have noticed several instances where people with mental health issues have been treated with little care or compassion and also end up being targeted more by other employees in the long run, which does not align with the fairness of the bpfc and is something that needs to be addressed.","I appreciate the fact that it has minority groups (black/LGBTQIA) products in store year round instead of just during the designated celebratory month.","they are awesome","I have been dealing with reverse discrimination.","It's a melting pot of people from all over, its a great reminder we all come from somewhere.","we are a very accepting evniorment","I believe most of the staff operate with the values of Briar Patch","I have seen, heard and personally experienced numerous times that management cares only for the bottom line, even going so far as to alienate someone for a disability that causes them to miss some work, despite trying their best to be a reliable member of the team.","In reference to question #10 I would love to see a veteran's discount or some sort acknowledgment for our customers","Education and training are nonexistent.","I have never worked anywhere that has been as understanding and works with their employees as much as Briar patch does.","Briarpatch is an open, honest, and community minded organization. It's principles and consistency in regard to diversity and inclusion have been an amazing rarity in my life and career. It has been great to be part of an organization that actually lives by the principles it says it does.","BriarPatch is still a great place to work, working hard to preserve inclusivity and equity. It's not afraid to state this publicly, either, in an increasingly hostile political climate.","Training opportunities seem to be inconsistent for all employees. It seems to me that only favored employees are given opportunities to advance their skills.","I feel they go above and beyond to promote inclusion. thank you","There appears to be a consistent trend towards using more plastic packaging in the deli, bakery, and bulk areas rather than striving to reduce it. Fewer certified organic choices are available in frozen and grocery.","People are allowed to be quirky, different or genuine without judgement of comments for their peers.","The Briarpatch crew does seem to work under this value set.","This company is a place where I know and feel that I can be myself. I see my co-workers fully represent themselves every day from the choice of fun hair styles, differing clothing from person to person, age variances, mental abilities, and pride in oneself no matter what they may be. I fully feel that BP is the most inclusive job that I have ever worked at and appreciate that everyone is allowed to be themselves in one way or another.","Sometimes I question if BriarPatch is inclusive to conservative-leaning shoppers. We could offer both Pride cookies in June and American flag cookies in July! Doesn't have to be an either/or scenario.","Discussion of BriarPatch values happen at every level of the co-op and are part of the strong culture.","Even during the short time that I have been here, I have seen that BriarPatch strongly believes in the core values of diversity, equity, and inclusion with a clear focus on community and local goods and services.","I feel valued and respected.","The Ends Policies are pretty vague. I feel good about working with BriarPatch but it is not always clear how we are adhering to our Ends Policies. It also feels like BriarPatch is turning more \"corporate\" and less \"community\" than in years past. I love the people I work with and how management values the employee's well being.","NCG appears to be incrementally encroaching on our independence, though not in a way I think constitutes a disruption of democratic control.  New Ends policies are broad; if clarity means the specificity required to directly link our work to the Ends policies' fulfillment, I don't believe the Ends Policies provide that link without further exploration."]},{"Question":"19. Comments on Storewide Management Practices?","Comments":["Some people have told me that there is favoritism among certain employees and they get away with bad behavior more than others.","Senior Store Manager could use some training on employee people skills! Instead of passive aggressive and hostile skills! \nPositive reinforcement often works better than negative critiquing.","Management has always been helpful to me.","DO NOT FEEL REPRECUSSIONS FOR CALLING OUT UNDESIRABLE PRACTICES, IN RETURN FOR THE PROPER ROUTINE","I feel safe bringing criticism to some management. I don't trust all and that is because something was said to a manager before and it was told to an employee which should not have happened","some of middle management does not give the feeling they care about the needs and wellbeing of their employees, there seems to be an issue with favoritism in every department. In my department rules are not applied evenly. some employees have been written up and fired for the same things others get away with on a consistent basis. When they give a write up they do not always have documentation on the incident. I do not feel safe bringing my concerns to management. Managment does not treat everyone equally. I do not feel safe reporting activities without retaliation. I have seen people who spoke up let go not long after.","You can't even talk to HR without them gossiping to the department leads, the managers here are a joke, and they know it.","some management persons leave me questioning a few things regarding certain issues.","todo esta bien","All of our managers care deeply about their employees and have so much respect for them.  They listen to our concerns and help with them as much as they can.","Our management here at BP has been the best I've ever been able to work under, however, just like everyone else, we can struggle. I have noticed, and taken note of, however, this common feeling of superiority. I have seen, multiple times, management speak and act like they are better than those below them. I can feel that sometimes my Leadership looks down on me only because I'm not on the, \"same level,\" as them. There has also been a problem of some people in Leadership positions choosing to do LESS work, just BECAUSE they're in that position. It's not the best and I know of multiple people who feel overworked and underappreciated because of it.","I believe storewide management is just and fair to all employees, I've felt comfortable bringing up issues in the past, and i will continue to do so knowing that I have that kind of support in the workplace","I have not felt that I am held to the same standards as others, and often times do not feel the criticism is appropriate. Not getting my annual merit increase last year without any good reason is a good example of this. Being told \"We felt your promotion was enough\" isn't fair because it wasn't enough, I replaced 2 salaried positions and know that I am still being underpaid compared to my predecessor.","There's a lot of assumptions instead of clear communication. Some of the managers feel detached to employees outside of their departments and it creates a department vs department attitude instead of us working and collaborating as a store.","Could be more present.","I havent felt valued here at all. I would love if management took the time to get to know me and my goals within the organziaton, more training and more hiring from within","We have OBM meetings but we do not typically run staff meetings the way I am accustomed to. We only focus on sales and numbers, not product knowledge or bring up department issues to brainstorm solutions. Department OBM occasionally captures some of that, but it does not seem to be part of the design. Seems like a missed opportunity to get our team on the same page, boost our potential to actually impact sales with helpful product information, and have a designated time to problem solve.","After being here almost 9 years, I have seen much favoritism from some management. Managers like Mike McCary do not show any empathy and understanding for the employees, as well as hold double standards. Managers like Cassidy Limberg and Paul Hamilton show empathetic leadership and hold everyone on the level of their job description.","I partly agree/disagree that Co-op management (in the Deli) is sincerely interested in the needs and welfare of the employees. Sometimes it feels like they are more interested in their own needs than those of the employees beneath them.","I don't feel safe discussing the things that I want changed at Briarpatch. on multiple occasions I have seen people be punished or even as far as fired for complaining or voicing concerns. I understand the difference between gossip and complaining, but every manager talks to me like i can't tell the difference. on top of that the things they bring up as gossiping always revolve around things people are upset about, like decisions made. meanwhile several of my managers have stopped me from my work to talk to me about something and have ended up gossiping about many things. Until recently I was just an employee, and for years managers and supervisors have talked to me about information they shouldn't have, while I've seen people fired for arguing against managers decisions one too many times. I feel that if I speak out about how managers make me feel i will be targeted unfairly, as I have seen people targeted on more than one occasion. a lot of the times who gets written up for what seems to be based off of whether any of the managers like you or not. people who should have been fired 3 times over manage to keep their jobs while those who are struggling but care always end up in trouble for less.","The lack of leadership on some issues is really detrimental.  There is a lack of consistency between shifts and departments.  Between the openers and closers, it feels like different departments.","Management in the Deli has changed drastically! Some good Some are terrible! I do not feel comfortable going to my direct sub department assistant Manager, they are extremely 2 faced and gossip more than the regular employees do.  If you go to them with a concern about something another employee has done or said they go to that employee and disclose who has told on them, which is extremely unprofessional!  They create drama where it doesn't need to be and bully's there employees.  They are one of the worst managers I've ever had to work with here.","I have seen favoritism and disproportionate corrective action taken for various events. Occasionally a person will be unfairly burdened or punished for a problem that involves multiple people and other times I have seen people have almost no punishment for serious offenses. Also many problems are allowed to go on for so long that they become serious issues instead of being stopped before affecting larger numbers of people.","I've observed an amount of favoritism within all parts of the bpfc. There are some individuals who are do not follow the dress code at all, who do not provide ample customer service, and generally are allotted extra privileges without doing any extra work. Most of the time they end up doing less work than the rest of us. I have approached higher ups about this in the past and was met with attitude and resistance to my concerns as well as the problems being swept under the rug and never being delt with. I have also seen people be targeted and nitpicked until they became miserable in their position after coming forward about mistreatment of bpfc favorites. I do feel valued here but I feel as if this is an issue that I am uncomfortable addressing.","I feel i have been scapegoated by my department manager, supervisor, and fellow employees and different occasions.  when there is an issue present with multiple fingerprints on it, the person who is not piping up or complaining about it will get scapegoated while the vocal parties simply deflect attention off themselves.  This happens becuase the manager is satisfying the concerns of the complaining parties by basically targeting the one who's not complaining.  And then i end up in the office for a surprise write-up or coaching session completely unprepared and caught off guard.  To express this feeling in the moment is not really logical because in this moment, you cannot offer criticism to the one disciplining you.  I hope this made sense.  The manager in my department needs to really hold the correct parties accountable for whatever issue, instead of trying to be non-confrontational and placing the ball in the \"court of least resistance\".  Because I work with such confidence and refuse to blame a coworker for anything toward a manager, and let my actions do the speaking, my court always most comfortable to place the \"issue ball\".  Some of the grammar here is bad.","There are other staff members who are having problems with their mental health and management does not or is not taking appropriated action.  There are staff members who are constantly on and off of being on leave and they come back to work and somehow have more \"superiority\". Some of our new hires are very disrespectful for being new team members.","In the FOH deli especially, they're kept *severely* understaffed, which results in high stress, frustration, and exhaustion (emotionally and physically). That definitely doesn't feel like the COOP management has their needs and welfare in mind.","it would be nice if employee ideas and thoughts would be considered on a more respectable level","we practice a safe wroking environment","Management only applies consistent corrective action to those who they know or care little about. If you are friends with management, there's a good chance you won't be held to the same standards of those who are low level employees. There are people who should have been fired a long time ago that management just shrugs off their mistakes.","As my previous comment stated, I have been the victim of unfair treatment from management.","I have observed some employees having partialities given to some over others","The coop strongly believes in favoritism. They do not value each associate. They make rash, bias decisions based on misinformation. And they just \"go with it\". They don't investigate issues. They have zero empathy or concern for most associates. There is NO inclusion. There hasn't been since I've been here. Just like the lack of training. I have never worked for a company with such little concern about a person's well being. Management doesn't know the proper way to take corrective action. Instead of a write up for \"inadequate performance\", they would rather just demote someone for made up reasons. HR literally doesn't even know their own policies, so the employee handbook isn't taken seriously at all whatsoever. I don't \"feel safe\" at all here. I never will again. You guys have literally been the most uncaring, inconsiderate humans I have ever worked for.  Everything about how I have been treated has been \"unethical\".","The management team acts with the same core values and principles that the organization stands by. They are truly encouraging, insightful, fair, and kind while holding high expectation of performance. I have been given great opportunity to grow within the organization. As well as being put in a position as a manager to provide the same levels of opportunity to the staff.","It's not a matter of feeling safe or not, but I do feel that the influence of people on the floor on management discussions and decisions has decreased quite a bit over my ten years here. It used to be a more horizontal structure, like a true co-op; the growth and expansion has come with a slightly more corporate, top-down structure and culture. This might be just my perception, but it seems turnover is higher, too.","Handbook policies and procedures seem to be implemented only when an employee is out of favor with management.\n\nWritten corrective action is taken without full transparent investigation, listening to all sides or allowing for rebuttal of allegations.\n\nReporting unethical activities or appearance them seems to elicit retaliation. (I wonder how confidential this survey really is.)","We are so lucky to have the management that we have. Every person is given time and attention.","I have no problem with them.","I am appreciative of the fact that I can challenge my management on their thoughts and processes. It helps me grow and gain more understanding of what it is I do but also gives me a voice if it is actually wrong or needing a change.","Varies widely depending on manager","I don't have much interaction with many of the store managers but based on my experience and observations, the managers seem to be very supportive and helpful to their respective teams and ultimately seem to respond to situations in a timely and efficient manner.","Ive never been in trouble so I dont know much about that, but I do feel like I can say things that I feel to management, without worrying about my job.","There seems to be some disconnect between some departments and between the two store locations and I have low knowledge about management practices outside of my department. I appreciate the way my department is managed.","Since I last took this survey, I have occasionally been met statements such as \"because the CEO says so\" when inquiring about the reasoning behind decisions.  I've also heard the statement \"I'm your superior, what I say is true is true\" after indicating that I had been receiving verifiably incorrect information to the degree that I didn't feel comfortable carrying out actions based on the information I was given.  Both of these sentiments - in my opinion - are anti-cooperative and may belong in the corporate world, but do not belong in a cooperative grocery environment.  It's not that I only don't feel safe raising objections, I don't feel like I can even ask for reasons without it verging on the threshold of a conflict.  This situation has gotten better since the first of this year, but the \"because the CEO says so\" statement was heard somewhat recently and definitely since the first."]},{"Question":"28. Comments on Workplace Communications?","Comments":["My feedback on what our department is able to accomplish (given the amount of hours and employees we have) is usually taken negatively if I am saying we might not be able to get something done in a short amount of time.","I AM NEVER SCHEDULED TO ATTEND MONTHLY OBM MEETINGS","I would like the recipes in the deli/bakery to be more clear and precise, leave less room for ambiguity and guess work. I would also like to have better communication when it comes to schedule changes.","There are some inner workings of Briar Patch that I believe could be improved upon. If buyers of departments had more access to specific information regarding movement rather than having to take certain steps to receiving reports from other departments, it would be a more time effective process that would help to engage in better buying practices. Having the knowledge of movement on hand, i.e. through Catapult, would help to decrease excessive stock on hand, increase smarter buying for ad change overs or up and coming sales.","BriarPatch would benefit from allowing buyers to have more responsibility/access when it comes to catapult and bringing in local brands.","IT IS GREAT THAT EMPLOYEES ARE AWARE OF TRENDS, GROWTH AND OPPORTUINITES","There are some things that get miscommunicated and that don't get communicated at all which sometimes makes situation difficult.","i do think our suggestions could make great changes to the coop. I do not think that everyone is given the information they need to do their  job.","nonexistent for shift change","I like being able to talk openly about anything work related in a group setting so we can all be on the same page.","todo bien","Question 25 would not allow for none to be clicked/checked.","This last year, I have learned so much more about our coop in so many different ways.  I love being able to participate in our department obms and storewide, taking in the knowledge of our store","I feel like there could be better communication between departments especially when it comes to upcoming sales and events. For instance, the Supplement Sunday is coming up this week and we were not notified, I just saw it written on a whiteboard in the back warehouse. I feel like a timely notice to get the word out about the event would be beneficial for a successful sale.","Oh, I LOVE how open this company is with its \"behind-the-scenes,\" information. I have always been someone who feels better about working for a company that chooses to let all of its employees know how it's doing. I feel like we do a fantastic job of letting everyone know what and how we do.","I believe all communication from my team and the workplace have been fair and timely, I think it's great that I work in a place that listens to employees about fun and inclusive ideas/event","Question, 24, I Partially agreed to this because I wasn't notified when the perks of becoming a new owner changed, I had a customer get pretty upset, because another co-worker told them the original perks when she was signed up, also not knowing that had changed.  It would just be nice to know when big changes happen, like that, helps keep the customers satisfied and not confused.","I think we have a lot more opportunity to communicate between departments about changes, new products, promotions, deals, ect. The more information we have the better we can communicate that to our shoppers.","Very transparent in some areas yet could be more transparent in others","While OBM is useful to understand the numbers, i would love more in to the why. I would also like to hear more from the upper management on what they are working. it would be great if finace, marketing, operations each had a little to say at each OBM. and more info on what the overall plan is.","As someone who is not a numbers person, OBM falls short. I feel like we are missing a piece about real actionable steps we can take on the sales floor to reach our forecasted numbers. \"Hurry up and work faster,\" just seems to be the message I take away from it. I would prefer to hear more about what I can tell customers as I chat with them- for example, \"Did you know that if you pair X with Y you're body is better able to absorb the Z? We're running a sale on Y through the end of the week.\" In general, having allotted time to be informed of sales and what we can promote for other departments would be useful because we chat with a lot of customers. The message that hurrying up will boost sales alone misses how some customers actually super appreciate that a clerk can slow down and tell them about a product, distributor or farm.","My direct manager, Sarah Lang, does not receive ideas/suggestions well. I have brought forward different methods we could be implementing to make better, more consistent product, but I'm met with her saying no and giving no reason for it. When asked why something isn't turning out right, I have an answer with my experience and degree in Baking & Pastry Arts, but am met with \"that's not why it's happening.\" I have good feedback and collaboration with other Deli Managers as well as Cassidy Limberg.","I partly agree/disagree that employee ideas and suggestions make a difference at BriarPatch. Most suggestion I have made for the bakery (and have heard from my coworkers as well) tends to fall on deaf ears. It feels like there is a resistance to any sort of change.","it feels like when I try to question or correct my direct manager on procedure and production, the response i receive is roughly \" I'm the boss and we are going to do it this way\"\nmy manager leaves early regularly, doesn't properly train people or outright trains them wrong, disregards most feedback, and so on. They were not here during the entire UNFI Crisis, and I can understand they are having issues unrelated to work. but there is no proper leadership most the time. i'm a new supervisor, and on more than one occasion i just cant answer questions or do anything about the situation as nobody has instructed me on our SOP.","Excellent management","I would say overall workplace communications are pretty good.","Communication could definitely be better, sometimes changes happen that I hear about well after the fact or not at all.  I would also love to get some more training on the products we carry so that I can answer customer questions better without having to look it up on my phone or find someone else to ask.  It can be hard to make it to OBM meetings when I am on the clock, ive been to one since starting here.  I would love to go to another one to learn more about how OBM works at the Co op","Because of the shift difference and all managers working earlier in the day, we do not get information.  I haven't had access or heard about OBM in six months.  It is not geared for line employees and with recent changes I am not sure where I fit or even if I am valued.   We work very hard and usually the feed back if any is critical.","Its good, but when things get busy or stressful with lower employment. Communication falls off. Center store doesnt have consistent meetings that or channels that fully involve the entire department.","The communication needs some work here in the Deli, The Management decides to change things or add things with little to no communication to the staff that it directly effects.","Although the information for the store in general is rather easy to access it does not feel like employee input is implemented and things often feel very slow to change. There is a lack of structure and systems in place and it makes it difficult to have an effective workflow. Changes in hours are not always communicated to customers, many things feel under communicated to the customers about store information. Open book management also needs to be better advertised as to when it is happening.","I feel that the deli sticks out as a sore thumb when it comes to communication. As a store (excluding the deli) there is much better communication. But within the deli the communication is horrible. No matter where you look it's just bad and needs months and months of improvement. Communication between AM/PM bad, Manager/Supervisor bad, Supervisor/Employee bad. It's so ingrained into deli life not to communicate that it's seen as just simply part of working in the deli. A lot of our issues that we have in the deli could be fixed so fast if communication was the number 1 priority. However, that is not the case and often times people will get met with punitive action over a simple miscommunication that could've been easily avoided.","Can we please get the 2 free massages a year back???? PLEASE!!!  This existed in 2012 or somewhere around there.","communication (at least in the deli) is something that really needs to be worked on continuously\nit seems to be getting worse. theres no communication, and then theres a blow up from management when we didnt know in the first place. happens over and over.","We've definitely gotten a bit better re: our ideas being considered, but upper management tends to be dismissive and closed minded in some circumstances.","More communications from the kitchen to procurement based on their production lists for proper freight levels and expected amounts of certain items. I feel less things should slip through cracks... but otherwise it is a very tight ship and I'm grateful to be a part of it. It's almost like we just need to open up more to eachother and not be afraid to ASK for things or help when we need it. It's one of my goals as a department head, following that path of inclusion until everyone feels like they're on the same page! it really makes a difference.","I understand to an extent what open book management is & means - but I don't follow it as closely as I feel like I could or should. Some of the numbers I don't understand & the meetings are always on my day off - so I have only been to one meeting in all the years since we've moved to open book management. I understand why the meetings might need to be on a Thursday - but it could be nice to switch days now & again for more employee participation at the meetings.","The level of care that Briar Patch puts into ensuring effective communication is unparalleled.","There's a lot of \"mandatory\" communications.","I think I have participated in OBM meetings 3 times in 41/2 years and I don't feel that I'm informed about what's going on in the Front End regarding changes.","There is not enough communication between departments and also from across the street. At times it feels like the employees who work on the floor of the store are left out of the loop from the teams in the office.","There is a definite lack of communication, and at times it seems I find out things after the fact.","sometimes suggestions are made and it takes quite awhile to institute or there is talk of getting certain things done but then they don't, but in suppose certain things take time it just shouldn't be promised and also training to further our positions seems like it will never happen. It would be great to feel like i can grow with the company but i dont see any effort to make that happen even after asking","There is literally no training program in place. Access to information needed to do my job? No one in the building has that access. There is no adequate notice of changes affecting my job. You all make changes on a whim just because you can. I don't ever get to go to OBM meetings so I've never had an understanding.","I feel like i know what is going on amongst my area that i work in but not so much around the rest of the co-op","Workplace communication is excellent. It is accessible to whatever level of involvement an employee desire. From just a good place of work to a full community of likeminded individuals.","I'm in a new part-time (and lower status) position, so personally I feel a bit more out of touch with the co-op's direction.","I feel that the Instagram feed sometimes has more information than what is distributed internally.","BriarPatch has a two-pronged problem, when changes are coming sometimes, they are rushed and pushed through quickly with barely any time to process or prepare properly for the change and at other times we are super slow to make a decision and make the change. It always seems like large changes are quick while small changes are slow.","There are plenty open forums for communication both directly and indirectly. It's great to know that I have access to more information than necessary for my position. I know what Marketing has going on and so on; HR does an exception job communicating as well.","My supervisor generally gets back to me in a timely manner. However, I don't have much communication with other departments aside from a few hours early in the morning. David, the produce manager, communicates effectively. I sometimes also interact with the Front-End Food Manager, Jared. Workplace communication seems to be very effective.","Very open and honest. OBM is really great because I feel like I am on a team.","There is disconnect between some departments and between stores. I don't know what is going on sometimes. I like the OBM practice but don't fully understand all the numbers.","I really enjoy receiving the monthly Changeover FYI from marketing.","Since the last time I took this survey, a \"Grillin and Chillin\" event was introduced, discussed and decided upon without my inclusion even though it required a novel set up by my department.  In this situation, General Manager stood by my department's guidelines during a meeting with those involved, which was much appreciated.  Also, some of those involved in making that decision made visible efforts to include me in future conversations.  This shows both challenges to communication and improvement.\n\nI received a notice five minutes before leaving one afternoon that a community dinner was going on that evening and they were wondering how they would ring everything up; this was the first time I was hearing about this event and it, again, required a special set up for the dinner to ring up.\n\nIt took several months for a communication that Scan Clerks had moved to Ops to make it fully through the store and become known.  Throughout those months my staff and I fielded many communications from employees who did not know what was going on or understand the change had taken place, despite communicating it out several times to the management team."]},{"Question":"33. Comments on Compensation?","Comments":["Fast food employees get paid $20 an hour, and those little brats at Mcdonalds behave like total jerks. If THEY get $20 an hour to be rude and serve poison, we should at least start at $20 an hour here.","The amount of experience in years or abilities able to be utilized in a job should be taken into consideration when determining the wage scale for employees. The employees that show consistently that they are willing to go above and beyond for the sake of their job or for the co-op as a whole should be recognized and paid more for their extra efforts and truly caring about the business. There are plenty of employees that are okay with doing the bare minimum to keep their positions, while others are fast moving go-getters.","You have to pay good people good money to get them to stay. Paying the minimum you think you can get away with results in high turnover and inconsistent work being done.","I like the yearly raise. I understand the more time I invest here the more I make. I highly value the pto.","OTHER THAN THE STATE BEING HIGH UP ON INFLATION, TAXES ECT.. ITS PRETTY FAIR IN COMPENSATION.","unfortunately, our pay increase does not always reflect our job performance it seems many factors come into play depending on what department you work in.","I spend a year going above and beyond in my department, downright to the point where Im outworking managers, but instead of fair raises and promotions I get a pat on the back and a 3% raise since \"5% is unrealistic\" I've almost left this job a handful of times to go work at McDonalds, despite the hell that would put me through at least Id be making enough money to where I don't have to PRAY that we get our quarterly bonus, the healthcare here is better than most, but still not good enough to justify a wage of $17, there isnt a single position in briarpatch where 17.50 could be considered fair. And I think almost everybody who doesn't lick the BP boot agrees.","the benefits are often why i dont quit","esta bien","People who dont use sick time should have some kind of compensation, compared to people who use every day of sicktime.  Shouldn't be penalized for being healthy","so appreciative of how this store takes care of us financially, paying us extremely fair rates.  Staff discount has been such a blessing to me and my family.","I think there are some people here who do the work of two and get paid for only one. I am not talking about myself, but I have noticed this. I also think this relates to what I said about management. There are some people who are getting paid more, yet do less than those who they are managing.","I am beyond grateful and satisfied with my pay and benefits, I think our pay is highly generous considering how corporations work themselves, I've had underpaid jobs in the past, I feel I can actually support my lifestyle and pay my rent :)","When I was promoted, I was offered less compared to my predecessor without any room to negotiate, also I was not given my annual merit increase with the promotion used as an excuse. When I was promoted, I wasn't able to replace 1 salaried position and had to take on many of those roles. Last year the maximum merit increase was 7%, this year it is 5% which adds to my frustration regarding missing out on last year's merit increase.","Mental work is valued over physical labor, but physical labor is what runs the store.","Great benifits","Adding a dependent on insurance is expensive.","I could get paid much more elsewhere, but benefits are ultimately what keep me here.","I disagree that my pay increases reflect the quality of my job performance. I feel undercompensated and over-used for my current role.","our insurance is an incredible hassle to work with, but i do very much value discounts, and vacation pay. i don't think paid meal break should be in here, as it just allows them to not have to pay overtime while asking employees to stay 20 minutes after being scheduled. as for pay, i don't think the pay here is great relatively. i make barely over what starting at mcdonolds is, and i'm a supervisor. i could work there, and only lose roughly 30 cents pay for 75% less of the stress. i don't think i need to be payed a crazy amount. but a couple bucks above that. every raise i've ever gotten has been at max a dollar. they don't give raises outside of your yearly annual, unless you put your 2 weeks in and they value you.","Being paid less than people who work in the fast-food industry is incredibly disheartening and unmotivating to want to work harder and be proud of the job I do","As minimum wage goes up, it would only be fair to be compensated accordingly, separate from the annual raises for performance. Since we cant do anything about minimum wage going up below us, the only way to compete with the pay would be to go somewhere else.","Would be nice to be able to take unpaid time off.","I wish sick and vacation could be together PTO. When your sick time sits at 80 hours and you do not earn more, or I wish they would pay us out for sick not used at the end of the year after all we earned it!","Its difficult to find dentists that take our insurance, but other than that my benefits have been valuable.","I do think the store could do wage increases better. It seems based on a certain percentage range vrs actual merit. There have been a few times where employees that are just hired will be paid a higher wage than those doing similar jobs that have been here longer. I think this damages the longterm employee-business relationship.","The compensation is fair and the paid lunches are the best.  I am fairly compensated.","While I feel that in relation to the local job market the pay is fair, wages in general have not kept pace with inflation. Just about everyone I know that works here struggles with making enough to cover bare essentials including housing. Unless a family has another wage earner that makes quite a bit more most of the employees including myself are housing insecure, struggle to find a living situation, one paycheck away from homelessness or both.","Paid meal break is awesome along with the staff discount. Medical benefits are good but expensive for the employee (as far as cost per paycheck)","Of course people want and need more money to keep up with cost of living.","The benefits here at the patch are better than most  jobs in the area.  The thing I'm most grateful are the benefits we get here from our Vacation time accruals to healthcare, to the free for staff program..  Every little bit help and I'm very appreciative for everything the patch offers me!!","The pay is barley keeping up with inflation and the rising cost of living in this county, the benefits available are a huge help but the take home wages have not kept up with the market and many places are starting above the state minimum wage to be competitive. the percentage that the wage increases per year is not enough to combat the rise in expenses, and even with the generous discount many people cannot afford to shop here or go without a second or even third job.","While I do feel I could get paid more and that I should get more for my work the benefits honestly make it up for me. I could make the same somewhere else and have less of a workload, but I most likely would not get the same benefits that I do here and I think that our PTO system especially lets be able to get the breaks, space, and free time that I need","I am underpaid but everyone in foodservice is underpaid so its hard to answer that question about whether im \"fairly underpaid\" haha","$18 for the amount of work and everything we go through doesnt seem like enough at all. even if other companies werent offeering more, its still not enough. Knowing i will only get to 20$ by being a supervisor breaks my spirit. we hussle everyday in the deli and seems to not be worth it.","When I was hired, I was told I would be making $x amount of money per hour. However, I am salary, so when I asked what that comes out to per year, a guess was made by my hiring manager. \"I think that comes out to about X / year\" That guess was incorrect, which was disappointing because I am making considerably less than that guess. So, when people are hired at salary, you should tell them what they will be making per year, not what the hourly equivalent would be, to avoid frustration. I feel like this is standard for most jobs, as I have been on salary in a multitude of places for the last 10 years.","This is purely because of the current economic situation - people need more than $20-$25/hr to avoid frequently struggling.","There are some employees worth gambling on when it comes to wages. I like to consider myself one of them. What I asked for in regard to wage, I did not receive.\n\nI suppose it comes down to resume and work history. references, and making that first and lasting impression. I strive to be someone that's worth a raise, and I don't mind putting in the work to PROVE that.\n\nSome people will take offense, and just not accept the offer. I suppose that's your way of weeding out the correct person for the job. \n\nBut usually if someone asks for something in specific, that's what they know they're worth. OR that's what they know they need to survive in today's economy; based off of the other jobs they've done, completed and outgrown. \n\nLearning how to judge character right off the bat takes a lot of the guessing work completely out of the equation.","The market has shifted and the coop has yet to catch up. The only people who are fairly compensated are upper managers. Pay increases have been the absolute minimum due to \"budget restrictions\" but the coop has no issues going out of budget to hire a new employee who makes much more than others. Wages and yearly increases have been insultingly low.","I don't feel there is any incentive for employees to offer better customer service as we're all paid the same whether we go the extra mile or not.","I have not received a raise in quite some time. I have asked and gotten nowhere even though I am told time and time again that I am valuable and important.","I am very grateful for the employee discounts/free for staff/health insurance, etc, . Unfortunately, a living wage is not yet paid to everyone.  While some employees use food stamps, others are on vacation.","I could still get food stamps on what i make< I couldn't afford to live on this if I didn't have rent just under 1000$ and its a barely make it month to month.","I have been underpaid since day 1, but now, I'm beyond underpaid.","I am very fortunate to have these perks from my job!","Briarpatch goes above and beyond to take care of its people and provide competitive pay in the current marketplace.","Utility Clerks are trained to work EVERY department of the store. That is an incredibly valuable, rare skill set. The cost of hiring more employees to fill the positions that Utility Clerks often cover (especially front end coverage and receiving) would cost BriarPatch far more than paying a livable wage of a few dollars more an hour to fully trained Utility Clerks.","Compensation is grossly inadequate in the context of overall cost of living. Briarpatch employees should be able to afford to live in the same community as it's customers.","I appreciate the Patch and its benefit package. I also believe that the living wage for California is about 27 dollars when I asked AI for its opinion. I will say that I do struggle from check to check and I shop at the patch for my groceries.  I believe that if you work a 40-hour week you shouldn't have to struggle with paying your bills such as rent gas food and utilities.","Fast food pays employees more","My department requires lifting of heavy items, organizational and customer service skills that I believe are not reflected in my job compared to other jobs in the store. When I checked we were the lowest paid department in the store.","I perform 2 jobs within my department. For one of them, (clerk), I feel fairly compensated. For the other, (buyer), I feel that my job duties require a great deal of responsibility that is not adequately reflected in my pay.","we are so damn lucky.","I do feel $20+ per hour would be fair for the work I do.","The hourly wage is a bit lower than I would've liked however I don't have to invest in and wear uncomfortable business attire every day. I am allowed to come to work just as myself and that is good enough. :) The benefits package is very nice for what we pay as well - there was an issue initially in finding an available doctor but that's more of the insurance company's fault because they make it so difficult, i.e. we should just be assigned a provider is we are in the HMO program. \nWe also receive plenty of options for free items almost everyday. \nAnother benefit I didn't see mentioned here are the lovely people that work here - once you find your tribe, it is likely that you will make lifelong friends. In fact, I am going to dinner tonight with former co-workers and a few of us still working here.","We are not being paid a living wage and several co-workers have also expressed frustration with that and are seeking jobs elsewhere.  We see all this money being spent on 'fun' stuff for employee stress, mental health, karaoke nights, other events, and seminars but would feel way more appreciated if that money was used to increase our paycheck.  The discount isn't even that much and I still can't afford buying here, so it's not really an \"employee benefit\" for everyone.","BriarPatch compensates generously in so many ways!  I am very appreciative.","Support staff should not be treated as shift workers and receive zero paid holidays as we can't change our work schedules to work weekends etc. We don't get enough vacation to take holidays with our families and still have vacation left to actually take a vacation. Could be improved by allowing a few flex paid holidays so at least a few times a year, we could join our families. Pay is on the low end for skilled work, and does not keep up with inflation or local housing costs or the out of pocket expense for dental or health care.","The option to have unpaid Holidays instead of having to use PTO for Support Staff would be nice.","I wish there were clearer discussions from management when you first start about the potential for growth and pay increase as long as you show good performance and interest in BriarPatch. I think this could inspire staff to work hard and want to grow at the Co-op.","I think it would be nice to add an option to use sick time without being sick, a kind of mental health day option.  One example might be, if you are capped out on Sick Time for 3 consecutive months you can take an additional 2 consecutive days off and apply Sick Time.  Another option might be to allow people to use 8 or 16 hours of Sick Time anytime they are capped out on Sick Time.","My job is definitely paid significantly less than many others in my general area. I love the co-op but I do feel my pay needs a serious bump.","Wage increase methods/standards are not clear to me. I would like to make more for the work I do and know how I can achieve bigger wage raises","I wish there was an option for 6-month check in with potential for a pay wage increase (perhaps half of what the yearly pay increase is at that 6 month check in, then receive the other half for the yearly check in).","The meal break was one of the best recent additions to this benefit package, and I appreciate it greatly."]},{"Question":"41. Comments on Store Operations?","Comments":["Give buyers access to technology they need to improve effectiveness and time management. Doing this will increase productivity all around, enabling more tasks to be tackled and finished.","Front End should be helping face the store every single day, opening and clsoing shifts. It is never too busy at the last 30 mins of closing, to not have the store looking picture ready by the time everyone is off. Closing Manager(s) on duty should not be allowed to leave the store until it is at least 80%-85% minimum faced. It is a team effort.\n\nFront End should also be helping with date checking.","Sometimes events are not mentioned until they are happening. Or something is being sampled from the deli but we are informed thirty minutes before the sample event. I believe this is total, unnecessary stress for all parties involved.","ONE STORE ONE TEAM","I do not see the cooperation among departments, I am constantly left without coverage on my days off in my own department. other departments do not step in. I have been told by my department manager that I am not to offer to cover breaks for any other department that might be in need. I do not see any effort by my manager or supervisor to coordinate work with other departments.","#37- Sometimes plans are made without proper planning. For example, Grilling on the patio last August. This was put together from the ops team. The Deli ended up taking it over and organizing it. Meat Department was supposed to have someone grilling Jared and Steph ended up taking ownership of it. While it was fun and ended up running smooth by the end it was very chaotic at launch. RCA Deli did not have the staff to put it together at the time. I so happy to have Danny on board. So far, he is fair and set clear expectations. \n#39 I don't feel Marketing is open to ideas- I put a seed to highlight the scratch kitchen and bread program I only wanted a sign to place in the store. Auburn was not aware of these programs in the beginning. This is the response we got and still have not seen anything come of it. -- Hello!    Thank you for your seed idea about Highlighting our Scratch Kitchen and Fresh Bread Program.  Here is the response from Marketing:\n-We are working on messaging for this. It takes time to develop an overall messaging strategy that aligns with all of our marketing channels (as well as design and fabricate the materials). You’ll notice a new bread cling where West Sac is at RCA.\n\n I love the willingness from David and Amy to do cross merchandising in the produce department they are great.","sin opinion","I love how we all work as a team at briar patch.  When the front end needs help, employees in other departments are always happy to help in any way they can.  The front end team also tries to help whenever they can to stock shelves or to face.  Auburn BP is the dream team!","We have a new Operations Manager that just started with us here, I feel like we are on the right track as far as having good leadership that is Co-op experienced and easy to communicate with.","We are a powerhouse and everyone, for the most part, is extremely helpful. We're all so willing to help other departments and work together. It's one of my favorite parts about working here.","We need more communications between managers and their storewide needs.","i think there could be a lot more cross over between departments. and more training on whats going on in the rest of the store.","There are Utility Clerks that are very helpful, but then there is one that mainly overlaps with my shift and he is frequently observed not helping or only helping for a moment and then needing to use a bathroom break or meal break.","I partly agree/disagree that the physical working environment (parking lot, retail floor, back rooms, equipment, rest rooms, etc.) of the store is safe - mostly because we do not have secure employee parking and where we are expected to park has become overrun with homeless people. There have been incidents of people trying to break into employees vehicles and someone even had their tires slashed recently.","a lot of our equipment needs to be replaced or upgraded. sometimes safety concerns are addressed immediately, and sometimes it takes until someone hurts themselves. it would be nice if we hired one or two more facilities people and had them working at night.","Since I've been here, it's been getting worse and worse within the years and it's slowly building up to be a full-on collapse in the future","It takes a shockingly long time for smaller things to be replaced, like brooms, etc..","The aisles in the warehouse are often blocked by carts or boxes, which can be dangerous in an emergency.  The parking lot is at the top of the hill and very dark at night which can feel very unsafe.","Communication both within departments and from dept-dept could be stronger.","I guess we are calling box cutters technology now.  Efficiency is a two edged sword.  Customers have felt brushed aside.","I don't feel our parking situation is safe. There is often unsafe behavior happening on Litton Drive even during the daytime. I dislike parking that far up and it can make for an uncomfortable start to the work day. Most of us that work the evening waste a whole break going up to move our cars down close to the store so we don't have to walk up the hill in the dark, we work a physical job and shouldn't have to spend our breaks walking. There are often people (mostly men which is an added red flag for us women) camping in vehicles that we have to walk by late at night, some of them are quite full of garbage etc. or there will be piles of trash on the ground, sometimes it smells of urine. The sidewalk is poorly lit and it feels like no safety precautions have been taken for employees. Not to mention the physical burden of the long uphill walk after being on your feet for 8 hours. Sometimes the parking situation makes me not want to come to work.\nAlso sometimes, especially the holidays the store can feel overcrowded to the point of feeling unsafe. The feeling is more pronounced if there isn't a manager watching the floor in real time. It seems like the massive numbers of customers daily combined with lax enforcement of rules like no pets in the store and someone watching for theft make the space feel chaotic and on the edge of being an unsafe work environment. There isn't time for us to watch customer behaviors while getting our work done which has increased along with our increased customer counts. There seems to be a need for a person on the floor watching the flow especially during peak times. Typically management is busy and not paying attention to these details","i feel there are times that we need to know more people from other departments. I dont know many from other departments so would be helpful to know who to ask when I need to","I think we have just been stretched thin for the last 8 months and that everyone is doing well but generally everyone is kind of their own island and communication errors or staff stress builds without long term fixes","I feel there are times when there is a lack of leadership present in the store.","I love getting to work with other departments around the store!","Although there has been more interdepartmental assistance around the store we are over all understaffed for the amount of service we are expected to provide. There are many places inside the store that are hazardous and are in need of repair, also many warn out tools and not always enough cleaning supplies. Outside the store has some hazard points as well with broken concrete and bent railings. I understand that not all of the broken or bent parts outside can be fixed quickly but there should be caution warnings for them. Temperature regulation within the store needs to be better, we often have issues with parts of the store getting too hot and humid making it unsafe to work.","The safety of bpfc has gone way up since I've worked here and I'm pretty proud of us. Concerns are delt with in a quick and timely manner and have really improved. While I don't think I have the tools to do my job as quickly as possible I can still get things done in a timely manner and most equipment is expensive so I'm in no rush to replace anything. From a Deli standpoint I don't feel like I know any of what's happening outside of the Deli, even in other departments within the Deli. I feel like we're never kept in the loop with anything even when it involves the deli and I feel as if the rest of the store views the deli as an enemy for some reason.","There are to many staff members working in our small  area.","I only put disagree to the safe working conditions, because the walk ins and most prep areas are just too packed, we have outgrown the space. Its cramped and hard to maneuver. No one's fault, but it's still my observation.","Having worked here for 7 years, the deli part of the COOP used to be run smoothly and efficiently. In comparison to how it's run now, it isn't very good.","I am always grateful when we need to call for help in the Front End that most all departments are able & willing to come running when needed.","Coordination between departments is an area Briar Patch has struggled with for a while. Communication between departments, primarily Support Offices and the Store, can use some reform.","Within the store, I feel that work with other departments is well coordinated. Departments that do not work within the store (marketing) seem to actively make my job harder by making decisions that directly impact my work with no consideration for myself or my team.","Much needed information is not shared within the staff.","Parking is an issue for me, I don't want to walk up the hill in the dark when I am alone in the dark. I feel there could be some extra overflow spots across the street or in the covered parking area to be used only when needed.","We don't have an employee parking lot and sometimes have to walk across a super busy street with no crosswalk. Once again, there is no training.","In the physical work environment I feel mostly completely safe, the only thing is doing a cart run at night. It can feel a little spooky and unsafe sometimes.","The team across the various departments really work together to support each other. It is truly a communal space.","In general, I have the tools I need and am able to do my job. However, I miss the powerful tools that we created ourselves when I worked in the Pricing Department. My suggestion to revive some of them met with resistance from the IT Department and did not receive a lot of support to convince them otherwise. As a result, a lot of the procedures have returned to their manual, paper-based and less efficient previous incarnations, and some tasks aren't performed at all anymore.","Technology to perform my job better has been promised but not forthcoming.  A second request was made and still nothing has changed.","The parking situation on Litton Drive has become dangerous, with people living in their cars and sleeping on the sidewalk. The road is hardly lit and there are stretches of the road that are not lit at all. I have witnessed drug activity while walking into the start of my shift. I do not feel comfortable walking to my car in the dark and the suggestion that we walk with a buddy instead of actually taking action to remedy the situation is absolutely negligent; it makes me feel like my safety is not a concern to my employer.","We should do a fire drill","I think they do a great job.","No lighting on street going up to employee parking. Pathway next to butterfly garden from litton to customer parking lot has no lighting. Almost fallen many times","Question #39: Solutions for most are being worked on.","When you don't use the accident plan or many of the safety processes almost ever, then you need refreshers. It would be nice to have video recordings to reference to on safety for refreshers. I don't retain written words.","I think the bathrooms in the support offices could use better lighting (but that's more of a building thing as we don't own that building). \nI did have an incident with a broken bowl on the sale floor and didn't know where to find a broom or what the protocol was for that, thank goodness a co-worker was able to help me out! \nThe works of my department in coordination with other departments could be better but we are in the middle of fixing that right now. I mentioned one little thing to HR and now there is a huge effort to fix this - it's fabulous to know that management real does hear you!","Sometimes its hard to get a hold of some users.","I think Danny will be a great addition to the Store Operations needs that was previously lacking.","Cooperation between departments can always be improved.","While some processes are running smoothly, others are not. Some people seem to ignore some of the processes. Additionally, there seems to be low oversight into what is not working well. There seems to be a communication and operational gap between the store operations and admin/support teams. Because of this, some processes are not running smoothly and are not efficient. Also, since these sections of management are so separate, I don't see BP functioning as a cooperative team. It seems like Operations does their thing and Admin does theirs. However, there are places where more communication and coordination are needed. I believe this to be true at each store location and between stores.","The departments don't appear to be coordinated save through their own efforts to do so, which can sometimes lead to blind spots breaking down communication.  The type of broad oversight that could assess whether all the parts of the business interoperate and communicate in an effective manner doesn't appear to be present. The benefit of that oversight would be an individual who is aware of the high-level movements of each department, how they interact with one another, what needs to be communicated and how, and in a manner that clarifies and establishes an interdepartmental workflow.  I think this may be an intentional \"down up\" approach rather than an \"up down\" approach, but also think that breakdowns in communication occur because each department doesn't have the visibility of how all the departments fit into one another and therefore have understandable blindspots.  \n\nAs an analogy - the benefit of having someone direct traffic is that they see all the traffic lanes and can (presumably) make the best decisions to effectively move that traffic through an intersection.  Without a traffic director, the drivers can figure it out clumsily, but they don't have the entire picture and are less motivated to make the most efficient decision for the whole than they are the most efficient decision for themself."]},{"Question":"51. Comments about Department Operations?","Comments":["During stressful times for the store overall due to stock issues or staffing issues, my department has not ceased in productivity nor levels of morale. Being supported by such a great team of people both inside and outside my department makes working for Briar Patch such an enjoyable experience. We all take our positions and responsibilities very seriously.","Positive praise for hard work would be more than appreciated. That being said, when it is communicated to a higher up about clerks not doing their job correctly or even...at all, it needs to be addressed multiple times/ until the behavior is fixed. Buyers can only say and do so much. When clerks do not do their job, it falls on the shoulders of Buyers.","THE SHOPPING FLOW STILL VARIES A BIT WITH SEASONS, BUT TRENDS ARE STARTING TO FORM. MAKING EXPECTATIONS CLEARER AS THE STORE GROWS.","There is things in the department that definitely need to be worked on and well as the way the department runs there are definitely improvements to be made","we do not have clear and defined goals other than to increase sales and production, I do not get department cooperation but am expected to cover others, conflicts are not delt with by management, expectations do not seem to be the same for everyone. ex some people get talked to about to much time in the bathroom others do not. High quality work needs consistency. things are not being done to the best of there ability.","Deli is a joke and the big wigs are far too busy to step in and say anything","# 47- Only because we have so much, we are responsible for and honestly not enough hands to help. \n#49- I see a lot of inconstancies with and follow through with the FOH staff.","deli kitchen is not fun","there is a blind eye from management for certain things and persons...","sin opinon","I am so happy to be working with such a great team.  My department works so well together, always helping in any way they can professionally, as well as emotionally supporting each other to make for a great work day!","Very supported and comfortable with asking questions and receiving tools that I need to be successful","This is my biggest issue. I have been talked down to by multiple leads/managers, for things that THEY DO as well. I want to give a small example that I've noticed happen multiple times. Occasionally when we are slow, two of us cashiers will be at one box chatting a lil while waiting for some customers or when we've completed our downtime tasks, and one of our leads will tell us to stop talking and do something. Now, I get it, it's our job and that would be fine, if they didn't also go and do the same thing they told us not to. I have noticed they allow it to happen when it's with them, but not when it's other people...just kinda icky. There are also times when I truly question whether or not they do the same work as us as well. I know a majority of my department does most of the downtime tasks, however I know of a few who choose not to, and instead choose to tell others, in very snide ways, to get it done, when they too have the ability to get it done, and it isn't a situation of them needing someone else to do it, because OTHER leads/managers do them too.","I've had my fair share of experiences with toxic work environments, and I can tell Briarpatch truly wants a safe and peaceful workspace, even if issues arise within the team.","Bakery is a shit show with how we are managed. Our manager, Sarah, does not plan things out and we have had to scramble and stress to get things done last minute. I experience an increased severity in headaches due to her expecting us to get a significant amount of work done in a very short time frame, without herself helping us too.","we're kind of seperated from the rest of the store so we kind of do our own thing. most of us aren't interested and going to the OBM meetings. it feels like most conflicts aren't really handled by management. they either get resolved by the employees, or people get write ups/fired. it also feels like some people can get away with not doing any work or outright ignoring what supervisors and managers say, meanwhile some people have one bad day and they are pulled into a room with the deli and bakery managers for a 40 minute talk. favoritism is rampant in briarpatch, and in the bakery our manager doesn't ever handle anything. i go to the boss above them, people are talked to immediately.","The bakery has become a very unorganized, mess. The manager does not know what she's doing and is incompetent of being a leader. It's almost like were still leaderless with her here than without. The two supervisors are the ones that very well carry the rest of us through each shift. I feel like they're more of a manger than she is and can actually take responsibility more. The only thing I look at the manager nowadays is the person that makes my schedule. I really hope one of these days she gets looked into and something is done about that because if not, the entire bakery will walk out.","For clarity of my answers, Center Store does not yet feel like a united department in the morning. The parts of it that used to be Grocery, Wellness and Perishables still operate almost completely separately and don't tend to check in on or help each other out. Being understaffed is a big part of the issue. I'm not saying everyone needs to be fully cross trained in everything, but more people just checking in with the \"other parts\" of the department to see if they need help wouldn't go amiss. Maybe we could make a mini game out of it.","Alot of communication in my department happens without me, usually in a group work text that I am not included in, so i definitely feel left in the dark about some things","I do think personal relationships can affect the way some managers interact with subordinates. Certain people seem to be given more allowances in certain areas while others will be verbally reprimanded for the same behavior.","To my knowledge, Center Store, does not have clearly defined objectives.  We stock, face and clean the store.  There is no plan for development.  At every review I am asked what I would like to learn.  I no longer participate because it has never happened.  There is no consistent transmission of information and my department manager has never had a meeting with me where my objectives and performance expectations are discussed.  A year ago he downgraded my supervising managers review and never even bothered saying why.  He has seen my performance a dozen times as my department manager.  I feel like I am aiming at a moving target.  I was effectively told I wasn't meeting a standard that I knew nothing about.  I still think that I was treated very unfairly.","I believe that upper management is very competent, however some of the assistant managers are left to be in charge when management is not here and they aren't well trained to handle situations that come up on the floor. I think if they are expected to manage store flow and issues they should be comfortable with all sorts of customer interactions and any expectations of their leadership should be made clear to both the assistant managers and the employees they are overseeing.","it would be helpful for the AM and PM crews to communicate better of what has been or need to still be done.\nalong with the different sections of the dept if working a different area for the day","I have not yet attended an OBM meeting, only attended one department meeting so far.","I feel like center store is too big or busy to effectively balance all these moving parts.  Smaller components feels more effective with team leads to keep everyone on task and in the loop.","Given a lack of leadership presence, I generally do not know who to bring issues or concerns to in order to get an effective result.","My sub department is great I love my little world, i'm attached to FOH though so all the Negative things are towards the FOH aspect not my sub department.","The systems and structure in place currently are not working and are making it difficult to work as effectively as we possibly could. The onboarding process is lacking in training documents and is not a consistent process often leading to people being under trained and making more work for everyone overall. The day-to-day operations need better structure as well and could be greatly improved by being more streamlined and better documented. Many roles have become blurred and made less efficient due to a lack of clarity in responsibility. Training for promotion is also almost entirely nonexistent and in need of improvement. Workloads are becoming greater as the number of staff has shrunk and has created the inability for many to get all the station specific work done as they need to be spread across multiple areas creating less effective usage of time.","There are goals for the deli, but they're everywhere and there's little to no follow through with them at all. There are all these new ideas floating around, which I do like, but no actual plan or implementation of these ideas. Not to mention a lot of these ideas if they do go into effect have no forethought, they seem half made and sloppy. One such idea is that a new service case person would make fresh salads everyday and then do support tasks, this absolutely would not work with the people we currently have. It makes me wonder if they thought about what would happen if this person called out? Would we also be hiring a support person to cover that shift for the day, or would it be another thing left for the supervisors to worry about with a plate this full? If they were coming in for mids would we have no salad in the morning? What about their days off, would we have 2 service case people, or would this just be another thing stacked onto the very full plate of the supervisors? Which leads me to the next thing, which is the absolute overworking of the supervisors, we are left with no people, no support, and having to do the work of 3 separate jobs not even including our own. Now managers are adding more responsibilities onto the supervisors who again already have a very full plate, which means we either are going to need a much bigger plate or management is going to need to start implementing more help for us. Not to mention the toxic gossiping that the higher ups get on us about, I don't know if they realize that a lot of it stems from them. One thing that has been said about it is that the managers hear everything you're saying, which is true, but they don't realize that we also hear all of what they're saying. Word travels fast, both up and down, and we hear managers talking bad about employees in an absolutely non-constructive way whatsoever. It is not at all a motivating thing to hear and this toxic gossip circle can only get better if it starts from the top. I've heard of managers saying things about wanting to get employees fired soley because they don't like them, I've heard managers yell and cuss at employees, I've heard people be called names like idiot, crybaby, stupid. This is unacceptable. The deli needs work bad and that work will take time but that can be planned out and thought through, but it all needs to start from the top. I have a lot more I could say, this is only the tip of the iceberg of deli problems, but for the sake of time I have to move forword.","\"co-workers\" had a \"problem with me\" that I never knew about or was confronted about.  I never knew who the people were, or what the problem was but was still reprimanded with up to 2 other supervising figures present as witnesses telling me my attitude was bad.  How could i fix it?  I didnt know what i said or who I said it to, or who was upset with me.  So no, my supervisors and managers are not adept at diffusing issues among staff.","There's a lot of conflict between people that comes up again and again and, while they may resolve it to a certain degree in the moment if something happens, overall, it just keeps happening.","I touched a few pages ago about my thoughts on OBM & that I don't necessarily feel like I understand fully.\nAs far as our FE department meetings - I know they're important & necessary - but sometimes I feel like they are wasted time with no useful information. Not always - but sometimes. I suppose it's good that we really only meet for those meetings once a quarter.","I feel as though my department could use more effective and timely communication and leadership from the Manager.","There is nothing clearly defined in my department. I feel ZERO respect from my department. OBM meetings aren't useful because I never get to go to them. Nothing is fair and consistent here.","There is room for growth in the lower leadership of my department. But I have many tools at my disposal to help enhance this process.","My position was moved from Pricing to Ops right before I started, and there are definitely still some kinks to be worked out. I might be more aware of the discrepancies than my counterparts in this position, since I used to be part of the Pricing Department and they both came more from an Ops background.","Many employees in my department are not supervised closely during the times that they work.  Labor sharing is uneven, and some are able to avoid their share.","RE: QUESTION 46 \n\nYES,  ON  DEPARTMENT MEETINGS\n\nNO, ON OBM GATHERINGS","I believe there are some areas that are well coordinated in our department, but other areas still need work.","There are times when my manager takes a while to come around to changes and ideas but I feel that they have to weigh the options (pros and cons) of things before committing to that change. When I first started it felt like she wasn't hearing me but then my co-workers informed me to just give it a minute, that my manager heard me and they will circle back around - which they did! For new people, I did hear the same thing and basically had to let them know what my former co-worker had informed me. \nCooperation among co-workers in my department is sometimes difficult as a new-hire liked to say, \"I do the bare minimum so people don't ask more from me.\" I really didn't appreciate this statement as they said it a handful of times and I just had to let them know that that wasn't okay and they should put their best effort in being apart of our team. That didn't work so much but, they did start to complain less, they keep their head down and still just do the bare minimum or the easier tasks in the office. \nEnding on a positive note, literally every other co-worker is fabulous, smart, coordinated, helpful and attentive to their work. We track out mistakes in the weekly OBM and hold each other accountable. I greatly appreciate when even managers admit to mistakes but more so appreciate when we give kudos to each other and ourselves because sometimes it's difficult to even get out of bed let alone make strides in the Co-Op community. We are here to win because we are Stronger Together.","We are not encouraged to offer suggestions or bring solutions.  Our workload is not even.  Our workspace is very cramped and noisy.","In regards to Question #48, I find the occasional use of generative A.I. by the Marketing Department morally dubious at best, and actively in opposition to BriarPatch's claims of sustainability at worst. I also find the quality of work many of these programs tend to produce to be far below the standard I would hold our department to. \n\nI haven't brought this up in person because I know it's something of a hot-button issue these days, and do not wish to cause any conflict. However, I think it's worth examining the negative impacts the use of these tools have on a global scale, especially from an environmental perspective.","OBM meetings dont give me value in my position. However, the value is present for most other positions.","I believe my team is great and runs well from the upper management to individual employees.","My ability to produce high quality work is dependent on the accuracy of the information given to me (which is not always correct). I value high quality work and accuracy though and do my best with the information I have. I believe there are channels for me to improve things in my department but not overall store operations. When talking about a potential need, improvement, or idea involving another department I am redirected to my own department and have gotten the impression that there are strong lines between departments.","We're more organized than we have been in a while but still have room for improvement.  I feel like our work product can sometimes suffer in accuracy which is something I'm working towards with occasional intercepts of work product and returning with caught exceptions."]},{"Question":"60. Comments on Human Resources practices?","Comments":["One of the best parts of the patch.","I FEEL SUPPORTED BY OUR RESOURCE TEAM. I FEEL THEY PROVIDE BEST INTRESTS.","Some people in HR seem to cause more problems than fixing them. Most don't care that working conditions here are lame, or they dont even seem to see the problem at all since they have little to no involvement in the actual work that takes place in any said department","I'm happy that human Resources help me with providing documents and training in Spanish for one on my staff that does not speak English well.","very limited hours, I rarely get to see hr workers. havent had a good experience with any of them besides Danielle.","I have only had the pleasure to meet with Emma and Danielle, and they are both a god sent.  They are always available with their open door policy.  I feel confident in telling them my concerns.  I had a personal problem that could have turned into a work problem for a while, and Emma was extremely empathetic to my situation, and helped me feel safe and comfortable.","I feel like there is always going to be a fear of retaliation when there is an incident. It is human nature too feel fear.","I have no issues with y'all in HR. You guys are fantastic and have helped me/been there for me whenever I needed it. I love y'all.","I will say there has been things said about race and religion that have not made me the most comfortable, as I am from a multicultural background. The surrounding environment is very split when it comes to human rights and educating yourself for the better part, and I think putting in a valuable effort to stop and educate someone about what can be considered offensive to poc, lgbtq, and more. Maybe some kind of seminar about how to better support those around you that identify outside the box.","I've been asked by management on why I needed a mental health day and if it was really that important. I have had someone decide to try and cut my hours without asking me because of assumptions that would hurt me instead of help. The path to hell is paved with good intentions or so they say, and sometimes it feels like if we just asked what employee needs were and how we can support as opposed to ASSUMING how we could support because we truly don't know what someone needs unless we ask.","Still seems like a lot of male leadership. Would love to see women being more supported in leadership roles here.","I have had an email I sent to HR shared with the person I was having a problem with. I do not feel comfortable nor safe going to them if there is an actual problem.","The handbook does not give the amount of time that is required beforehand when requesting leave, leaving it more to the department which they don't clarify.","Human Resources are available and responsive whenever you need them.  I feel very well treated.","HR has always been a great asset to me! Thank you Ladies!!","I do not always feel safe reporting issues for fear of retaliation. I do not feel as if I can bring up concerns about my superiors without potentially ostracizing myself or others.","I have my employee handbook & it has come in handy over the years when I have questions - but I can't say that I've really ever read it end to end.","While I believe it was covered in both the handbook and during orientation, I'm still not 100% sure on what I'm supposed to do if I have an issue of this nature.","The complaints I have made in the past, specifically about one or more members of management, have been ultimately ignored and swept under the rug.","It has been proven that the HR department only take certain claims seriously. HR practices are literally atrocious here. They personally discriminate.","The human resource team works really hard to support both the staff and management with both personal and work related situations and/or issues.","People with mental and emotional divergence are treated equally as long as they are nice. Never show anger or sadness, that must be suppressed.","I think the department is really well organized and helpful.","They are wonderful, thoughtful and caring people.","HR is great."]},{"Question":"71. Comments on Training and Development?","Comments":["Dishwasher training could be improved. Many times new dishwashers don't know how to close the dish area properly and don't clean dishes thoroughly. I think this could be improved with training","New employees are usually just thrown to the wolves and get assigned random tasks that don't require too much oversight. I feel they would benefit from an organized and structured checklist of duties, starting with the easiest and moving onto the more complicated tasks. Repetition is key. I feel certain tasks are rarely done and then need to be done later on and by that time, the employee has forgotten the procedure. Also, it seems like instead of people getting promoted or trained for management or supervisory roles, employees get sent down here from the other store or hired off the street. Just my observation.","Training is slim for new hires.\nCompany is unwilling to host refresh training sessions for employees.","EVEN IF THE LEARNIGN CURVE IS NINETY DEGREES, THERE ARE RESOURCES  TO  GUIDE THROUGH PROPER PROTOCOL","my evaluator only gives 2's so there is room for improvement. this makes it feel like why bother if your only ever going to get a 2 anyway. my evaluation was not clear.","#70- I did my own goals and did not sit down with my manager for the March review. I have only had one review since being in my role 2 years now. Part of that was Sam's fault :) I love constructive feedback and areas I can improve. \n#63- I just want to mention I take training very seriously in my area. I don't see the same from FOH deli and it's frustrating.","My manager is the absolute best trainer.  He explains everything very clearly, and shows us how to do something we dont know how to do.","I like that I have been given training materials and classes to keep my skills fresh and advance my knowledge and leadership","Look, every store struggles with Training in my opinion, but sometimes it truly feels like we hire someone and then just expect them to know what to do or have someone who isn't getting the pay to train someone, be forced to do it anyways. When I transferred departments once, I had someone training me who wasn't a lead, or a manager/supervisor and I felt like it was unfair for them, because it was extra work. I never even got trained by the manager and I had no idea how they liked things to be done because I rarely ever saw them, so I just had to go off of what I was told by my co-worker.","I do believe, again, there needs to be more education on matters that affect poc, lgbtq, and so on. It's important that especially in the area we live in. Briarpatch stands to openly support communities a lot of people refuse to understand. I think more education on these matters can really make a difference.","Some departments don't have the labor to train staff correctly and give a throw them to the wolves learn as you go attitude and while as a team, we are all here to support each other that doesn't replace adequate training","My manager told me last minute that we had a new hire and when I asked where they needed to be trained, Sarah did not know and just said to train them \"wherever needed.\" A couple days later, she backtracked and said that the other supervisor and I shouldn't have had them help other stations and to keep them in the dish pit.","i believe promotions are tied to who likes you. i was rejected for an internal promotion because someone who didn't work in my department didn't like me. as for training I think for the most part our training is okay but I think in our department our manager doesn't properly train people consistently. every job description end's with \"and whatever else we ask of you\" which feels like the corporate way of telling you that they can ask you do the work someone else should be, and claim that it's your job. before my promotion i was regularly asked to do the work of a supervisor, while they wouldn't give me the position and wouldn't give me more than a 30 cent raise for doing so. i would be in trouble when i didn't micro manage everyone and save every mistake from happening, and I was viewed as having to do all of this. it feels incredibly absurd that I can be told my job is whatever they ask meanwhile we have job titles that revolve around the things they ask of others and just saying \"whatever we aks\" cannot be as all encompassing as they very much try to make it out to be.","Since we have turned to center store concept, training has been lagging.  \nTraining is different than briefly showing a co-worker an overview of a department.\nIt takes time to teach someone proper procedures.\nThis is not happening.","Some employees have not been able to be trained properly due to time or being short staffed, so they are left to figure out alot on their own which leads to mistakes being made.","Other than do more faster, I am not certain what the expectations are.  I put stock on shelves, I face product and I clean the store.  There are no avenues for increasing my responsibilities even by a small measure because there is no time, no staff and no plan.  When I start all the decision makers have left and while my shift manager is very good he does not get all the information.  The coop does not have a plan for assessing the skills and ideas of current staff to see what improvements can be made.","On-boarding training when I first started 4 months ago went very well. On the job training has been hit and miss, most everything I've had to learn as I go, this area could use improvement. I have not yet received an evaluation and have had very little feedback on my work performance. I am not clear on goals or what I need to work on.","I dont think the Briar Patch really imagined having as many employees with 8+ year \"Careers\".  I feel that wage ceilings should be increased in the employee in question is still improving themselves, customer service and creating new goals that advance the Briar Patch as a whole.","Sometimes I wonder if the management and home office leaders know i have 3 decades of experience in running Natural Grocery/Supplement/Body care departments.","It does not feel like there is much potential for growth in the department as I have learned most of the positions and I do not see a potential for promotion. Cross training with other departments does not feel like a possibility and there are no openings that could teach me much that I don't already do. I have been with the coop almost 10 years and do not feel like there is going to be much mor room for growth.","Training in the deli needs a lot of work. There is no communication of training, no training outline, no consistency. Higher ups want us to focus focus focus on training but give us absolutely no time or people to focus fully on extensive training. Not to mention that management complains constantly about the speed of new people, even if they are fast for a new person they are given much grief for not being as quick as the people who have worked here for YEARS. Not to mention there is no leeway with new people, their small mistakes that are very typical of a new person to make are penalized and treated as if they threw vanilla extract on the grill. I understand we want to hammer the point of doing your job correctly, but these people don't know if they're doing something wrong when they don't know what they're doing at all. We need to have so much more patience for new folks instead of just throwing them to the weeds and praying they make it out","hard to select \"strongly disagree\" on #65 but i had to.  Efficiency and multitasking are paramount maxims in cooking/foodservice, but on sandwich station, none of those lifelong developed abilities come into play.  because essentially you just make one unique sandwich after another.  cant get in a flow.  too easy to get buried.  even Emeril Legassi or Gordon Ramsay would have no chance, their life skills also dont apply either.  I cant think of a way around this,  there probably isnt one.  however, experience does provide a huge boost on grill and barista.  and i would imagine on prep shift too.  I know grammar and punctuation, but this survey i can complete faster without paying attention to it.  Was told on one occasion by my manager after a verbal job performance warning that my very positive \"check-in\" evaluation was basically worth nothing and that it was asked of them to keep the check-ins \"positive\".  because of this,  i was completely blindsided by a job performance issue that i wasnt aware of.  Not cool.","I haven't been through our training program in Many years - so I am unclear on exactly what they cover in orientation. I am assuming its clear & concise information.\nSometimes the department training process can feel accelerated & too fast - but am always hopeful that the new hires are willing to ask questions & not feel overwhelmed with things that may have been skipped over during training.","There is a lot of work I do within my department that is not outlined.","I have a fear that if I would try to advance, the way certain managers feel about me will stifle my progress.","The job description is nowhere near enough information to fully understand how to do your job effectively. Everyone is on different pages. Opportunities are available for the \"favorites\" to develop skills and knowledge, but not for everyone. I have most definitely not been clear on the goals I need to work on based on evaluations. My evaluations have always been good. Comments weren't made about \"inadequate work performance\" on my evaluations, and I have no write ups. Just made up excuses from you all.","I feel as if the training that i have gotten here at Briar Patch has been very useful to me.","Training for new hires is decent, but there is opportunity to improve. A culture of training is a culture of retention.","As I wrote before, some things got lost in translation in my job and job description when it moved from Pricing to Ops, and certain responsibilities and procedures became less clear. I also sometimes notice a lapse in consistency between employees in other departments, and I wonder if a higher turnover and maybe other factors have negatively impacted onboarding and training.","Despite excellent evaluations, I feel like I have nowhere to advance here.  I do my best in my job but am given little actual support - just lip service.","the pile of training documents that must be gone thru with new hires is a slog! I have spoken with HR about revamping some of the documents to make them quicker and more relevant. Meanwhile, I've seen in other departments that they don't bother training their team members on some important tasks at all.","There are opportunities for professional development classes, but it is hard to find the time.","We spend a lot of time and energy training new employees on how to do their jobs, but managers get a fly by the seat of your pants style training, and it tends to miss a lot of information and tends to spread bad habits or wrong information.","Training for Manager/Supervisors could be improved on.","The check-ins with the manager every 6 months assigns clear goals for the future (if that is your goal) as some people like to stay exactly where they are and others want to progress. An internal candidate was highly qualified but not promoted and thus they left the company (though how much those 2 things correlated, I am not sure). \nAn interest in promotion and increased responsibilities was met with differing and more difficult responsibilities with a promise of potential promotion later with clearly outlines goals. I guess that's just corporate so I won't harbor on that to much. Opportunities to develop my skills took months for my manager to put into play, I eventually went to HR and asked for training and I think that put the spotlight in my supervisor's mind that I was serious about outside training and it became available within the month. Go HR!","Training is haphazard and not easily understood.","Sometimes it feels like we have to set some arbitrary goal for no reason, when our goal is just to get the work done as well and efficiently as possible.","Training barely effects me in my job.","I appreciate the training and development opportunities that exist and would appreciate learning what I can do that would advance my level of responsibility and compensation."]},{"Question":"80. Comments on Supervision?","Comments":["Center Store has no department manager.","I FEEL I CAN REFLECT ON MY GROWTH AND NEEDS TO BE BETTER.","not everyone in the deli is 'supervised' the same","My managers are the absolute best.  They are so encouraging and supportive to me and my department.  They are so respectful in addressing problems or concerns they have for us, and only want the best for us.  Thank you guys!","My department head and managers are great, however, I've noticed, because they all do things a bit differently, there tends to be a bit of miscommunication between myself and them. One manager tells me somethings okay, and the other tells me it's not. It can lead to situations that can make me seem as if I'm questioning them, when in reality I'm just receiving two different answers from two different people. It can be stressful and frustrating for everyone involved.","I do love my team and my managers, there has been times where someone has said something uneducated about a marginalized group that was not handled properly. I do believe that at times when conflict arises, there's been tension or push and pull from either party that does not entirely make for a comfortable work environment.","I have been put on a performance improvement plan based on information that was inaccurate. I do not feel like it was fairly addressed when I brought it up to the issuing party and no constructive feedback or direction was given beyond \"use this as a motivational too\", I do not need to be unfairly disciplined to be motivated.","My answers reflect on both the Senior and NEW Store Operations Manager.","Sarah does not give supervisors the tools they need and often starts giving her tasks to the supervisors to do. She does not communicate well or plan things out. Ethan, one of the supervisors is doing a great job for being new to the team, but Sarah has not given him the training he needs, and I frequently have to teach him how to do various supervisor tasks.","instead of giving feedback, our department head has on more than one occasion brought an issue up in supervisor meetings and just stared at the person they have the problem with while talking to the group, making it apparent who they're upset with and who they aren't. this feels incredibly unproffesional and absurd. for the rest of the disagree's, read my past comments.","Most of the questions that are disagreed with are mainly pointed at my manager. The supervisors do an excellent job at maintaining each shift and do their best to fix the problems that the manager causes.","The bakery supervisors are amazing and always helpful when I have questions or concerns. The manager is helpful when she is around but rarely stays long for the night crew. A lot of the managers decisions are questionable and seem to favor some more than others. The manager does have very good techniques and abilities when it comes to making product.","Our department manager plugs holes.  That is all he has the time to do.  We cannot have a full staff meeting because it effects store operations, but it is what we need to do.  Because of this there is meager communication between shifts and sections within the department.  What communication that there is, is received defensively so that you just don't to avoid the anger and hurt feelings.   Trainings are geared for managers and not staff.  Feed back is not timely or effective, even though it is formalized.  There has been every effort to put a separation between sections and between sections and the managers.","when people have time off it would be really helpful to try to get someone in to cover part of the shift. it has been a hard few months on the employees that have been consistently here covering double the shifts and short staffed days.","I feel comfortable going to my supervisor and manager for questions or concerns. I have had very little feedback regarding my job performance other than \"Good job today\"","Things are very busy and stressful at times.  Many of us have been here a long time and are just self-directed.","John is a wonderful leader....he is positive and accessible...he sometimes makes promises he cannot fulfill, though his intentions are admirable.  I enjoy working with him and respect his leadership capabilities.","Like I said before I do not feel comfortable going to my department manager/ assistant Managers.  plz refer to the last management comments.  \n\nI do love working at the patch, I've been here a long time and gone through a lot of managers, this is just my opinion on this newest set in the deli.","I feel that the management is often slow to react unless it is an extreme problem and many things are allowed to go under the radar until it becomes a pervasive problem. It is hard to effectively communicate with coworkers across shifts and between sub departments. There is a need for better clarity in roles and responsibilities for each position and better regulation of time and tasks.","I think I gave my answer to this in previous question boxes, but to simply reiterate. I do not feel like management has my best interest in mind, there's no communication, a lot of favoritism, poor training, and no planning","There's a lot of performance problems that frequently come up and are not resolved in the long run.","I'm grateful to be a part of the team I am on. We make jokes, ask great questions and learn things from one another. We're always trying to figure out a more efficient way to do something, and we're quick with new ideas that will help us along the way. Having freedom of thought is helpful, and it truly makes you feel like what you're doing MATTERS.","There has never been a moment on this job that I didn't feel absolute and total respect from the people who run this place. I feel truly valued. Even when things aren't going ideally, I know that there will come a time soon enough when we'll find balance.  After all these years, we still find balance.","These answers only apply to the current Front-end manager, none of the assistants or leads.","I am being discriminated against. There is no timely feedback. There was NO feedback. Nothing negative was ever said about my work performance, until I was being unfairly punished for a fabricated list of things that don't even begin to make sense about my work performance and my character. If there were that serious of issues with my work performance, those issues should have been addressed. Show me when these issues were ever addressed. Any of them. I've never had to go through something so unjust and unethical in my entire life. The fact that all of this is coming from a food coop that is supposed to be like family, is the most insane part. You guys are supposed to be better. DO BETTER. Treat EVERY associate with kindness and equality.","I feel let down here most of all.  My concerns are not taken seriously. Repeatedly excuses are made for subpar performance of coworkers, which leads to my reluctance in addressing problems.  This often leads to frustration that is expressed all at once.","Matt is an awesome manager!!!","Again, so damn lucky.","I work with a great bunch of people and our manager is fair and very approachable.","I did let my supervisor know that I am open to constructive criticism and would appreciate immediate feedback when mistakes are made so that I can train my brain to the correct method immediately. They have done an excellent job with this and I greatly appreciate all of their positive and constructive feedback.","My department manager is great!","I feel my department managers are fair, firm and friendly.","It is my impression that I don't know about how performance problems are addressed due to confidentiality.","The pricing manager does a great job with communicating, replying to questions promptly and thoughtfully, and including the dept as a whole for discussions when it comes to goals/objectives of the department.","I am a manager at this time, so am answering in the context of being amongst other managers and as reporting to the director I report to."]},{"Question":"87. Comments on Job Satisfaction?","Comments":["my best working place in the world","This place is great!","I am satisfied with my job because I have had terrible jobs before. That being said, things for sure could be improved on. When Glenn left and people from SCD started showing up and demanding they know everything as well as arrived with new rules and hostility, it became very hard to work here. Since then, we have obviously adapted, and proven that we know what we are doing here. Because this is a different store with much different demographic.\nI think RCA should have been approached with understanding and flexibility, rather than a hostile sternness, like this is the military. It's a co-op...we should be on the same team.","I do love it here. It is far better than any other food/service place I have ever worked. Of course things could improve in certain areas, but in my opinion, they are minute.","THIS IS LIKE A HOME,  THE PEOPLE ARE GREAT. IT IS A COMFORTABLE PLACE TO WORK","Harder work /=/ more pay\nMore pay = more time sitting on my butt\nHarder work = more responsibilities\nMore responsibility /=/ more credit\nIt's a little backwards yea?","I love working for Briar Patch. I've had some terrible jobs in the past and this one is the best.","I am generally happy but would love to see more fair treatment. When you see favoritism, it gives me the feeling of why I should care. Deflating.","Working at briar patch has been a dream.  It has pushed me out of my comfort level, and showed me that I can do things I didnt know I could, or believe I could. I love working at the coop for so many different reasons, and would love to work here forever!","I love working here, it is rewarding, and I am proud of what we have here together as a Coop/ coworkers and customers I love the diversity that patrons here.","I love this job. It's the longest standing job I've had, (kind of embarrassing), but it truly is because of the people I work with. I don't feel like I'm overworked, and I feel as if this company genuinely wants to properly take care of its employees.","I love the coop and the people who work here but we still have a little way to go in terms of communication, staff/department needs, labor/staffing concerns, and compensation. I want to build a long-lasting career here and invest myself into the Briarpatch but I have to also feel like the Briarpatch is investing in me and the other employees who do everything they can while feeling like they can never do enough or that they aren't enough.","There have been times I felt that employees would benefit from more positive reinforcement along with education, training and specific feedback. That said, it does seem like there is effort to do so when we are not on a skeleton crew simply trying to get by. Coworker shout outs and customer shout outs are great but hearing it from your own supervisor occasionally would be valuable.","I love the principles behind the Co-op, but feel in the bakery that we don't practice these. I plan to leave Briar Patch for a career change soon as the job is too demanding and stressful. We are constantly short staffed, but told we still need to get the same amount of production done.","i will be looking for a new job in the next year.","I used to be happy, then over the years you look at everything and you really see the true problems that this place has. Until they are somewhat resolved I don't recommend people to work here. It is slowing but surely turning from a co-op to a corporation.","I create my own job satisfaction.  I love the team I work with and I judge the quality of my work.  Sometimes it feels like we are being watched to make sure we are not goofing off or stealing time.  In the time I have been here the responsibilities have only increased.","Overall I'm very satisfied with my work here. The funky parking situation is burdensome though and a continuous issue along with the wage. Even though the benefits are wonderful I wonder how sustianable working here is for me over time.","I love the BriarPatch and consider this to be my forever career. Thank you!!","Briarpatch has been one of the better jobs I've had. Its a welcoming work place with nice people and good work environment.","Im comfortable enough personally, but Ive climbed the ladder. Couldnt imagine starting from the bottom, but a job is necessary and all in all the Briar Patch is a great workplace for the majority of people.","Overall I am very appreciative & love my position and job here at Briar Patch.  I feel very supported by my immediate manager and teammates and other departments here in the store proper.   I do not always feels the same level of support and open communication with all departments and managers.","Thank you Briarpatch for being a pretty good place to for the last 13 years!! I hope to see 13+ more years.  I appreciate every benefit they provide for their staff!","Though I am happy to work here and have recommended people to work here recently it has become more difficult to do so when I do not see many paths for growth or advancement. The pay is no longer competitive and though the benefits are helpful they only bridge the gap some and my not be enough for many. The lack of opportunity for any overtime in recent years is disappointing. It has started to feel like we are heading toward a profit over people model and that we are becoming much more corporate in our outlook and behaviors.","For all its problems, Briar Patch has the attention, respect, patronage, and recognition by ALL in this community stretching quite far.  The amount of famous and well-known and conscious individuals i see here on a regular basis is unrivaled.  For any in-house issues at BP, the clientele has no idea and all businesses constantly course correct and recover which is why of course I believe BP is a place you can be proud of to work.  definately some room for improvement though.  especially when it comes to management style in my department.","This has been the single greatest opportunity for me to learn more about business and the wild world that is Procurement. Eager to see what else it has in store. pun intended.","I have been employed here for Many years & feel like I am well appreciated & taken care of. I enjoy my job here at Briar Patch & am grateful to have a job that I enjoy coming to. I love our staff & our customers. We have such a unique & beautiful connection with our community & I am proud to be a part of that.","I wish this portion of the survey had an even higher maximum score, I would've selected that.","I truly enjoy working with the customer's here but don't feel like there's any real incentive as I've witnessed inappropriate behavior and allowed.","I ALWAYS TRY TO COME IN WITH SMILE AND PROVIDE GOOD CUSTOMER SERVICE","If I could find a career here that I can support my family on, I would be honored to work here long-term.","The lack of an inclusive work environment has directly led to my overall job DISsatisfaction. The lack of fairness, lack of training, and lack of any kind of support has led me to be completely miserable at a job I was once truly happy at. I would NEVER IN MY LIFE recommend BriarPatch as somewhere to work. Not even an enemy deserves this terrible of a work environment full of mistrust, hostility, and no chance for growth. I'm embarrassed to work for this company.","Best job I have ever had. Best company I have ever worked for.","I've worked at BriarPatch longer than I've been in any other job, and the most important reason for that by far is the positive work environment created by the people and the mission. I have done work that is more interesting than what I do here, but I do feel at home at BriarPatch.","My job satisfaction at BriarPatch has been waning.","I LOVE MY JOB! It's beautiful to wake up in the morning excited to come to work and there are still plenty of days where I am sad to go home. My only complaint is the monetary compensation is lacking. I enjoy and am grateful for the Chill Zone, my employee discount, the raffles, and OBM bonuses, but I am still living paycheck to paycheck working full time. We can do better!","I love my job. :)","I never want another job. I am challenged, fulfilled and supported in doing awesome work with awesome people.","I have always liked the Patch and have shopped here for over 35 years.\nWorking here ha given a great amount of respect for the organization  and how it has evolved. I am proud to work here.","I'm happy working at BriarPatch.","The one area I would like to see improvement on is that Salaried personnel don't get different work schedule options for the rest of the staff. It is unfair that salaried personnel can choose to work 4 days a week but hourly can't. For office staff, I would like to see more work from opportunities and more flexibility in the hours I work. I am someone who works better at night, so working during early morning is slow and rough.","Working at BriarPatch is the best job I have ever had.","I love how working at BriarPatch really does feel like we're all on the same team working towards the same goal. It's the best job I've had so far!","I LOVE working at briarpatch. Although my pay is lower than a general person doing my job, I plan to stick here due to the benefits package, the laidback nature of the job, the happy atmosphere, the management backing me up at every step, the strong commitment to employee satisfaction and being inclusive for people with disabilities. I also love that we set up a specific DEI policy after some in our country began to attack DEI","I appreciate working for BriarPatch.... AND...\n1 I believe many of the positions have repetitive tasks. Everyone may benefit from a little bit of variety and cross training. For example, office people may benefit from having some active tasks incorporated into their day (like stocking a shelf or collecting baskets or helping bag groceries or working the deli counter, etc.). \n2 The different departments in Briarpatch may also have a greater knowledge (and appreciation) of how all the \"pieces\" go together if there were some cross training and tasks (like stockers learning about buying, or cashiers learning about stocking, or finance learning about receiving, etc). \n3 I would love to work a 4/10 schedule if possible.\n4 Thanks for the survey!"]}],"results":{"Overall":{"response":"The survey comments reveal a complex and somewhat polarized sentiment among BriarPatch employees. A significant portion of the workforce expresses deep satisfaction and pride in the co-op's values, particularly its inclusive, accepting, and community-minded environment. Many feel genuinely valued, supported, and appreciate the ability to be themselves at work. However, there's a strong undercurrent of dissatisfaction, particularly concerning management practices, communication, and compensation. Issues such as perceived favoritism, lack of consistent and fair application of rules, insufficient training, and a disconnect between stated values and practical implementation are frequently raised. Employees often feel underpaid relative to the cost of living and the demands of their roles, despite some appreciation for benefits. There's a clear call for more transparent communication, more equitable management, and better support for employee growth and well-being. The sentiment is mixed, leaning positive in terms of core values and interpersonal team dynamics, but notably negative regarding systemic operational, managerial, and compensation issues.","sentiment":"Mixed but leaning negative with positive core values"},"12. Comments on BriarPatch values?":{"Sentiment":[-0.2,-0.4,0.3,0.8,0.9,-0.7,0,0.1,0.7,0.9,1,1,1,0,1,0.2,-0.9,-0.9,-0.7,-1,-0.8,0.1,-0.9,1,0.9,-0.3,-0.8,0.7,0.9,-1,0.6,0.8,0.5,-1,0.1,-1,1,1,1,-0.6,0.9,-0.7,0.7,0.5,1,-0.1,0.6,1,0.8,0.1,-0.6],"Highlights":["Employees largely appreciate BriarPatch's inclusive and accepting values, often citing a strong personal alignment with the co-op's mission.","Significant concerns exist regarding the practical application of values, with reports of disconnect, perceived discrimination, harassment, and lack of support for employees with disabilities or mental health issues.","There's a call for improved training and more diverse representation in management, alongside a desire for the co-op to more outwardly and consistently defend its values, especially in the face of opposing views from customers."]},"19. Comments on Storewide Management Practices?":{"Sentiment":[-0.6,-0.9,0.6,0.7,-0.5,-0.9,-0.8,-0.2,0.5,0.9,-0.7,0.8,-0.7,-0.6,0,-0.7,-0.5,-0.8,-0.6,-0.9,-0.7,-0.9,-0.9,-0.8,0.7,-1,0.9,-0.5,-0.9,0.9,0.5,0.8,0,0.7,-0.7,-0.8],"Highlights":["A prevalent issue is favoritism and inconsistent application of rules, leading to unequal treatment of employees, including disproportionate disciplinary actions and some employees 'getting away with' bad behavior.","Many employees express a lack of trust and safety in bringing concerns to management or HR, fearing retaliation, gossip, or that their issues will be ignored or used against them.","There's a perceived disconnect between management and frontline employees, with some managers acting superior, doing less work, or lacking empathy and transparent communication, hindering a collaborative 'store-wide' attitude."]},"28. Comments on Workplace Communications?":{"Sentiment":[-0.5,-0.5,-0.3,-0.2,-0.1,0.7,-0.4,-0.3,-0.4,0.6,0.5,0,0.7,-0.3,0.9,0.8,-0.5,-0.3,-0.1,-0.4,-0.6,-0.7,-0.7,-0.8,0.7,0.5,-0.6,-0.4,-0.7,-0.7,-0.8,-0.9,0,-0.8,-0.2,-0.1,-0.6,-0.4,0.9,0.1,-0.6,0,0.8,0,-0.5,0.7,0.5,0.5,0.7,-0.4,-0.5],"Highlights":["Inconsistent and insufficient inter-departmental communication is a significant challenge, especially regarding sales, events, and changes, often leaving staff unprepared or misinformed.","While some praise transparency and access to 'behind-the-scenes' information (OBM), many employees, especially those on specific shifts or in certain departments (like the Deli), feel excluded from important meetings and lack actionable insights or a clear understanding of financial numbers.","There are frequent reports of managers and supervisors failing to communicate effectively, disregarding employee suggestions, providing inconsistent feedback, or making unilateral decisions without consulting affected staff, leading to frustration and a sense that input doesn't make a difference."]},"33. Comments on Compensation?":{"Sentiment":[-0.8,-0.4,-0.7,0.6,0.2,-0.5,-0.9,0.5,0.5,0.2,0.9,-0.6,0.9,-0.8,-0.3,0.6,-0.3,0.5,-0.7,-0.8,-0.6,0.2,0.1,-0.4,-0.7,0.6,-0.8,0.7,-0.6,0.5,-0.7,0.7,-0.9,-0.7,-0.8,-0.7,-0.6,0.9,-0.9,-0.8,-0.8,-0.7,-0.9,0.9,-0.9,-0.9,-0.9,0.9,1,-0.9,-0.9,-0.9,0.9],"Highlights":["Despite appreciation for benefits like health insurance, staff discounts, and PTO, a significant portion of employees feel undercompensated, with wages struggling to keep pace with the rising cost of living, often compared unfavorably to fast-food industry wages.","Concerns are raised about the fairness and transparency of wage increases, with some feeling that raises don't reflect job performance or that new hires are paid more than long-term employees in similar roles, impacting morale and retention.","Suggestions include paying out unused sick time, offering more flexible PTO options, clearer discussions on growth potential and pay increases, and considering 4/10 schedules to better support employee financial and personal well-being."]},"41. Comments on Store Operations?":{"Sentiment":[0.3,-0.4,-0.7,0.8,-0.7,-0.6,0,0.9,0.7,0.9,-0.3,-0.2,-0.4,-0.8,-0.7,-0.7,-0.5,-0.6,-0.4,-0.2,-0.9,-0.2,-0.5,-0.4,-0.7,-0.7,-0.9,-0.7,0.8,-0.6,-0.6,-0.7,-0.8,-0.9,0,-0.6,-0.9,-0.7,0.7,0.6,-0.6,-0.8,-0.9,-0.9,-0.8,-0.9,-0.9,-0.9,0.9,0.1,-0.9,-0.9,0,-0.2,0.1,0.7,-0.4,-0.5],"Highlights":["Employee safety, particularly regarding parking and nighttime access, is a significant and recurring concern due to poor lighting, homelessness, and observed drug activity, with suggestions for more proactive solutions beyond just 'buddy systems'.","Coordination and communication between departments, and between store operations and support offices, are frequently cited as lacking, leading to inefficiencies, miscommunication, and a feeling of operating as separate entities rather than a unified co-op.","There are calls for better resource allocation, including more consistent staffing levels to prevent burnout, and investments in updated equipment and technology to improve efficiency and overall working conditions."]},"51. Comments about Department Operations?":{"Sentiment":[0.9,-0.5,0.4,-0.6,-0.8,-0.8,-0.7,-0.7,-0.6,0,0.9,0.8,-0.8,0.7,-0.9,-0.9,-1,-0.6,-0.5,-0.6,-0.7,-0.5,-0.4,-0.6,-0.7,-0.8,-0.8,-1,-0.8,-0.7,-0.4,-0.5,-0.6,-0.7,-0.8,-0.7,-0.9,0.9,0,0.7,-0.3],"Highlights":["Many departments, particularly the Deli and Bakery, are described as disorganized, understaffed, and suffering from a lack of clear leadership and planning, leading to high stress, last-minute scrambles, and inconsistent work quality.","A significant concern is the presence of favoritism and unequal treatment among employees, with some managers not addressing conflicts, allowing certain individuals to avoid work or break rules, and using punitive actions unfairly.","There's a critical need for improved communication, especially between AM/PM shifts and within sub-departments, along with better-defined goals, consistent training, and more effective conflict resolution strategies to foster a cohesive and productive environment."]},"60. Comments on Human Resources practices?":{"Sentiment":[0.8,0.7,-0.7,0.7,-0.5,0.9,-0.4,1,-0.6,-0.7,-0.3,-0.9,-0.3,0.8,0.9,-0.7,0.1,0,-0.7,-1,0.7,-0.6,0.8,0.9,0.8],"Highlights":["While many employees praise specific HR personnel (Emma and Danielle) for their empathy, support, and availability, there's a strong sentiment that HR practices are inconsistent or problematic, leading to a fear of retaliation when reporting issues.","Concerns include HR sharing confidential information with involved parties, ignoring serious complaints, and instances of perceived discrimination, suggesting a lack of trust in the department's impartiality and effectiveness.","There is a need for clearer policies on requesting leave and a desire for more education and training on human rights, diversity, and inclusivity, especially concerning marginalized groups, to ensure a comfortable and supportive environment for all staff."]},"71. Comments on Training and Development?":{"Sentiment":[-0.4,-0.7,-0.8,0.4,-0.5,-0.5,0.9,0.7,-0.6,-0.6,-0.7,-0.8,-0.9,-0.7,-0.6,-0.8,-0.6,-0.2,-0.6,-0.8,-0.9,-0.7,-0.6,-0.9,0.7,0.4,-0.6,-0.8,-0.7,-0.6,-0.7,-0.4,0.7],"Highlights":["A pervasive issue is the lack of structured, consistent, and comprehensive training for new hires, leading to them being 'thrown to the wolves' and learning on their own, which results in mistakes and increased workload for others.","Employees express a desire for more opportunities for advancement and professional development, with frustration that promotions are perceived as tied to favoritism, and that existing skills or decades of experience are not recognized or utilized.","Feedback on performance is often seen as unclear, inconsistent, or insufficient, with some employees reporting that positive 'check-in' evaluations contradict later disciplinary actions, leaving them blindsided and unsure of how to improve or progress."]},"80. Comments on Supervision?":{"Sentiment":[-0.5,0.5,-0.4,0.9,-0.5,-0.4,-0.8,0,-0.8,-0.9,-0.9,-0.7,-0.8,-0.3,-0.2,0,0.6,-0.8,-0.7,-0.8,-0.6,0.9,0.9,0,-1,-0.7,0.8,0.9,0.7,0.8,0.8,0,0.8,0],"Highlights":["While some departments report excellent and supportive supervision, a significant number of employees experience inconsistent communication and conflicting directions from different managers, creating confusion and stress.","There are serious concerns about managers failing to address performance problems or interpersonal conflicts effectively, leading to ongoing issues, perceived favoritism, and a reluctance from employees to bring forward concerns for fear of negative repercussions.","Several comments highlight specific issues within departments, such as managers starting tasks, not providing necessary tools or training to supervisors, or engaging in unprofessional behavior like indirect criticism during group meetings, undermining trust and effectiveness."]},"87. Comments on Job Satisfaction?":{"Sentiment":[1,0.8,0.1,0.7,0.9,-0.5,0.8,-0.6,0.9,0.9,0.9,-0.4,0.2,-0.8,-0.7,-0.8,-0.4,0.2,0.9,0.8,0.6,0.6,0.9,-0.6,0.5,0.9,0.8,-0.9,1,0.8,0.1,-0.5,0.9,0.9,0.9,0.8,0.9,0.9,0.8,0.5,-0.3,0.8],"Highlights":["Many employees express high job satisfaction, citing a strong connection to the co-op's values, a positive work environment fostered by good relationships with coworkers, and appreciation for the sense of community.","Despite general satisfaction, recurring issues like inadequate compensation, perceived favoritism, and lack of growth opportunities significantly dampen overall job satisfaction for many, leading some to consider leaving.","There's a strong desire for BriarPatch to invest more in its employees through improved pay, clearer career paths, better training, and fair treatment, to retain talent and prevent the perception of the co-op becoming more 'corporate' than community-focused."]}}}