{
	"content": {
		"parts": [
			{
				"text": "{\n  \"Overall\": {\n    \"response\": \"The survey results paint a picture of a nuanced and often contradictory employee experience at the Co-op. While a significant portion of employees express high job satisfaction, praising positive coworker relationships, a welcoming environment, and specific managers for their leadership, these positives are often overshadowed by pervasive systemic issues. Key areas of concern include a perceived lack of fairness and transparency in compensation and promotion, inconsistent management practices, and critical breakdowns in communication and training. There is a strong sentiment that the Co-op's stated values, particularly regarding diversity, equity, and inclusion (DEI) and being 'All are Welcome,' are not consistently reflected in practice, especially concerning political neutrality and the application of policies. Operational and infrastructure deficiencies in specific departments, coupled with fears of retaliation and ignored feedback, contribute to a sense of frustration and distrust among many. While tools like Beekeeper and specific managers receive high praise, their positive impact is often limited by broader organizational inconsistencies and underutilization.\",\n    \"sentiment\": \"Slightly Positive (0.09)\"\n  },\n  \"11. Comments on the Co-op's values?\": [\n    {\n      \"comment\": \"Environmentally friendly, socially responsible, and healthful choices are limited for people below a certain income.\",\n      \"sentiment\": -0.6\n    },\n    {\n      \"comment\": \"I think it’s important for Moscow, ID to have organizations like the co-op that are committed to diversity and equity. Especially as the\\npolitical climate continues to be (increasingly) hostile.\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"I think the co-op truly does pride itself on support of historically marginalized communities but I also think the co-op could be better at\\nreacting to community displeasure like we often experienced as a result of the Black Lives Matter signs. Without question, the sentiment is\\nrelevant but the organization itself was responsible for things that understandably upset members of our community. I think at times we can\\nbe to focused on DEI at the exclusion of a potentially larger market. I think there is a fairer balance to walk to live up to our motto of\\n\\\"All are Welcome.\\\" In addition, I think a strenuous look at why we carry products from Israel is needed. To advocate for minorities but also\\ncarry products from Israel seems a strange path to walk.\",\n      \"sentiment\": -0.3\n    },\n    {\n      \"comment\": \"I think they are good values worth upholding.\",\n      \"sentiment\": 0.8\n    },\n    {\n      \"comment\": \"The success of the practice of these values in my strong opinion is attributed to the constant emphasis and clear expectations that upper\\nmanagement has places on these\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"I feel the Co-op could follow through on their commitment to honoring different abilities and valuing diversity by providing clearer access\\nto accommodations and more dialogue to communicate needs. I feel unsure of the safety of disclosing my different abilities and the\\naccommodations that would be helpful to have.\",\n      \"sentiment\": -0.5\n    },\n    {\n      \"comment\": \"none at the moment, thankyou.\",\n      \"sentiment\": 0.0\n    },\n    {\n      \"comment\": \"We are a very inclusive and community driven space with standards befitting professional expectations.\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"the co - op is/has been one sided on the \\\" LEFT & RIGHT \\\" questions, on one hand everything is accepted, on the other hand (the right\\nside of beliefs and politics) \\\" there will be no political discussions at work \\\" why can one side be talked about all day long but one\\nmoment of anything to do with religion or right leaning ( I am neither religious or right leaning, I am center left for context ) it is shut\\ndown as political discussion. would like to see the co - op divest from any political orientation and just sell groceries.\",\n      \"sentiment\": -0.8\n    },\n    {\n      \"comment\": \"I find it heart warming that The CoOp values as so strong. A preivous job a person came in scared to ask if she could come in because she\\nis gay. I dont feel that here at all.\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"I would like to see even more discussion of how the co-op is contributing to local events that are not just school. I would like marketing\\nto reach out to organizations in the area that are for diverse groups on campus at U of I or Inland Oasis and offer food/drink as much as\\nthey do for other local orgs. Discussions of why we support the organizations and how and how often is important to me.\",\n      \"sentiment\": 0.3\n    },\n    {\n      \"comment\": \"To be a healthy and thriving environment, I do not believe a points based attendance system is helpful to the mental health of employees.\\nLife happens and we shouldn't be punished further if we are already down on our luck-- however that may be-- sickness, school, pets, etc. A\\npoints system is a lazy way of weeding out employees, we all deserve to not feel like our job is on the line due to being sick and thus\\nhaving people come in sick/over tired/ stressed/etc and not be able to perform their job duties to the best of their abilities. I understand\\nsome people may try to take advantage of a no points system, but we need something more reasonable that doesn't feel like we are being\\nmicromanaged like high schoolers.\",\n      \"sentiment\": -0.9\n    },\n    {\n      \"comment\": \"values are my co-workers skills and work ethic. Kitchen creates a positive and fun work environment, which in return creates a great team\\nand positive outcomes. I believe all departments have this same values\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"We were recently told during a re-orientation that we were not to speak about our beliefs/lifestyle at work and if asked by a customer to\\nengage in a conversation, we were to say that, we at the co-op, do not speak of these things. I understand that keeping the peace is\\nimportant, but if we don't acknowledge each others differences, how will we learn to love people that aren't like us. burying our heads in\\nthe sand is not the answer\",\n      \"sentiment\": -0.6\n    },\n    {\n      \"comment\": \"The Co-op would preach about it's \\\"diverse values\\\" while in the past the store manager has made posts about problems with \\\"straight white\\nprivilege\\\". This is not only contradictory but has no real value to anything that could be considered work related what so ever. Though I\\nbelieve the Co-op values are good overall, I also see certain political leaning values that have no place in a grocery store.\",\n      \"sentiment\": -0.7\n    },\n    {\n      \"comment\": \"i appreciate the commitment to community. i feel involved.\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"Lots of great people, great leadership.\",\n      \"sentiment\": 0.8\n    }\n  ],\n  \"11. Comments on the Co-op's values?_Highlights\": [\n    \"Several comments highlight a perceived hypocrisy or one-sidedness in the Co-op's commitment to diversity, equity, and inclusion (DEI), especially concerning political discussions at work and specific product choices.\",\n    \"The points-based attendance system is strongly criticized for negatively impacting employee mental health, suggesting a conflict between stated values and practical application.\",\n    \"Despite criticisms, many employees appreciate the Co-op's core values of inclusivity, community focus, and the positive work environment fostered by coworkers and leadership.\"\n  ],\n  \"19. Comments on Storewide Management Practices?\": [\n    {\n      \"comment\": \"Sometimes it feels like some policies are cherry picked on what is followed and what is not. Or the employees are cherry picked on who gets\\nreprimanded for the same thing. Also, there have been some concerns I have heard co-workers talk about amongst each other but not one person\\nhas brought it to management, I believe because of the fear of retaliation or fear of nothing being done.\",\n      \"sentiment\": -0.9\n    },\n    {\n      \"comment\": \"There is a lack of efficient communication between departments, and even between managers within the same departments. Additionally, most\\ndecision-making relies on the bottom line. This is not necessarily a bad thing, but it feels as if maximizing profit can sometimes outweigh\\nbalanced expectations for employees. Decisions have been made in the past that do not necessarily take into account employee input.\\n(Decisions that make our jobs unreasonably tedious or more time-consuming than they should be.)\",\n      \"sentiment\": -0.7\n    },\n    {\n      \"comment\": \"They are doing the best they can no worries here\",\n      \"sentiment\": 0.6\n    },\n    {\n      \"comment\": \"In my long tenure here, I feel the management team is more balance and respectful than I've ever seen it. I'm very proud of the work they\\nhave been doing.\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"They pretty good\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"The management team is exactly what the term means: a team with common and clear goals which I feel we work greatly together to\\nachieve\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"Overall, I feel Heather and Melinda have done an impressive job managing the Co-op\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"I believe that the everyday modus operandi which establishes usual expectations can sometimes be bent to fit the immediate desires of\\nmanagement at times.\",\n      \"sentiment\": -0.5\n    },\n    {\n      \"comment\": \"Top management is devoting too much time to their work, too few days off, too few days where they are truly disconnected. Their work/life\\nbalance is tilted too much toward work, and I feel like there is downward pressure for others to show that same level of all-in\\ndevotion.\",\n      \"sentiment\": -0.7\n    },\n    {\n      \"comment\": \"I have very little to no interaction with storewide management practices.\",\n      \"sentiment\": 0.0\n    },\n    {\n      \"comment\": \"Management at the Moscow Food Co-op is the most understanding and empathetic I have ever experienced anywhere.\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"I have been mostly without conflict throughout my job here at the co-op. When conflict has come up it has been resolved to my satisfaction\\nand fairly.\",\n      \"sentiment\": 0.8\n    },\n    {\n      \"comment\": \"There is a manager who has consistently talked down to employees and treats people like poop if they call out or even asking for time off\\nbecause of a death in the family. I do not understand why the Co-op keeps this person as a member of management over losing at least 10\\nmembers of staff (some who needed to go, but some really hard working employees) over the last few years due to his terrible people skills,\\nlack of good leader skills, and a consistent need to flex his authority position over others.\",\n      \"sentiment\": -1.0\n    },\n    {\n      \"comment\": \"A great system that in return creates good communication between managers and higher ups, I can always come to anyone with concerns that\\nhappen outside of work.\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"I think management, as it is, is quick to pass the buck. Management tends to delegate instead of stepping in. There are responsibilities\\nthat are neglected if there aren't enough people present. It seems that emails and meetings, trump, no pun intended, the needs of the store,\\nprimarily on freight days and when the front end is short on cashiers. I have also seen M.O.D.s not have the knowledge or resources to deal\\nwith a problem, not always, but it would be embarrassing to be caught in a situation like that\",\n      \"sentiment\": -0.8\n    },\n    {\n      \"comment\": \"The storewide management has a history of being unfair to the employees. I've seen many instances of other managers being lenient on\\ncertain things that my own manager would fire someone for. These include time management and work ethics. The co-op managers and higher\\nstaff would preach \\\"equality\\\", while having no outward point system of their own to follow. They then would expect most workers to just sit\\nthere and accept the clear and consistent lack of equality they receive while getting minimum wage. I speak for many workers in the store\\nwhen I say that the management always finds a way to fire people when they decide to openly question the management. All of this and we\\nstill question why our turn-over rate is so high. Considering these are all problems that have been brought to management in the past, I\\nhave little hope that a survey will actually change anything.\",\n      \"sentiment\": -1.0\n    },\n    {\n      \"comment\": \"i’ve had nothing but stellar communication and sincere consideration for my work needs\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"I think that management genuinely cares about employees and their needs, however there may be a bit of a disconnect at times. There seems\\nto be a lack of communication between employees and upper management in the sense that employees are not always asked about their needs. I\\nhave also seen employees bring up issues to upper management (especially regarding conflicts with their supervisors) and be ignored.\",\n      \"sentiment\": -0.6\n    },\n    {\n      \"comment\": \"Great people to process your questions and concerns.\",\n      \"sentiment\": 0.7\n    }\n  ],\n  \"19. Comments on Storewide Management Practices?_Highlights\": [\n    \"A significant number of comments criticize management for 'cherry-picking' policies, showing leniency to some while being strict with others, and displaying a general lack of equality in treatment, contributing to a high turnover rate.\",\n    \"Employees express fear of retaliation for speaking up about issues, and a perception that management often ignores employee input or concerns, especially when conflicts arise with supervisors.\",\n    \"Despite strong criticisms, several employees praise the management team for being balanced, respectful, understanding, empathetic, and providing stellar communication, with specific mentions of Heather, Melinda, and other managers.\"\n  ],\n  \"26. Comments on Workplace Communications?\": [\n    {\n      \"comment\": \"There have been multiple times when something has changed and I have not been informed of the change, and so when a customer asks me about\\nit I have no idea what they're talking about. This has mostly been internally in the department. There have also been times where my\\nsupervisor said they would make a beekeeper post informing everyone about what's going on and about any changes, and there not being a post\\nat all.\",\n      \"sentiment\": -0.6\n    },\n    {\n      \"comment\": \"There are sometimes some communication breakdowns between departments IE: when management makes decisions and rolls things out without\\nproper training etc\",\n      \"sentiment\": -0.5\n    },\n    {\n      \"comment\": \"Employee ideas are asked for and heard in our department but not necessarily acted upon or used. When asked for our thoughts, we get a\\nchance to voice our opinions but they are usually deflected by our manager who seems to already have their own ideas and thoughts on the\\nmatter. I would like to see more of our ideas put to use or acted upon rather than just being heard.\",\n      \"sentiment\": -0.7\n    },\n    {\n      \"comment\": \"There are few opportunities for employee input when it comes to changes that affect how we perform our work. Oftentimes, we find out after\\nthe decision is made. I do think that BeeKeeper is a useful stream of communication that should be utilized more.\",\n      \"sentiment\": -0.6\n    },\n    {\n      \"comment\": \"Overall positive, with room for improvement.\",\n      \"sentiment\": 0.2\n    },\n    {\n      \"comment\": \"Lots of changes in the kitchen not easy to keep everything updated but everyone does their best at letting people know\",\n      \"sentiment\": 0.0\n    },\n    {\n      \"comment\": \"Communication feels better than ever as well.\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"communication has been improved over the years\",\n      \"sentiment\": 0.6\n    },\n    {\n      \"comment\": \"Beekeeper is an amazing tool in appropriate and prompt communication. I am personally grateful to have it to assist my job duties\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"It is common to have some lack of communication when it comes to equipment failure.\",\n      \"sentiment\": -0.4\n    },\n    {\n      \"comment\": \"Management does a good job of using Beekeeper to communicate with employees\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"I wish there were more tactile methods of communication. Such as a physical department noticeboard.\",\n      \"sentiment\": 0.1\n    },\n    {\n      \"comment\": \"I appreciate BeeKeeper it is a great tool to communicate. It's important to remind staff to mark that they read a post with a \\\"like\\\".\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"Lines of communication are always open\",\n      \"sentiment\": 0.8\n    },\n    {\n      \"comment\": \"The open communication here is wonderful\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"I generally only receive information from two people regardless of format: my manager and the store manager.\",\n      \"sentiment\": 0.0\n    },\n    {\n      \"comment\": \"There has been an increase in communication from admin. The communication from management as a team is unpredictable and could be simply\\nimproved with more Beekeeper usage.\",\n      \"sentiment\": -0.2\n    },\n    {\n      \"comment\": \"Not enough of my coworkers use it and there isn't much push back on people who do not. The managers encourage us to use it but that's\\nbasically as far as it goes. I don't know what managers can do to implore people to use it because punishment isn't what I want, but it does\\nget tiring having to tell people things that they could easily find out themselves. It is mostly tiring because communicating about things\\nthat were posted on Beekeeper is rarely if ever given positive feedback. Or it feels like the person I'm telling doesn't care all that much\\nand it feels like it wasted my time and hurt my morale when my coworkers don't care as much.\",\n      \"sentiment\": -0.7\n    },\n    {\n      \"comment\": \"Beekeeper and paycom are easy to access and always accurate. I love keeping up with news on co-op related matters and store changes that\\nare easy to read and good communication.\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"Workplace communications have been very good overall. BeeKeeper is a nice place to see updates from all different departments. This helps\\ncustomer interactions too.\",\n      \"sentiment\": 0.8\n    },\n    {\n      \"comment\": \"it’s nice and efficient here. things are very clear but open to be modified. and in a timely manner, not common in other workplaces\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"Sometimes recipes are not accurate in terms of making because we recently re-evaluated the cost of items to make sure they meet the proper\\npricing. This has occasionally caused confusion as some recipes reflect the cost measurements instead of the make measurements. management\\nis not always around to correct them but it’s not a huge issue\",\n      \"sentiment\": -0.1\n    },\n    {\n      \"comment\": \"communication could be more between departments and and management. It could be more frequent and clearer.\",\n      \"sentiment\": -0.4\n    },\n    {\n      \"comment\": \"Wish they would let you know when they are changing your schedule so you don’t come in at the wrong time.\",\n      \"sentiment\": -0.6\n    }\n  ],\n  \"26. Comments on Workplace Communications?_Highlights\": [\n    \"Beekeeper is consistently praised as an 'amazing' and 'great tool' for communication, yet many comments highlight that it is not utilized enough by staff or management, leading to breakdowns and missed information.\",\n    \"There's a recurring issue of employees not being informed of changes, receiving information after decisions are made, and feeling that their ideas and input are heard but not acted upon or considered.\",\n    \"Several comments point to a lack of clear and frequent communication between departments and with management, particularly regarding policy changes, equipment issues, and schedule alterations.\"\n  ],\n  \"32. Comments on Compensation?\": [\n    {\n      \"comment\": \"I think that the upper cap for management pay is an important and needed safeguard. I think that the benefits offered here make the pay\\nmore reasonable.\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"I don’t know the pay for other positions or departments. I’m unfamiliar with the system for pay raises.\",\n      \"sentiment\": 0.0\n    },\n    {\n      \"comment\": \"I hope we get to a place where raises are predictable and based on merit or hours worked. The whiplash of the last few years has been\\nrewarding in the sense of us raising our bottom tier and lifting all boats but it has been challenging to not know until a new year or later\\nwhat the plan is.\",\n      \"sentiment\": 0.1\n    },\n    {\n      \"comment\": \"it pretty good\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"I feel that I am considered valuable due to compensation and am grateful for the benefits including profit sharing\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"part time, don't use medical/dental/vision benefits\",\n      \"sentiment\": 0.0\n    },\n    {\n      \"comment\": \"Fairly satisfied, thank-you.\",\n      \"sentiment\": 0.6\n    },\n    {\n      \"comment\": \"Seeing more substantial pay would likely be well-received in relation to current financial trends outside the co-op. Simply put, things are\\ngetting expensive.\",\n      \"sentiment\": -0.5\n    },\n    {\n      \"comment\": \"I don't think anyone has any idea how the pay raises work, we have a \\\" performance evaluation rais matrix \\\" but I don't know the last time\\nthis was used, the last raise i got was not based on any form of math that i could figure out and was almost humiliating to get offered, of\\nwhich I said that I would like a higher rais more akin to the performance sheet that we have (of which the performance sheet would have me\\nat a higher rais than I ultimately received) just would like more regular raises and more clarity, they don't have to be large raises, just\\na clear path\",\n      \"sentiment\": -0.9\n    },\n    {\n      \"comment\": \"The one time I tried to use Ally Health, I didn't hear from one of their providers for over half a day. At that point I cancelled and went\\nto local Quick Care instead. A few hours later a provider from Ally Health finally called, even though I had cancelled.\",\n      \"sentiment\": -0.6\n    },\n    {\n      \"comment\": \"Very good benefit package for full-time employees\",\n      \"sentiment\": 0.8\n    },\n    {\n      \"comment\": \"A huge reason I value this job is that the compensation and benefits are useful to me. I appreciate that all of these benefits are\\navailable to both part time and full time employees. I have utilized the EAP and Ally Health throughout my time here.\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"Wish we did cost of living raises instead of whatever we do. I feel like as someone who has been here 3+ years, I should be making more\\nthan 75 cents/hour more than someone who just started at the coop. I also feel that if you are a PIC, you should be getting that extra\\ndollar an hour whether you are the pic or not. You still are asked to do some pic things even when you are not the pic and you have the\\nknowledge and skills every shift, not just the pic scheduled ones. I'd feel more valued as a long time employee if i was making $16.75/hour\\nevery shift because of my pic training and experience and length of time i have been here\",\n      \"sentiment\": -0.9\n    },\n    {\n      \"comment\": \"Works really well. Ally health is a very useful way for anything health related. Plus it's easy to access.\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"I believe the pay scale pays upper management and marketing too much for the lack of actual strenuous work they do. The kitchen and front\\nend all deserve at least a dollar raise. This is due to the kitchen being a hot and stressful environment to work in and the front end\\nhaving to clean bathrooms. The turnover rate is so high because young people in this town know they can do better elsewhere.\",\n      \"sentiment\": -1.0\n    },\n    {\n      \"comment\": \"I wish there were more opportunities to make more. Most people, even if promoted to PIC, don't get to work as PIC often because lead or\\nmanagement is there. New hires also being placed into leadership roles can be frustrating when you haven't earned a pay raise and have to\\nteach the new hires. I think having pay raises besides PIC or lead just based off performance and knowledge of the departmen, attendance,\\npolicy adherence, and customer service skills would be valuable and a big motivator for people. It is a big complaint amongst most\\nemployees.\",\n      \"sentiment\": -0.9\n    },\n    {\n      \"comment\": \"I feel I do more work than others in the same position.\",\n      \"sentiment\": -0.4\n    },\n    {\n      \"comment\": \"If im being honest here I would preform my job effectively and at a faster pace while my fellow colleagues taking their time at the same\\njob.\",\n      \"sentiment\": -0.5\n    }\n  ],\n  \"32. Comments on Compensation?_Highlights\": [\n    \"A dominant theme is the confusion and dissatisfaction surrounding the pay raise system, with employees feeling raises are unpredictable, not based on merit, and in some cases, 'humiliating,' leading to a perceived lack of value for long-term employees.\",\n    \"There's a strong sentiment that upper management is overcompensated compared to the 'strenuous work' of front-line staff (kitchen, front end), who are underpaid for challenging conditions, contributing to a high turnover rate.\",\n    \"While the overall benefits package (especially for full-time and part-time alike, including EAP and Ally Health) is highly valued, there's a specific negative experience cited with Ally Health's responsiveness.\"\n  ],\n  \"41. Comments on Store Operations?\": [\n    {\n      \"comment\": \"When someone is out sick or vacation we all help out to get things done\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"Nothing but improvement from what I've seen. I think other employees don't know who to talk about ordering new products or supplies they\\nneed for their job. A reminder to all staff could be helpful and a reminder to managers to follow up on those requests would be handy.\",\n      \"sentiment\": 0.3\n    },\n    {\n      \"comment\": \"Overall I believe that everyone is consciously engaged in making the overall success of the co-op a cooperative effort in accomplishing all\\ngoals\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"The kitchen desperately needs a reset. It's literally falling apart. Floor grates that are unlevel/unsafe, faucets falling apart, doors\\nfalling off cabinets, dishwasher falling off the wall. Broken equipment stashed all over collecting dust. When things break people just work\\naround it and it never gets fixed. The work on the floor didn't make them any safer or easier to clean at all.\",\n      \"sentiment\": -1.0\n    },\n    {\n      \"comment\": \"Each department seems to have run pretty cohesively with each other.\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"Adequate cleaning supplies would be useful to further reduce the possibility of cross contamination.\",\n      \"sentiment\": -0.4\n    },\n    {\n      \"comment\": \"The printed emergency decision tree who to call for which kind of problem is way out of date and hard to find. The current tree seems to\\nexist mostly verbally or in people's heads. It boils down to \\\"call the GM or Ops manager\\\" and hope one of them is available to tell you who\\nto call next.\",\n      \"sentiment\": -0.7\n    },\n    {\n      \"comment\": \"Team work makes the dream work\",\n      \"sentiment\": 0.8\n    },\n    {\n      \"comment\": \"I would love the womens restroom not to smell so bad. It seems to come from the toilet in the handicap stall. Maybe it's the drain vent or\\nthe type of toilet that holds all this smell.\",\n      \"sentiment\": -0.6\n    },\n    {\n      \"comment\": \"The working environment of the bakery does not always feel adequate. Our bathroom is outdated and not well-ventilated, and the first aid\\nkit is meager in comparison to the downtown store; we don't even have eye wash. I have been served food at least 3 times that had\\nhair/machine parts/glove pieces in it. Sometimes people handling ready to eat food do not have gloves or if they do they touch other things\\nand then touch food again which could risk contamination. The bakery does not do a lot of work with other departments but in the instances\\nwe have I feel as if those opportunities succeeded. Sometimes things are coordinated last minute or aren't planned out thoroughly.\",\n      \"sentiment\": -1.0\n    },\n    {\n      \"comment\": \"My only complaint is when i call for back up cashiers, i follow the protocol and when it comes to calling center store, i feel like they\\ndont think we actually need the help or that their job is more important and they dont need to help us. sometimes people avoid helping when\\nwe call. or act annoyed we are even asking them to do anything at all\",\n      \"sentiment\": -0.9\n    },\n    {\n      \"comment\": \"Working as a team and having a good understanding lead has made work production safe and efficient. Can always really on my co-workers on\\ncommunication and efficiency for production to work safe and overall having a good teamwork ethic.\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"Store Operations in regards to my department have been very good overall.\",\n      \"sentiment\": 0.8\n    },\n    {\n      \"comment\": \"Kitchen/Deli runs alot independently from the other departments it feels. Some safety concerns are mostly due to height needs which luckily\\nalot of my coworkers assist with. There is also equipment breaking often but unfortunately that’s just a part of what happens when you use\\nthe equipment so much and I do think the Co-op does its very best to address the issues promptly\",\n      \"sentiment\": 0.0\n    },\n    {\n      \"comment\": \"There are things that could run better and more effectively with some newer technology\",\n      \"sentiment\": 0.1\n    },\n    {\n      \"comment\": \"I have all the information and equipment to do my job efficiently.\",\n      \"sentiment\": 0.8\n    }\n  ],\n  \"41. Comments on Store Operations?_Highlights\": [\n    \"Significant and alarming issues are reported in the kitchen and bakery, with equipment 'literally falling apart,' unsafe conditions (unlevel floor grates), outdated facilities (bathroom), and serious food contamination concerns.\",\n    \"While some praise teamwork, a major pain point is the perceived lack of support from 'center store' when cashiers call for backup, with employees feeling ignored or that their needs are deemed less important.\",\n    \"Despite the operational challenges and specific department issues, many comments highlight a strong sense of teamwork, co-worker support (especially when others are out), and a collective effort towards the Co-op's success.\"\n  ],\n  \"50. Comments on Department Operations?\": [\n    {\n      \"comment\": \"I am able to communicate effectively with my co-workers, but maybe not as much with my supervisor.\",\n      \"sentiment\": 0.1\n    },\n    {\n      \"comment\": \"We don’t have department meetings. Would be nice if we did.\",\n      \"sentiment\": -0.3\n    },\n    {\n      \"comment\": \"my department runs ok. It would be beneficial for my department to have short/long term goals that we could work together as a team. It\\nfeels like we are all here doing different jobs with our own goals.. if we set them ourselves for the day. It feels a little chaotic\\nsometimes with everyone on a different page. We need department goals and work Together to achieve them. more consistency with checklists\\nand follow up.\",\n      \"sentiment\": -0.5\n    },\n    {\n      \"comment\": \"I think there can be a disconnect between the workers in the kitchen and the board/higher ups.\",\n      \"sentiment\": -0.4\n    },\n    {\n      \"comment\": \"Steady improvement is what I've seen.\",\n      \"sentiment\": 0.6\n    },\n    {\n      \"comment\": \"Moral is usually high in the department. I feel that the team as a whole cares not only for the overall success but also for the well being\\nof each member\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"Information about production is sometimes good, sometimes disorganized. I do not always have a task list and just have to get in where I\\nfit in. On the one hand it's nice to be trusted, on the other hand I like to know what I am supposed to be doing.\",\n      \"sentiment\": -0.2\n    },\n    {\n      \"comment\": \"I feel respected, generally, by everyone in my department, except by my supervisor.\",\n      \"sentiment\": -0.3\n    },\n    {\n      \"comment\": \"Seeing customer feedback might be nice for kitchen.\",\n      \"sentiment\": 0.1\n    },\n    {\n      \"comment\": \"We're good.\",\n      \"sentiment\": 0.6\n    },\n    {\n      \"comment\": \"I feel that because I am not as talkative as other employees they perhaps complain about me or assume things about me. I am ready and\\nwilling to communicate with others when it is absolutely necessary but sometimes I will not communicate with others if I can figure\\nsomething out on my own. Often times notes that I leave on Beekeeper are only read by 4 other people here on a good day, and 2 or 3 on\\naverage days. I feel respected when it comes to my work and how I want to work but not always respected as a person. I consistently feel\\nre-invigorated when I attend huddles or leadership meetings here. I tend to care less about how much my coworkers like me after huddles and\\nleadership meetings because then it is apparent that regardless of the social aspects of work, I can contribute to the co-op\\nmeaningly.\",\n      \"sentiment\": -0.1\n    },\n    {\n      \"comment\": \"I love my department and is one of the main reasons i have been here so long and the coop treats me well overall, i just have my few gripes\\noutside of my own department mostly cause after so long here, i have seen a few things\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"Production is always done on time. We have good communication when it comes to task and efficiency. We help each other when we can and the\\njobs always are completed safely and on time.\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"My department feels disorganized and without consistency. It should not fall on any one person to carry the load when things fall through\\nthe cracks. I think all of us should know who to call or what to do\",\n      \"sentiment\": -0.7\n    },\n    {\n      \"comment\": \"The department operations in regards to the work itself has been fine with me. I do see many problems with management in my department in\\nregards to comparisons to other department's management.\",\n      \"sentiment\": -0.3\n    },\n    {\n      \"comment\": \"my department is lovely. chris is a phenomenally organized manager and runs the kitchen beautifully. it’s incredibly satisfying and\\nefficient. dave is one of the kindest and enthusiastic bosses to work with. he is full of zest and is so proud and passionate about what he\\ndoes it’s infectious. judah is incredibly hard working and is very dedicated to the safety and comfort of his coworkers in every department\\nnot just his own heather is one of the sweetest people and i adore any little interaction i get to have. she makes this place feel safe and\\ni feel comfortable coming to her with my issues. i appreciate everyone’s work immensely.\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"There are some communications issues as several people do not check beekeeper for messaging. I think the easy solution is to update the\\nkitchen contact info list we have posted, as most of the employees on that list are no longer working here.\",\n      \"sentiment\": -0.5\n    },\n    {\n      \"comment\": \"things could be more coordinated and organized with SOPs. Meetings are sometimes drawn out to long. Expectations are not even and each\\nindividual has their own level expected from them.\",\n      \"sentiment\": -0.6\n    },\n    {\n      \"comment\": \"Sometimes it seems as though there are different expectations for different people. I work hard to finish projects efficiently and am\\nconscious of what tasks need to be completed before the end of my shift. In an effort to set the next shift up for success I put my all into\\nmy work, and I watch others in the department not work as hard or not finish tasks with seemingly no repercussions which can be frustrating\\nat times.\",\n      \"sentiment\": -0.7\n    },\n    {\n      \"comment\": \"No complaints.\",\n      \"sentiment\": 0.0\n    }\n  ],\n  \"50. Comments on Department Operations?_Highlights\": [\n    \"Many departments, particularly in the kitchen, struggle with disorganization, a lack of clear short/long-term goals, inconsistent task lists, and uneven expectations for individual performance, leading to frustration and a feeling of chaos.\",\n    \"While some employees feel respected and have high morale with their teams, a recurring issue is a disconnect or lack of respect from supervisors, alongside concerns about coworkers not pulling their weight or issues with internal communication (e.g., Beekeeper not being checked).\",\n    \"Several highly positive comments specifically name and praise managers (Chris, Dave, Judah, Heather) for their organization, kindness, enthusiasm, dedication, and creating a safe and comfortable environment.\"\n  ],\n  \"58. Comments on Human Resources Practices?\": [\n    {\n      \"comment\": \"I personally do not have a claim of harassment, but I know some of my coworkers do, and I don't think anyone has said anything because 1.\\nnot knowing how to report it or 2. because of fear of retaliation. *This specific claim I am thinking of is harassment based on sex.\",\n      \"sentiment\": -1.0\n    },\n    {\n      \"comment\": \"I think we do a good job with diversity in our hiring process. I value that we are inclusive for all.\",\n      \"sentiment\": 0.8\n    },\n    {\n      \"comment\": \"Again, steady improvement here.\",\n      \"sentiment\": 0.6\n    },\n    {\n      \"comment\": \"I am honored to work for an informative and caring HR manager who is concerned about not just the overall success but my personal\\ndepartment and my success\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"In my experience HR does not keep information private. I do not think HR likes regular kitchen staff.\",\n      \"sentiment\": -0.9\n    },\n    {\n      \"comment\": \"Time set aside for an open door policy could be beneficial.\",\n      \"sentiment\": 0.1\n    },\n    {\n      \"comment\": \"Seems good\",\n      \"sentiment\": 0.6\n    },\n    {\n      \"comment\": \"I appreciate that Heather in HR always encourages talking with out direct manager first.\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"Works really well! And always have a positive experience expressing concerns.\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"The co op being a clearly left leaning political business means upper management will sometimes make a beekeeper post in regards to\\n\\\"straight white privilege\\\". Though I've only seen this once, I haven't been here that long so there's a strong possibility it's happened in\\nthe past. Frankly political garbage of any kind no matter what it is, has no place in any work environment. This type of propaganda made by\\nactual upper management makes coming forward with any issues as a straight white person uneasy and awkward.\",\n      \"sentiment\": -0.9\n    },\n    {\n      \"comment\": \"Unfortunately the hiring practices of inclusivity despite disabilities can put a strain on the department when that individual can not\\nperform their duties required by the job effectively. When there are such individuals, it seems the rest of the team is expected to pick up\\nthe slack.\",\n      \"sentiment\": -0.7\n    }\n  ],\n  \"58. Comments on Human Resources Practices?_Highlights\": [\n    \"A critical highlight is the fear of reporting harassment (specifically sex-based) due to lack of knowledge on how to report and the fear of retaliation, indicating a significant trust issue with HR processes.\",\n    \"There are strong accusations that HR does not keep information private and may have biases against certain staff (e.g., 'regular kitchen staff'), further eroding trust.\",\n    \"Despite the serious criticisms, some employees express positive experiences with HR, describing the manager as 'informative and caring,' and appreciating the Co-op's efforts towards diversity and inclusivity in hiring.\"\n  ],\n  \"66. Comments on Training and Development?\": [\n    {\n      \"comment\": \"Training was really intimidating, it was went over really quickly with little follow up, the way I was told to do corrections could be\\nnicer. It has to be the way my DM wants it to be or he will question why you did it a different way. If you are not able to catch on\\nquickly, it is difficult to remember or retain the information he gives you. A lot of \\\"man-splaining\\\" things I had questions or confusions\\nabout. A lot of my questions were cleared up by other employees who explained better, and took the time.\",\n      \"sentiment\": -0.9\n    },\n    {\n      \"comment\": \"Training new employees puts strain on the department. It feels like juggling glass balls.\",\n      \"sentiment\": -0.6\n    },\n    {\n      \"comment\": \"Lots to learn and still learning every day\",\n      \"sentiment\": 0.0\n    },\n    {\n      \"comment\": \"Still a work in progress for many departments but improvements have been made.\",\n      \"sentiment\": 0.2\n    },\n    {\n      \"comment\": \"The practices in orientation and evaluations have greatly impacted the success of the team\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"Hard to know, I am part time and not really part of a development track. I don't know how this works for full time.\",\n      \"sentiment\": 0.0\n    },\n    {\n      \"comment\": \"A more clearly defined, predetermined training period, in which a new-hire is assisted in their training during their job would be\\nbeneficial.\",\n      \"sentiment\": -0.4\n    },\n    {\n      \"comment\": \"My last evaluation was done to criteria very different from what had been used in the prior evaluation, and my performance looked worse in\\ncomparison, even though I thought I had been working toward the goals set before.\",\n      \"sentiment\": -0.7\n    },\n    {\n      \"comment\": \"I know what I need to work on.\",\n      \"sentiment\": 0.0\n    },\n    {\n      \"comment\": \"Information is provided, and it seems we're left to mostly manage ourselves as managers because admin doesn't have the bandwidth to\\n\\\"inspect what is expected\\\" in the same way we are expected to do so with our own teams.\",\n      \"sentiment\": -0.6\n    },\n    {\n      \"comment\": \"A defined training program is needed for dept specific role. Resources are needed for reference and ongoing training.\",\n      \"sentiment\": -0.6\n    },\n    {\n      \"comment\": \"Always willing to learn new tasks and the hiring process was easy and understandable to acknowledge. Managers are always willing to help me\\nlearn more.\",\n      \"sentiment\": 0.8\n    },\n    {\n      \"comment\": \"The evaluations are worthless. They are set up for me to evaluate myself and be critiqued on my evaluation. It is not a useful tool. I am\\nasked to project future goals and not given tools or insight on how to achieve them. The only effect is that the employee gets left feeling\\nthat nothing, no level of commitment will be enough. We get the \\\"what have you done for me lately\\\" vibe\",\n      \"sentiment\": -1.0\n    },\n    {\n      \"comment\": \"i appreciate the flexibility granted in the kitchen. it’s understood that everyone does things their own way. an emphasis on the end result\\nquality rather than necessarily how you get there is appreciated.\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"On the job training could use more time and care training individuals. I have been told training seems rushed and hurried to check the\\nthings off the list and is very stressful, intimidating and anxiety inducing.\",\n      \"sentiment\": -0.9\n    }\n  ],\n  \"66. Comments on Training and Development?_Highlights\": [\n    \"Training is consistently described as 'intimidating,' 'rushed,' 'hurried,' lacking follow-up, and creating stress and anxiety. New hires and departments feel a strain due to inadequate training processes.\",\n    \"The evaluation system is deemed 'worthless' and unhelpful, with employees feeling critiqued unfairly, lacking tools/insight for goal achievement, and left with a sense that their commitment is never enough.\",\n    \"There's a clear call for more clearly defined, predetermined, and department-specific training programs, along with better resources for ongoing development and reference.\"\n  ],\n  \"77. Comments on Supervision?\": [\n    {\n      \"comment\": \"As for Question 71: Yes my supervisor encourages us to share ideas, suggestions and concerns, but a majority of the time they do not take\\nthese ideas into account, even if the rest of the department agrees.\",\n      \"sentiment\": -0.5\n    },\n    {\n      \"comment\": \"My supervisor is excellent at listening to comments and concerns. They are always open to new ideas of doing things.\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"My managers are great\",\n      \"sentiment\": 0.8\n    },\n    {\n      \"comment\": \"They are doing the best they can\",\n      \"sentiment\": 0.6\n    },\n    {\n      \"comment\": \"Deeply appreciate the hard work of my supervisor.\",\n      \"sentiment\": 0.8\n    },\n    {\n      \"comment\": \"My answers speak for themselves\",\n      \"sentiment\": 0.0\n    },\n    {\n      \"comment\": \"I have more than one supervisor, they are both good but different\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"My supervisor often acts very anxious, compulsively micromanages, and generally offers no positive encouragement or praise. He frequently\\nwill come across as condescending when giving feedback or directives. I do not almost in the least feel valued by him as a human being.\\nSometimes he is in a noticeably good mood which I take as a silver lining.\",\n      \"sentiment\": -1.0\n    },\n    {\n      \"comment\": \"Both Josephs are wonderful humans!\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"None at the moment.\",\n      \"sentiment\": 0.0\n    },\n    {\n      \"comment\": \"They're good.\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"I am very pleased with the people my manager Amellia hires. I am happy with the openness to communication that she has. I know she worries\\nabout her performance but I know that she can only be as helpful as people try to make her be. Often times I feel as if my coworkers have\\ndisagreements or complaints about her/her work/how the department is run it is because they don't make active choices to talk to her about\\nit. I have been here the longest besides Amellia and I feel that is because I have consistently gone to her with questions/concerns/overall\\nwork communication. Even when I don't agree with decisions being made, I am confident that it was an educated decision and that helps a\\nlot.\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"Very professional and kind\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"Great team management and can always communication concerns or tasks that I feel I fall behind on. Always willing to keep me learning more\\nand a better communicator\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"nothin but praises to be sung from me\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"There are several places in which the kitchen management have given conflicting instructions on how something is done correctly. It is not\\nmajor department change ideas that conflict but several day to day items. One main example is how we are told to cook the Mac’s for the hot\\nbar is in constant flux depending on the manager in kitchen.\",\n      \"sentiment\": -0.6\n    },\n    {\n      \"comment\": \"When things get very busy or hectic temperament can be short and is agitated with coworkers. They do not speak of inter department\\ncooperation very much.\",\n      \"sentiment\": -0.7\n    },\n    {\n      \"comment\": \"I appreciate that there is always an open dialogue with my supervisor. Regular check-ins make it easy to bring up concerns or\\nquestions.\",\n      \"sentiment\": 0.8\n    },\n    {\n      \"comment\": \"Great leadership\",\n      \"sentiment\": 0.8\n    }\n  ],\n  \"77. Comments on Supervision?_Highlights\": [\n    \"There's a stark contrast in experiences, with some supervisors (like Amellia and 'Both Josephs') receiving overwhelming praise for being open, empathetic, professional, and excellent listeners, while others are described as 'micromanaging,' 'condescending,' 'anxious,' and not valuing employees.\",\n    \"Issues arise from conflicting instructions, particularly in the kitchen, and a lack of emphasis on inter-departmental cooperation, indicating inconsistency in management practices.\",\n    \"Where supervisors foster open dialogue, listen to concerns, and encourage learning, employees report high satisfaction and feel valued.\"\n  ],\n  \"84. Comments on Job Satisfaction?\": [\n    {\n      \"comment\": \"This is the best job I've ever had. Yes, there are occasional downs, but that's just how life is, with ups and downs. My coworkers both in\\nmy department and in other departments are wonderful. It's a very welcoming environment, and a fun place to work. Every time a friend is\\nlooking for a job I recommend the co-op.\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"I feel valued by my department with my day-to-day tasks. I do not feel especially valued by upper management at times.\",\n      \"sentiment\": 0.1\n    },\n    {\n      \"comment\": \"Even though I've worked here a long time, I sure do appreciate this place.\",\n      \"sentiment\": 0.7\n    },\n    {\n      \"comment\": \"This is one of the few jobs that I have had in my career where I can genuinely say I have felt the most inclusion in issues such as\\ndecision making that affects all departments and emphasis on team members\",\n      \"sentiment\": 0.9\n    },\n    {\n      \"comment\": \"Other than one person, I have overall quite enjoyed working at the Co-op. Lots of friendly people.\",\n      \"sentiment\": 0.8\n    },\n    {\n      \"comment\": \"None at the moment.\",\n      \"sentiment\": 0.0\n    },\n    {\n      \"comment\": \"I am proud to work here, more so now that we are starting to lean more towards the center, for example: keeping the American flag up for\\nthe month of July, right after pride month (it used to be just for one day) a lot of us just want less political involvement OVERALL away\\nfrom both sides, WE work here and do not want OUR image as workers to be included one side or the other. I have talked to many who feel the\\nsame, we want to be a grocery store to all peoples providing good food for all walks of life in a comfortable way, that means being neutral.\",\n      \"sentiment\": 0.5\n    },\n    {\n      \"comment\": \"I am happy here.\",\n      \"sentiment\": 0.8\n    },\n    {\n      \"comment\": \"I only find myself not all the way agreeing with the co-op being a great place to work because I'm not privy to the way the downtown store\\nfunctions day-to-day in terms of relationships with/communication with/enforcement of policies there.\",\n      \"sentiment\": -0.1\n    },\n    {\n      \"comment\": \"The co-op has been a wonderful and great learning experience. Can always work well with my peers and communication between departments and\\nmanagers is always efficient and effective.\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"lovely place lovely people and how lovely i get paid to be here\",\n      \"sentiment\": 1.0\n    },\n    {\n      \"comment\": \"Conditions could always be better. The chronic shorthandedness could be better avoided with better hirings and more upfrontness about the\\njob expectations and heiring for the time of day needed to be filled.\",\n      \"sentiment\": -0.6\n    },\n    {\n      \"comment\": \"I would recommend the co-op as a place to work with some exceptions based on management style of certain departments. Although I really\\nenjoy the department I work in, I have heard from other coworkers in other departments that they clash with their manager and feel unheard\\nand disrespected by their manager. One manager in particular micro-manages to the point that multiple people have quit after minor\\ndisagreements escalated. These people also brought their concerns to upper management and were ignored.\",\n      \"sentiment\": -0.9\n    },\n    {\n      \"comment\": \"Great people to work with and for.\",\n      \"sentiment\": 0.8\n    }\n  ],\n  \"84. Comments on Job Satisfaction?_Highlights\": [\n    \"Many employees express high job satisfaction due to supportive coworkers, a welcoming environment, and positive departmental dynamics, but this is often contrasted with feeling undervalued by upper management or experiencing significant issues with specific supervisors.\",\n    \"Some employees feel a renewed sense of pride and satisfaction as the Co-op appears to lean more towards political neutrality, reflecting a desire for the workplace to focus purely on groceries and community rather than political stances.\",\n    \"A notable negative aspect is the impact of micro-managing supervisors and the perception that concerns, even those leading to employee departures, are ignored by upper management, creating an environment of disrespect and frustration.\"\n  ]\n}"
			}
		],
		"role": "model"
	},
	"finishReason": "STOP",
	"index": 0
}
