{"comments":[{"Question":"10. Comments about Co-op Ends?","Comments":["The entire community around the Co-op feels more accepting and listening of people with different backgrounds and viewpoints","A truly sustainable model would involve not shipping products from across the world and country. Many of the flowers and fruits the Coop sells are sourced from the global south, which is unsustainable for the earth when we consider the fossil fuel dependent supply chains these sorts of operations rely on. Instead if the Coop was to limit the range from which it procured it's products it would become more sustainable. The result of this, of course, is that the selection of fruits and vegetables would be less exotic and more seasonal, but most of us would probably trade fewer kiwis for an inhabitable planet. \"Sustainable luxury good\" is an oxymoron.\n\nThe Coop engages in many of the exploitative labor practices that every other company does. I have observed penny pinching when it comes to wages and hours. Often the management has no problem over working employees and does not respond to attempts at communication from those who are most stressed. Perhaps this comes more from bureaucracy than from intentional malignancy. The Coop benefits are good, but also wages are exceptionally standard. \n\nFinally, it is important to realize the cost of shopping at the Coop is substantially higher than at other grocery stores. Maybe the comparative increase in prices are necessary when accounting for organic practices, quality, and sustainability. However, this means that the community that the Coop ends up serving is really just the well-to-dos in Bozeman, not the community at large. Providing at least some cheap food not aimed at the upper-class of Bozeman would be important to meet this End. I pay attention to how many calories I can get for a dollar. At TNC I can get many grains for ~600/$, dairy for ~350/$ and meats for ~300/$. The Coop falls far short of these metrics most of the time.","I really appreciate the Co-op's dedication to being an enjoyable workplace. I have never worked somewhere that just cared so much about creating a positive impact on every single life the might impact, both in customers and in employees. I cannot express how grateful I am.","I appreciate the transparency and the Ends Review Meeting","the last point should be broader, to include not just local businesses or their owners, but also locals in general","I think the Co-op does a great job incorporating diversity in our staff - we have all kinds of people and it is fun getting to know people from different walks of life!","meh meh moooooooooooo","I don't fully understand Question #4--the wording seems a bit goofy to me--but, as a cashier, I get many comments about what the Co-op stands for. All in all, people seem to enjoy our products, although people often mention how expensive things are. (I don't necessarily agree with that, but I simply listen to their complaints respectfully!)","I frankly have experienced a few too many instances of customers and members (especially those who used to be volunteer working members) treating current staff with little to no dignity or respect.  It feels like often the dignity and respect of the workers comes last.","It warms me heart ta see a ship standin by the the code it claims ta sail under","No, not really.","ITS ONE OF THE MAIN REASONS I LOVE WORKING HERE! IVE HAD A FEW JOBS IN THE PAST WHERE THOSE GOALS WERE NOT A PRIORITY AND ENDED UP MAKING ME LEAVE! THE CO-OP HOWEVER, IS EXTREMELY CONSISTENT WHEN UPHOLDING THOSE GOALS MAKING IT A COMFORTABLE AND FUN WORKING ENVIRONMENT FOR ALL WHERE WE CAN FEEL ACCEPTED AND VALUED NO MATTER WHAT!","Proud to be associated with this business that promotes health through food, culture, and economy.  Feel this organization puts its ideals into action.  Nothing is perfect: it's a work in progress.  But it's an encouraging and ever-improving work in progress.","Providing healthy and fair priced food should be the main goal of the Co-op.  The rest of the agenda should be second.","so like do i get a bonus for doing this or nah","I think its smart and needed for the COOP to have these ends be the goal for the business and not only meet the goals but work on improving them and adding on to them every year, the COOP shouldnt be saying im gonna meet these goals im gonna go further and do better","We often seem to not have enough help but are not often hiring for those positions. For example, the grocery team is not rehiring an assistant manager. Is that due to not enough funds? If that is the case I do not believe we have an \"economically sustainable business model\" if the Co-op cannot afford enough staff.","In my own experience, management and values for the co-op have improved over the years, which is good to see. But over the years, I've also heard staff feel they were not adequately supported from customers or heard when they voiced suggestions to upper management. I have personally witnessed soft discrimination against staff members of color, not necessarily with bad intent, but where certain customers would treat staff members of color differently - they'd smile more, maybe they'd speak slower, it felt unnatural. I don't know what the co-op could do to stop that from happening, but I don't believe the employees who received that treatment felt adequately supported, and I think that's a problem. Even if there's nothing the co-op can do to stop that from happening, I believe there should be extra support to those employees to have the freedom to respond to those customers and situations as they feel is right (within the bounds of reason). Whether that be firm responses to the customers, or maybe choosing positions that don't require them to encounter customers as often.","I love that we underscore the importance of direct communication and even make people take a sort of oath to communicate directly, openly, and honestly. I wish we did a better job during training to explain what that means and how to practice it. And I wish folks who've been here a while did a better job of modeling that behavior. Please tell me how I may help assist in this endeavor. We are a workforce entry point for a lot of people, so if folks leave the co-op with this experience and attitude, we are helping to make our community better.\n\nI know we have to stay in the black, but struggle with the amount of junk food we stock. The \"natural foods\" industry is at fault for this and the co-op is just swept up in it, but it is a shame that this sector of the economy perpetuates nutritional illiteracy. I also struggle to stock products with non-recyclable packaging -- I don't just mean not recyclable in Montana, but not recyclable at all anywhere. And, while I adore Montana month, I wish we did a better job of prioritizing and promoting local producers or at least prioritizing small businesses over conglomerates with famous spokespeople.","While I personally feel safe in my work, I know others who were not so fortunate and I feel the Co-ops handling of these situations did not align with its stated values.","Greater care should be taken to ensure that BIPOC as well as queer/trans employees have a safe work environment. Some managers demonstrate a lack of ability to separate their personal political beliefs from work which leads to a toxic work environment for marginalized employees.","It has been a few months but I remember some of the information to be inaccurate which can lead one to speculate about the other year end totals being correct.","While the policies around gender/race/sex/sexual orientation/etc. emphasize diversity and inclusion, I feel that diverse physical ability is valued a lot less.","Our ends statement doesn't necessarily make a claim about how our co-op values its staff. \"All welcoming place\" could suggest that, but comparing our ends statement with our working conditions isn't really a generative line of thought.","the coop has recently put less effort into facilitating a community that celibates diversity.","Our efforts to accept and honor differences with customers (and staff) that may have a realized or perceived conflict with our own can be difficult to embrace or train within the staff.  Working toward a program that consistently coaches on these issues may be a beneficial area to explore.  The difficulties within the world that we are all navigating, though outside our work environment often, are things we are all dealing with and providing some tools or training on how to navigate would be helpful.","I think it is really important at the Coop and for those who work here to feel connected to the Coops values. However I think there are more ways we can work to build towards those ends that are not always reflected in the ends statement.","I feel like the staff's awareness of the Ends is still fairly new and that it's going to take some time for everyone to recognize the importance.","i think the coop has always done decently well in its end goals. we need to stick to our hometown roots and not go the way of the big box whole foods stores. i would suggest brainstorming up some ideas for what would attract more people to come try the coop and end up staying. we could try with open mic days because music brings people together and could possibly get us more foot traffic","The coop is not part of the problem, it's the way.","Of all the ends, supporting local businesses is most important to me.","How the co-op goes about applying our \"Co-op Ends\" is fairly inconsistent.","Everyone in this building would agree with these statements, but I do not always see the management team practicing them. When confronted with an employee with non-standard needs I often see them sidelined or put into a position that is not in line with their capabilities and then eventually fired.","Specifically about question #10: I feel as if there have been some very clear instances of differently-abled employees struggling in their workplace, and the Co-op management treating them improperly, or not with enough empathy. Particularly employees struggling with mental-health related difficulties and how they have needed to \"prove\" that they need accomodations to do their jobs.","The Ends statement is a positive and respectable model to run a business. However, it feels a lot like we're losing a bit of our personality in the transition path we've chosen in order to achieve said Ends. The phrase \"This is what other stores look like\" gets thrown around a lot and it makes one wonder what exactly is supposed to set us apart from other stores if we're trying to conform. A lot was said about being \"disruptors\" in the last big meeting we had, but it hardly feels like that.","I believe that diversity and open mindedness is one of the most important things in me wanting to work at the co-op. It has exceeded my expectation.","I think our Co-op goes above and beyond other businesses when it comes to diversity work and inclusion. Of course, the work is never over and will always be ongoing, but I am proud of how we honor DEI within our walls. I also think that as a mission-driven business, our Ends statement drives us towards those ends. I am excited that we are doing the work and trying to get staff more engaged with the mission, ends, and values of our business.","The Ends goals are always factored into decision making and policy creation. I have direct knowledge of that and see it continuously. I would gues sthat that perception lessens the farther down the organizational chain you inquire.","As it is a newer concept for the co-op, I am not 100% sure how I feel about it.  It seems to give us direction, which is nice, but the goals for our Ends seemed a little arbitrary at first.  Which I suppose is necessary, and in subsequent years we will be able to determine which sections are more or less important and add and subtract them as we need.  Hard to not feel like it can be a little like self-congratulatory propaganda, but that's basically what marketing is anyways.","Not right now."]},{"Question":"20. Comments about Co-op management practices overall?","Comments":["From the day I started working at the co-op I have always felt very heard and welcomed by the whole staff. If I have an issue or something I need to talk about I know that my managers will listen to what I have to stay and do everything in their power to help. It is an awesome place to work, and an awesome team to work with.","The Coop is better in many areas than other companies in the same market such as DEI, worker protection from the customers, safety policies, and public health. However, when there is conflict with the management itself either the willingness to change or the channels of communication seem to be very inadequate. The Coop should be willing to engage in self-reflection and change as needed.","I have been happy with my engagements with management.","I feel unsure of how to handle conflict at work - specifically with banned customers. Sometimes it adds stress to my job especially when there is no manager on duty.","Overall, management has clear intentions of helping customers and staff continue to uphold Co-op policy as well as promoting a healthy work-life balance.","IT DOESNT SEEM LIKE THERE IS MUCH CUSTOMER INTER ACTION WITH CUSTOMERS BY MANAGEMENT TEAM THAT ARE STATIONED UPSTAIRS FOR THE MOST PART. IN OUR ANNUAL MEETING RORY MADE REFERENCE TO A COMMUNITY STONE SOUP STORY HOW IT INSPIRED HIM FOR THE CO OP VISION. I JUST DONT SEE THAT JOY AND ENTHUSIAM FUNNEL DOWN TO STORE LEVEL WITH THE CUSTOMERS AND HOURLY EMPLOYEES WHERE THEIR BEING LED BY EXAMPLE","I think we're moving in a non-holistic and corporate way that is frustrating for the people who actually came here for sanctuary. Some of management is absolutely amazing and I have no complaints but there are others that make it extremely difficult for us to come to work and exist. The changes and actions Ive heard and seen in my time here from the top of management is questionable and I'm worried about the direction the co-op is taking. I've heard frightening stories about other managers who should've done more to support their staff and weren't given it because they were too scared to accommodate and stand in the fire of Rory. For example when Traes was working here and Scott drove her to quit by yelling in her face when she was going home early frequently because her brother had passed away not even two months prior.....The entire time she was working after her brother died she wasnt provided any support from her direct manager or the general manager Rory. It wasnt until after she was pushed to her limit and Scott brought her to the back that she was given any semblance of anything??? from her direct manager. Very disturbing. She wasn't given the time to mourn or the support she needed from said manager. When your staff and managers are worried about taking specific actions to help their staff members who are running your store I think that would be a time to step back and maybe reevaluate. Especially when your staff and management know what they should be doing but are too scared to do it.  I'd say 80% of management working here are doing what they should be and knows what it means to be a good manager and example. Others, not so much.","Nicest managers ive ever worked for!",":KEwdj","There was one instance where I was asked to assist HR because an individual who didn't speak a lot of English came in for a dish washing interview; he spoke Spanish. I was pretty disappointed in the fact that he got turned away without much of an interview--he even told me he had been a dishwasher for years in Big Sky--because he didn't speak enough English. I think this could have been a great opportunity for him to learn the language, as well as an opportunity for others to learn Spanish. It was kind of a bummer. I felt so bad having to be the person to tell him he couldn't work here. On the other hand, I want to applaud Brody for being so awesome! I truly feel like I can talk to him about any frustrations I'm having at work. (Which truly aren't many!)","It's hard to say I have confidence in the Co-ops direction when I have friends asking why our CEO is on twitter praising Elon Musk, who is extremely anti-trans, when the Co-op has a large proportion of queer, trans, and non-conforming people.  While I still think the Co-op is doing better than many places, it still doesn't feel like the Co-op has really taken much of a public stand around protecting marginalized employees.  Also the sudden dress code changes disallowing things like crop-tops feels like unnecessary regression from progress.","There always be room ta tighten the sails but the officers at the helm be steering this beast in the right direction","Overall, I believe the Co-op practices high quality management.","My one concern is with corrective action. I think we are too lenient with employees who neglect their job responsibilities and are unreliable and irresponsible. It is extremely unfair to those employees who do adhere to the co-ops standards when they see this insubordinate behavior persist and those employees are treated all the same. I of course think there are exceptions and some employees do deserve more leniency than others given their circumstances, but I think generally our policy should be reconsidered to take into account the impact on employees who are reliable and responsible and adhere to the co-ops standards.","At times, there is a definite feeling of Micro-Management.","The management is super top heavy.  There are too many Managers and there should be more oversight on that.","I feel that in Produce we need our managers to demonstrate stronger, more consistent leadership, especially when it comes to communication and staff management. I often feel that the burden of maintaining essential standards for workflow and accountability falls unfairly general staff staff due to a lack of clear delegation, direction and follow-through from both managers. This has created a persistent sense of frustration and burnout, and despite raising these concerns regularly, I don’t feel that they’ve been acknowledged or meaningfully addressed. I often feel dismissed when I bring a consistent issue forward. The issue rarely gets fully addressed, and disfunction continues to occur. \n\nImproved communication across the board—between management & staff—would also make a big difference. Clear, consistent, and inclusive communication would help everyone feel more aligned, respected, and empowered in their roles.","They're the best. What can I say?","i wanna give rory a haircut so bad like a mohawk or somethin that'd be sick","I think TY as my Manger is doing a great job, I've never had a problem with him his super frendiley and understanding of what we have in our lives outside of work, As a younger employee I do feel more noruves talking to him about things that go one since I havent realy encountred a work place before this. but I think hes super great and helpful,","I feel that overall, the Co-op is interested only in the more corporate style direction they are taking, and not the longevity of employees or their interests or concerns. Often promises are made (i.e. \"we are working to make sure every dept. has a manager on duty as much as possible\" - from this past Ends meeting), and not followed through on. That does not give me faith in management. I also feel they prioritize direct managers ideas/ thoughts over the people out on the floor.","I believe in the 4 day work week, and that insurance benefits should apply to staff in order to ensure they're able to have a 4 day work week. \n\nHowever, some of the staff I talk with have to work 5 full days a week in order to qualify for benefits. This isn't fair, and I can witness it leading to burnout, which will have longer term consequences with staff retention and quality of work. \n\nI understand that insurance benefits are tied to hours worked. But the fact is that some jobs take more energy and attention for others, so that 6 hours in one position might feel as draining as 8 hours in another. Full shifts, even if they're a little shorter than others, should enable insurance benefits after 4 full days worked. Right now it doesn't feel fair, and the burnout will have negative effects down the line. Not to mention employee wellbeing. It's less important to me that those draining shifts should be paid more, because they're shorter (though I think that makes sense). It's more important that insurance benefits apply so that those of us with medical conditions aren't forced to work 5 days a week if we don't need the money. \n\nI can see a lot of managers also working really hard, probably even too much. I don't know how much freedom they have to take time off and manage their time, but I think they deserve to have plenty of freedom there too.","I'm extremely satisfied with how my current manager handle problems within the department. In regards to how other staff members have been treated in Front End of CWM and CDT, I'm very frustrated. Managers in these departments and locations have shown retaliation and in my opinion haven't handled situations with the attitude and maturity fitting of a manager.","I have been very fortunate with my evolving management team. Brody, Shiloh, Andrea, Shiloh (again), and Ashley have all been amazing: direct communicators with good attitudes who take responsibility, provide support and guidance, show appreciation for their team, and make the job fun. While I work with her less, I have also really appreciated the way Stacey shows up for us, demonstrating the same great attitude and genuine teamwork as my direct managers.","I’m not sure what management is like across other departments but produce management needs some work with communication and hiring good people","I have spoken to several former employees that I believe were terminated under unethical circumstances. Whether the Co-op did anything illegal I don't know for certain. but as it stands I do not trust the Co-ops official channels.","#17 talks about corrective action being fair and consistent, ive worked in my department for over 2 years now and there are two individuals who have worked here longer than I have. These two ppl have a consistent habit of taking 2-3 10 min bathroom breaks per shift in addition to their regular break plus they often don't do some of the responsibilities they've agreed to do and leave extra stuff for the morning crew to deal with while going home before their scheduled time is up.  I know that I and many of my coworkers have expressed annoyance or additional strain from these actions/in-actions and it is disappointing to me that any corrective action that has been taken has not resolved the issue.","I don't know what managers do lol","Co-op management has a tendency to favor employees who have been at the co-op longer/are older. Mine and my coworkers' opinions and grievances with older coworkers are often brushed off or treated as if they aren't a big deal. Coworkers who have displayed abusive behavior at work in the past have been allowed to remain at the co-op because they know how to play the game with management and make it seem like the problem is with everyone else except them.","Ive been around worse but thing could always be better.","I have seen corrective action used very successfully and respectfully but have also seen at least one employee (who is friends with HR) get special treatment. Personally, I have come forward once about a coworker being inappropriate to HR once and was treated disrespectfully-- they treated the situation more like a nuisance rather than a real emotionally difficult situation. However, when I spoke to my manager with it I had a completely different experience-- I felt way more valued and respected with my managers. I feel very comfortable going to my management team with issues, but have not had good experiences with HR. Many of my coworkers express a similar sentiment.","I feel like the Co-op went hard into DEI.  I am all about equality and inclusiveness, but it felt for a while that that became our banner rather than serving good local food to the community.  I think there has to be a balance.  I feel like the Co-op is getting back to the balanced approach.  We have employees and shoppers on all parts of the political spectrum.  Let's be respectful of staff and shoppers but remember our goal is to the community - both sides.  I feel like we are moving back to that.","At times, there seems to be a bit of a disconnect between those who work downstairs and those who work upstairs. I wish those upstairs put a lot more effort into connecting with those who work downstairs. This includes avoiding SCO, opting instead to speak with a cashier to ask them about their day/experience. The up/downstairs binary is a bit on the nose. I want to see more effort put into dismantling the perceived power imbalances.","recently there has been actions taken that are making us in front end feel less like people and more like tools for the business","I feel confident that even if situations do not unfold as perfect as perhaps intended, the management team is doing their best and have our best interests in mind when making decisions or handling situations.  I view our management practices in the same manner.","I think management is good overall.","If the direction is towards supporting local and regional food producers, then I am enthusiastically on board. If the direction is towards emulating Whole Foods and offering products primarily because our competitor is offering them, then I have doubts about our future.","i would like to remind management that we are all human, that we are more then just the results that we can produce. be careful to not fall into micro managing the workers as it does elevate stress","Shit is getting real out there. The coop feels like a safe harbor for a lot of folks, not just the typically vulnerable groups. The one thing i would say is that safe harbors often need \"active defenses\". I don't know if this is something the coop has had to navigate before.","My managers earn my respect through hard work and participation in day-to-day participation in problem-solving. I appreciate those who are not afraid to get their hands dirty with us downstairs.","In the hand book there is a specific exemption for one department related to the use of earbuds at work. This seems unfair to other departments","I've been told by upper management that they don't have to time to address serious issues that have very negatively impacted the co-op bakery. If upper management personally likes an employee they will let them get away with way too much at the expense of others. We had a previous manager in the bakery who was not showing for work mentally and physically for years. When brought to any managers attention they very quickly brushed it off and would say \"I really like them\" \"They're going through a lot\" We all need to show up to work as our best selves and be present for each other. This previous manger also failed to address very volatile inter-personnel issues with certain staff that resulted in a high turn over for years.","Any time I have an issue with something HR is doing I know that raising it with them directly will just get me shut down and ignored. I know they work for the company and not the employee, but it's frustrating when they present themselves as wanting to help employees with their problems but not actually doing that when confronted with employee problems. The best response I've gotten is a polite blow-off. If they aren't willing to bridge a gap between the people and the company, that speaks volumes to me. I no longer feel safe or secure bringing up any workplace issues to them.","The style of engagement with the rest of the staff is vastly different from the previous highest level management. I don't know that one is better than the other, and I understand that much has been restructured. I wish there was more empathy from managers to staff about the current state of affairs nationally and the ever rising cost of living. I think more flexibility on expectations of staff, or different framing of expectations could do a lot for retention.","There is a strong feeling of distrust for the some of the Upper-management team, particularly the People and Culture Director. I personally have both experienced and witnessed dismissive, defensive, and/or non-empathetic responses and actions from some of the people in upper management that have made me frustrated and distrustful of their processes. I would like to see more of the \"Accountability\" part of our Values, particularly from the GM and anyone in Management that makes important decisions.","I have a lot of trust and confidence in the capabilities of the manager I directly report to. However, there are few members of upper management that I would feel comfortable reporting things to. I would not say that any issue personally brought to upper management has been handled well. It has been observed several times that, if given feedback that was not particularly positive, it has been met with defensiveness, pushback, or dismissiveness.","Many things have fallen through the cracks over the years!","Sometimes I stress about who to have conversations with when I feel concerned about something. Especially if I've already talked to my manager. we have been going through a big transition and I do believe everyone cares and is doing their best.","My direct manager is a gem and is very open to conversation around topics concerning workplace issues","I believe the Co-op cares about employees more than most other businesses. We offer great benefits such as paying 100% of healthcare premiums and starting an autoenrollment into our 401k program, where we have over 90% participation and have folks starting to save for their futures. I think our People & Culture team works tirelessly to make this a safe, desirable place to work and somewhere where the needs of the business don't supersede the needs of our employees.","Due process is not followed","I think that Managers need to be more consistent in corrective action. There is not enough accountability happening currently, which, in my opinion, is affecting staff morale, as well as manager morale. When some managers hold staff accountable and others do not, it does not seem fair and creates a culture where there is gossip about who is doing what and who is not.","It's such a challenging task. Management works hard to support emoployees but it cabnfeel like that's never enough or isn't seen for what it is. I have a definite perspective in this working relationship but I've worked enough places to know that this is different and worth doing.","What direction is the Co-op taking? Information needs to be disseminated down to the non-management team more often.","Due to the managment staff being entirely made up of humans, I feel like it will be impossible to have completely fair and consistent application of corrective action.","I think the store has done well with following the American Disability Act"]},{"Question":"27. Comments about workplace communications?","Comments":["Working in the bakery, I have found Jill to be extremely open to new opinions and communication and actively taking employee feedback into account when designing recipes, changing schedules, and general bakery management. I really appreciate this and always feel like my ideas and opinions about our processes will be taken seriously.","Would be nice to have a better line of communication between locations, to know what our product is being used for so we can prepare it for downtown the best way for them as well.","Referring back to the statement, \"I have access to the information I need to do my job.\" I do, but I feel I could do better in my role if we had better technology. Also referring back to the statement, \"Communication between locations is effective.\" I would say we need better communication across departments and locations. There are a lot of people that work at the Co-op and the way we communicate with eachother is really important.","Love it. Everyone is open to listen and give good feedback.","See last comment. Upper management is unresponsive","I feel that pouduce managment strugles to communicate effectively to all team members, it ends up being a long game of telephone for information that is critical for our job to function effectively","DEPARTMENT MANAGER MAKE EXTRA EFFORT TO TOUCH BASE SEVERAL TIMES A DAY","The only thing that sort of bothers me with front-end communication is the fact that we're asked not to text our managers, but they can still text us... even on our days off. I understand that if they need someone to cover a shift that's the only way to contact us, but... we have been asked repeatedly not to text them, yet to always respond to texts about coverage. It just seems a bit unfair? Maybe there's system we can try?","I don't know much about the store as a whole, but in the produce department good communication is severely lacking. Many of us will bring up suggestions and concerns with our managers and will have to repeat our complaints many times over months before anything will maybe change.  There is also safety training around chemicals and cleaning products that would be extremely useful and the \"a-z produce\" binder that is meant to help staff with product knowledge is virtually empty.","I find chatter with me mates and the ships officers ta be open as the sea and smooth sailin all the way","I think we have a team with good communication, however, communication can always be better.","I wish the \"Apple a Day\" recipient was promoted downstairs at CWM instead of just upstairs.","I feel Co op management and Co op workplace are both highly supportive of communications.","Communication in the produce department is terrible.","I think it would be beneficial to have department meetings for CDT employees.","coop cell phones or we riot","I think the COOP does a good job cummunacting with us, I know i think my checkins with my manger are super helpful and help give me a goal to work on.","I don't always feel the manager check-ins every six months are effective. I am either told \"we are telling everyone this but you don't need to work on it\" (so why are we taking the time to talk about it in my check-in?) or the issues I bring up are partially dismissed or given platitudes. Rarely do I feel comfortable bringing up real issues to my manager.","Years ago I would have said that employee input is not valuable. But with the management changes in the last year or two, I can see the managers listen to opinions and care about their work. Notably in the past, we have had some bad options at the hot bar and takeaway food in the fridges. I think that's improved a lot, but I still wouldn't mind a way for customers and employees to submit input on the food we make. Yes, not all of that input will be constructive, but some of it will be. Right now, I don't see this as a big priority, but in the future as management inevitably changes, those problems could come back. Creating a way to accept input could help mitigate those problems when they happen.","#25 these communication tools are the only ones that exist within our department\nOnly information I would like to know is regarding to our local providers.","I'm impressed by what we do communicating across space and time, especially when (to my knowledge) the majority of our team does not receive internal emails.","Produce department-\nThere isn’t really a lot of communication across the team. \nFor example\nAparently someone was told there’s a cleaning regiment, no one else was told about it to my knowledge\nAparently there’s also a department meeting next week that myself and my other coworker did not hear about either. \nThings like these examples are pretty common.","Communication at the Co-op is hit and miss at best; but communication between departments is notoriously terrible.","I appreciate the writeups that Lori creates for advocacy days and days of remembrance. I appreciate the linked sources and usually learn something new when I read one.","#22 mentions management considering/implementing suggestions and explaining why, I feel like managers do carefully consider suggestions but sometimes the communication between the departments gets lost, sometimes suggestions will be implemented that work for an area but if the idea had been shared with other departments there might have been a better solution that benefits everyone.","they're good I think","Communication between the food service operations at CWM and CDT is nonexistent, I have no idea what's going on over there 99% of the time","Ive seen communication be great some days and horrible other days.","I know many of our recipes come from non-management employees which I think is really cool","We used to have a lot more communication in our department. I get it, we've been spread a bit thin, but the staff deserves to know when their co-workers have departed the co-op, even if we cant explicitly know the reason.","Communication methods need to be looked into a lot of information is falling through the cracks","In my experience our biggest hurdle regarding workplace communication stems from the conflict between day-to-day time sensitive tasks that require attention to continue our daily operations and the remaining time available to focus on communication outlets.  While the communication tools listed above ARE useful and have their place, they are not ones I regularly nor solely rely on for communication.  \nWorkplace communication can be a struggle within an organization that has systems or processes that have been exercised for a number of years, but have perhaps over stayed their effectiveness.  There is often a large amount of time or struggle to convince others of changes, as well, there are usually a large number of stakeholders involved, thus making communication and decisions difficult to realize.\nRegarding comfort levels expressing background or cultural experiences of differing opinions, I do not feel comfortable expressing those opinions that may be different than the others, as I feel most staff do not have the skill set to calmly have discourse in conversation should thoughts differ from theirs.","I really like whiteboard posts, it's clear and right in front of me. I think that's a key spot for information.","Communication is our weak point. One recent example: an extremely capable teammate with extensive management experience was asked to train a new employee when I was unavailable for the task. She was surprised that no member of the management team asked her how the training session went. When she took it upon herself to volunteer information about the session, she felt that little interest was expressed in hearing her report.","I feel able to face to face talk with anyone at the coop.","I wish there was more communication and encouragement for internal applications. I want to see people stick around the co-op longer.","Seems like there are many different formats, with different type of communications. Is there a way to consolidate into one place. Maybe a digital place like pay com","The Co-op has always been sub-par about communication. When communication does not happen in an appropriate and timely fashion, I've noticed that staff/managers play a weird blame game instead of taking true accountability. There have been quite a few odd emails of managers just blaming each other and not actively trying to problem solve.","When management makes an announcement and it comes out of nowhere, it makes laborers in my department feel that they have no input in big sweeping decisions. I wish I was included in more conversations about things that will happen rather than being presented with a new normal that is happening no matter what.","Communication between locations often breaks down.  There are too many on-going last minute needs at the downtown location.  Department managers may see the email threads that detail the movement of goods/supplies between locations, but this often does not move to all of the people who need this information depending upon work schedule.","It is a very comfortable atmosphere among staff to speak about what's going on and stay in the loop with what's happening around the building. There is a lot of struggles with keeping up to date with what's happening between locations, so it would be able to interact a little more.","These are my people. I feel very comfortable and excepted there. My opinion matters and I feel respected almost all of the time. When I don't it is usually because people are overwhelmed, or my idea has a good reason for not being implemented.","I feel upper management responds to issues I've brought up, but does not seem to be interested in information","Communication can always improve, especially with such a large organization. I would love to see the co-op embrace the use of \"huddles\" more often to not only relay important information, but also build a culture where we acknowledge the good work we are seeing, brainstorm on how to continue to improve upon our efficiencies, service, and overall help create that culture of open and honest communication.","This is always the most troublesome part of the job. It feels like i work constantly on communication and it so often seems to miss the mark. Communication between stores is especially challenging. Some people don't have very much time for email (or bluntly, are not good at written communication). Assumed tone and motive are often perceived incorrectly.","It can always be better.  The issues between CWM and CDT are long legged and persistent.","I am glad they upper management is making succession guides for every department management position. Having come into a manager position recently was chaotic. There was little to know structure or guidance written out. I had lots of help from my supervisor and others on the team, but I think coming into a job with no structure would be a dealbreaker for some people. I have no idea what is going on downtown. Is the stuff I send them selling? Do they want more? Do they want less? No idea. Its like sending food into a void."]},{"Question":"34. Comments about compensation and benefits?","Comments":["The benefits provided by the Co-op have helped me 100%, and I feel confident about my pay scale being checked in as time goes on as the Co-op communicates pay well.","Wages need a fair cost of living adjustment for Bozeman area costs- not based on having roommates. Not every employee is college-aged and many of us need to live alone for mental health but can't afford it. There should also be a merit based raise option for employees that go above and beyond their required duties to reward and retain staff and encourage engagement. ie: Why would I work harder when I see someone else doing the bare minimum and getting paid the same (or more) wages??","The reason I say I strongly disagree I'm being fairly paid for the work I do relative to similar opportunities in the area is because I can barely make a living for myself. I have a degree, working full time here at the co-op in the main office and I can't save a dime I'm living paycheck to paycheck. I think it's important to take the cost of living in Bozeman into consideration. After doing some research, there are similar opportunities in the area that pay more. Also I do not get any holidays off besides Christmas Day and Thanksgiving, and those aren't paid.","As a college student who is studying Sustainable Food and Bioenergy Systems, I truly believe that the co-op carries the same values that I do. Even before working here I did my primary shopping here. I wanted to work here since I switched my major to SFBS, and I love the amount of local, organic foods that the co-op carries. For a college student, the staff discount and the staff snack shack makes a huge difference in supporting how i choose to fuel my body","The Coop has no staple items that are just cheaper than other stores, even with the discount.","For question #33: I will shop at the co-op for the fresh produce because I know where it's sourced from, and I can trust the food quality. I use other stores for household care items, pet supplies, and prepackaged goods because they both carry brands the co-op doesn't and are cheaper.","cost of living here is absurdly high, regardless of what the COOP can or cannot do about that, and I do believe this business does have some power in that regard which it isn't using. In general for a business to continue to be sustainable it must sustain its most numerous employees effectively. Frankly most businesses in the area do not pay enough, the benefits here are greater than many jobs which helps.","I think co-op employees have great benefits and it is something I am really grateful for at my job.","I APPRICIATE THE STORE DISCOUNT AND SNACK SHACK WITHOUT THEM I WOULDNT BE ABLE TO SHOP AT THE COOP","I believe the idea of 'fairness' for the co-op should be reevaluated. Especially for us support staff. We should be able to accept tips and have a free drink. And paid more.","6rdyic","I took a paycut to come here. I love the work here but it's noticeable when thinking of how my budgeting has changed.","I feel like I've been a very loyal employee, and I know how to do a lot of the work shift supervisors typically do. I'd love to request a pay raise, but I know those only come every year... correct? I've also picked up emergency shifts, and I don't think I've gotten the pay differential. When I asked upper management about it, they also didn't seem to know how it works...","I think there needs to be supervisor positions in produce.  Knowing that other departments assume I am a supervisor because I am the default go to when my managers are not around for any questions or problem solving but I make the same amount as others in my department who refuse to do the job properly and will pass things off to me/others in our department.","It be a blessin from Davy Jones ta be getting me healin an perks all paid for by the crew with no coin comin outta me own pouch","I really appreciate the co-ops employee benefits - having 100% covered dental, medical, and eye is relatively unheard of and I greatly appreciate it. I also think our other programs like high 5s and staff snack shack are great means of boosting employee morale. My one concern lies with financial compensation. In theory I really understand the co-ops compensation model based on rewarding tenure. As a co-op and just an employer in general it makes sense to really value tenure, experience at the company, and dedication to the co-op; but on the other hand I do truly think by ONLY giving out yearly raises and not considering merit based raises, it isn't encouraging anyone to go above and beyond and really try to improve the store and their impact because either way they will be getting more money if they stick around and just do the bare minimum. I think it is something we should reconsider to at least keep merit-based raises on the table and give them out when justified to encourage employees to excel","The benefits are great.  The medical, dental, vision, and EAP at this type of job and at my pay grade (lowest tier!) is aMAZEing.  The 20% discount is awesome especially on Health & Wellness products.  The Snack Shack is an incredible bonus.  I am SO grateful.","I feel a cost of living wage adjustment should be considered when looking at the cost of housing/food in the area.","The 30-hour work week benefits threshold is a great thing to offer employees.","maybe another dollar raise?? just sayin","I know the staff discount helps a lot when shopping at the COOP, but it feels like it just brings the price down to a more reasnable or more similar to other stores in the area like TNC, But the food here is way more healthy and high qauility which is the kind i want to be eatong just hte pricie is hihg, I also think the 401k benifts super helpful ik im younger but it helps me get more of a head start in life","I am not sure what the Employee Assistance program is or if it was mentioned to me.","Other places to work around here often pay more than the co-op does, but I understand we pay as well as we reasonably can. And the friendly work culture here makes up for that for me. The discount and snack shack help a lot too. I wish we could get more things in the snack shack, like from the olive bar (I see a lot of that food being composted). I also appreciate the improvements that have been made over the last few years to the hot food, the management, and function (new, better tools for us to use for instance). \n\nI think other grocery stores have increased their prices a lot more than the co-op has in recent years, making it comparatively affordable while retaining the good local products other stores don't have. Sometimes there are products I'll have to visit other stores for (certain spices, for instance, or types of ice cream). But with the hot bar improving so much after the last year or so, it's an extra perk other stores don't have.","I'm not here enough and work here for reasons that are different enough from most folks that I didn't weigh in on compensation or benefits.","The benefits are great, I just don’t use them since I’m still on my parents insurance and stuff but the snack shack has been awesome, I’d love to start putting more produce in there","I would strongly advocate for merit based raises. I think we have lost the opportunity to have more great employees over the years because there is no monetary incentive to work hard and go above and beyond.","In the past, I have been the only person out of the whole bakery team who didn't get a raise, despite showing efficiency and consistency in my work and product. The reason given was because I did not have prior food service experience even though this is not true. I took the initiative to meet with my supervisors and explain why I deserve a raise and nothing came of it, leading me to feel alienated from the rest of the team and like my work didn't matter.","I've looked into what some of the state wages and national wages are for my job and they are very low compared to the numbers I found. Not sure how accurate of info I was looking at but it wasn't close at all.","I haven't been looking at other jobs in the area. I would like to feel comfortable shopping and surviving at our co-op, but I have not yet had to survive fully on my own labor. Only time will tell how I feel about this one.","While the pay rate is competitive for my role, PTO benefits and Holidays have not been.  However, I understand this is being looked at to work toward a more competitive and appropriate benefit.","I love the full coverage for health insurance. The discount is good, but with prices going up, 25% would be really nice. I also love the paid break and the HSA account. Overall, the benefits are a huge plus to working at the co-op.","I buy about 40% of my food at the coop 40% at costco and the other 20% is convenience shopping at other places.","If the Co-op began selling honey bunches of oats and spam, I would do all of my grocery shopping here.","I feel that the Co-op has been generous to me. I buy all my provisions at the Co-op, approximately $400/month.","In my case one of the great perks to me, not mentioned above, is the willingness to work with scheduling for peoples real lives without all of the toxic invisible expectations I've encountered almost everywhere else I've worked.\nBecause of my particular situation, and not as result of the coops compensation, I am sometime borderline food insecure. The snack shack means a lot.","I feel that staff wages are irrelevant to how hard they work/management expectations. Some people work extremely labor-intensive, taxing jobs for 19/hr, while others waste tons of time and earn a salary. I appreciate the equitable approach of annual raises, but some people have no incentive to work harder, regardless of how long they've been here.","The Co-op actually has very good benefits for me.","I don't know what there is to be done about it, but prices on food, rent and basically all other necessities have only gone up and up and up, and I don't really see how the co-op will avoid being staffed entirely by high schoolers and other people who don't pay for housing. I don't know if its realistic to expect this, but the co-op could facilitate staff with housing needs accessing the resources they need.","I think the Co-Op does a better job keeping up with cost of living than most places in town. I do think that some of the starting pay for certain positions could be higher based off of what the other employees make and what jobs with similar workload pay. I think that there's a bit of disconnect there in some areas.","The co-op is a place I would shop at even if I didn't work there.","There is another store very close to my house, so I shop there a lot also due to convenient location","While I don't use all of the benefits listed, I believe they are all valuable. I wish there was an option for health insurance with a lower deductible where staff could pay the difference, and while I'm not sure how that would work, I'm curious what the cost difference might be and some staff might find it worthwhile. It was difficult last year going from BCBS where certain things were covered (mental health counseling, dietician, etc.) to one where that's not paid for until the deductible is met.","I value our benefits here and love how we are always striving to offer more!","3% raise with 3-7% inflation is disappointing","Our compensation and benefits are great! I don't know any other business in the area where health insurance is fully paid for by the Co-op! I appreciate that we are always looking at our wages compared to the cost of living and make changes to meet those.  I feel valued based on my compensation.","The Co-op does a good job of rolling a lot of different benefits into an oveall compensation model","I still think that we could offer better insurance and have employees pay a portion of the premium and it would be accepted.  The rest of the benefits are excellent.  No one working here will ever have to go hungry, love it.  Paid breaks, who else does that?","I came in as a manager earning around $60k. Several staff members who report to me, and who have been here longer, are making the same amount. While I respect their experience, it's odd that there's no pay differentiation for added responsibility or leadership. The lack of merit-based raises also removes any real incentive to exceed expectations, since raises are standardized annually, regardless of performance. The job posting listed a range of $60 to $65k, and with my experience, which is more than sufficient for the role, I was surprised not to be offered the top end. It would also be helpful to know what the pay ceiling is for this position. Benefits are good and the HR team does care and want to be fair. Fair is hard, so I get it."]},{"Question":"42. Comments about store/location operations?","Comments":["Improvements can be made but it takes time, and an effort is being made every day by everyone to improve.","Huge lack of communication between departments. Could be working together to reduce food waste and increase efficient product utilization.","The reason I strongly disagree with the statement, \"I have been given the tools, equipment, and technology needed to perform my job.\" is because I believe our technology can improve greatly and help us do our jobs even better with more technology and tools.","Sometimes CDT won't listen to us when we tell them to not order only 2 or 3 of one kind of sandwich or that we've been consistently out of a key ingredient in a sandwich they keep ordering.","hcgvcjh","I think we should all have laptops instead of desktops and be able to Chromecast into meetings rather than logging into a new computer everytime - I'd like to see that change in our technology.","There are definitely tools and knowledge I would like to be able to do my job better. A lot just comes down to communication, like learning that there is an in house serrated knife sharpening operation by luck, when produce staff had been asking for new knives for months, only to find out our assistant manager knew the whole time and didn't inform any staff. Or only having found out recently that water neutralizes isopropyl alcohol.  The produce cooler needs more regular cleaning.","There may be some barnacles slowin tha ship, but I see em patchin the sails and trimmin the fat guiding the ship toward smoother seas.","The communication between departments in such a small business is mind boggling.  You to write something down and an email has to be sent and another and another.  Too much management oversight.","what if we were allowed to wear roller skates in order to enhance efficiency","I know for when ive worked ive seen some saftey concerns, since I'm a smaller person trying to reach or put away bigger things on higher sehvles is harder for me and can be more dangrous, Ik one time there were the big pots which I had to lift above my head and was harder to get up but somone didnt hvae one up all the way and fell on mebut that gpt changed pretty quickly just less stuff where we have to lift bigger things to higher places","I think efficiency depends on the department. There is a lot of miscommunication/ no communication between some depts. with some believing they do the most work of anyone here and are therefore able to make the rules, or think that everyone else should work around them. This leads to disgruntled employees, inefficiency in daily tasks and animosity.","Question #39: The person who tried to explain the worker's comp process didn't understand it well enough to explain it, but did try. \nQuestion #41: There's not a lot of cross-training, so it's sometimes difficult for departments to support each other. But I know I can 100% rely on the meat team and the facilities team to support my team. They are great communicators, hard workers, and are easy and fun to work with.","The produce department is actually one of the dirtiest places I’ve worked in (food/ restaurant/ grocery world). There’s so much mold and other various build up that gets acknowledged, but nothing ever gets done about it. I’ve begged and begged to do swamp shifts to help get this under control and have only been granted so once. When I did said shift I got 6 entire shelves and underneath the wet wall cleaned and sanitized in roughly 2.5 hours. So it doesn’t take too long. But there’s no cleaning regiment at all, so I just try to deep clean in my free time.","parking lot is not safe, very dangerous, people drive way too fast and are looking at their phones, have nearly been hit multiple times.","I love our staff.  Management is amazing - the amount of care is a Co-op hallmark.  The people and the care of management keep me at the Co-op.  I love my coworkers!","Communications mostly occur when someone is hired or when is deemed relevant to post about in the book. Book posts made more than three months ago are often forgotten or unknown by new staff. More consistent education about safely from managers would be beneficial to our at-risk staff.","there could be more teamwork between departments","As mentioned in a previous comments section, it can be difficult to modify operational processes that have been done for many years or explore other ideas without first having to convince others or get buy-in from many individuals.  It has often felt like we have gotten in our own way with supporting departments or locations and/or have just done things one way for so long no one knows why we still do.  These kinds of hurdles can be very frustrating and demoralizing when trying to progress forward.  I have often felt like some individuals within the organization have settled for the status quo instead of continued to push forward and change as our community has.  \nI feel we have yet to successfully structure ourselves in a way that supports all departments and locations.  Though we have made some steps in the right direction, I feel we do not operate as a cohesive organization with one vision or path toward daily operations.  We have structured ourselves in a way that divides the organization and locations rather than collaborates them.  As well, I feel there are different expectations within \"similar\" roles and operations.","Not much to say","My one concern about safety is crowded working conditions. The large walk-in cooler can be so crowded that I worry my teammates may be injured while attempting to retrieve and/or lift a heavy box. It's not always possible to adopt a comfortable lifting stance (there's no room). And maneuvering a box sometimes requires torquing outstretched arms due to limited space. We have also had several back injuries in our department.","if im having a really hardworking night i appreciate when the managers notice and help when they can","When we have safety concerns about the food service kitchen they are very promptly brushed off and not truly addressed until it gets so bad that our facilities department can't look away. Ex. Our sanitizer dispenser in pastry is so inconsistent that it is either way too strong our way too weak. When brought up we were told \"Pastry doesn't know how to use the PH strip tests properly\" It clearly was a sanitizer dispenser issue and when finally further addressed it was admitted that the pump dispensing the solution was broken. Also, when our deep cleaners come in at night they leave way more of a mess then when we left. Ex. When our vent hoods were cleaned the previous night, we came into a ton of unknown debris in our mixing bowls and on our work benches. There was zero communication about this until the bakery found the proper party to ask and address the issue.","My department in particular has struggled to get consistent help from other groups in the same department. We still often feel alienated from the help that others can easily receive, and there seems to be a constant back-and-forth between the managers about who will be doing what tasks and helping each other in which ways. It is confusing,","We as a company are really good at inter-department assistance.","Some people help other department if asked mostly if it doesn't require much time. That is understandable. We don't know other departments jobs so helping is a bit limited.","I know there has been issues with turnover, but some departments are struggling","I largely get the cooperation I need from other departments, but lately a lot of managers lately are just really busy and I feel like certain lower priority tasks get overlooked and not done in a timely manner, or there's not enough attention to accuracy. It's hard when there's lots of people involved, but I feel like certain things aren't being double-checked they way they should be.","I know how much the Co-op values safe work spaces and appreciate the time and diligence management, especially facilities, spends ensuring a safe working environment.","Lately, it seems that there has been a slide in some food safety protocols (long/loose hair), it would be great to see those policies that we have in place adhered to.","Not all departments have the same commitment to safe operations.","Only problem with efficiency is staff turnover."]},{"Question":"51. Comments about department operations?","Comments":["Have complete confidence in my coworkers and my department fully.","I love my department.","Shift in management can take time to iron out inefficiencies. I believe our current leadership is working hard to make this happen smoothly and checking in for feedback.","I feel like there is room for drastic improvement, as standing right now, cleaning is not priorities, it is a if you have time during you shift. It gets put off and not done leading to an abundance of mold on the cooler shelfs. Employee are held to vastly  different standards In regards all job functions. Makes it very frustrating having to pick up the slack. when trying to communicate the discrepancy it gets brushed off, or management \"talks\"to them but behavior and working productivity has not changed","Us support staff are a well oiled machine. Especially when Hillary was here. We're all extremely stressed out right now with the weird wishy washiness of not hiring Garrison. Depending on what they do with the support team and filling hillarys position I foresee a huge turnover for support staff. I dont understand what the hesitation of it is and its extremely disrespectful to Garrison and to us that it wouldn't be taken more seriously when we're the ones who have to pick up the slack of all the other departments. I cant fathom how we wouldnt be most paramount to fill. Other than that everything for the support team is great because we all take care of eachother and have been supporting one another in this changing time. Stacy has been extremely helpful too and supportive of anything we need.","635syr","I've had a conversation with Brody, and he validated all of my concerns, however, it is hard to be a front-end employee sometimes because a lot of employees don't like to spend time at the cash register--haha--even though that's their job. It's gotten way better since my conversation with Brody, though!","Communication in produce is horribly lacking.  Information is not readily shared and concerns have to be brought up repeatedly before there is even a chance that anything will be addressed. There are clear issues with some staff taking on more work to compensate for others, who are given a free pass and constant excuses for doing the job incorrectly or not doing the job at all.  Certain employees are allowed to stand around idly talking while others are working the floor all on their own.  There are also clearly inconsistent standards where some people do not care about holes to be filled, or if there are moldy apples or sprouted potatoes on the floor, when others are working to uphold the department standards of having the best produce in town.  All of this has been brought up to our assistant manager repeatedly and no real changes seem to happen, instead he acts surprised and says it was probably busy or a mistake. Every week. Unfortunately I am now spending time going out of my way to find and discuss this with my department manager, who hopefully will take more action but is much less available and often leaves before I have a chance to speak with him.  I've been growing more and more frustrated and feeling less and less valued and heard the longer I have to bring up issues to no avail.","By thunder, I truly love sailin with this crew, each mate growin sharper by the tide, and the whole lot pulling together tighter than a reefed sail! the captains a boon, steerin us true and raisin the bar fer all hands","Jill is doing an excellent job in improving ops in the bakery!","please tell front end what to do or how to handle broken, damaged, or bad bags and where do they go?","There are lots of opportunities for improvement in our systems/how we do our jobs but it doesn't seem like there's the time or interest to make it happen. In the past, making genuine suggestions and even offering to help implement them has typically been met with \"I'll get back to you on that\" then a lukewarm nothing-response several weeks later.","I feel that the management team within the Produce Department does not seek to make change where it would significantly impact system efficiencies because \"That's not the way we have done it in the past\". The management team does not think out of the box or look for new solutions to problems. When others bring these ideas forward they are often dismissed.","as a younge remployee whos worked here longer than some of the older people or around the same time, i still feel like im looked apon like a little kid instead of somone whos equal","I feel that every issue I bring up is ignored. Ways to improve, such as fixing how much product is being removed from the shelf due to improper rotation, making sure we are not skipping over certain backstock areas, amongst plenty of other inefficiencies. I am told that it's something that will be worked on and week after week the issues continue. However, I feel I am held to a much higher standard than my peers, due to the work level I have always accomplished. I am told to work more efficiently or to change what I am doing(even when it is exactly what my job calls for doing at that moment), while watching other employees next to me not be directed to do the same. It leads to me feeling like I am held to a much different standard which is completely unfair and inappropriate.","Our team rocks.","Pretty similar to most things I’ve said in previous sections, but I just really wish everyone was held to the same standard and actually PUSHED to be better. People keep getting away with being extremely lazy, which makes the others job way harder than it needs to be. It doesn’t feel like respect at all. I work hard so that my coworkers can be as comfortable as possible, but rarely is that reciprocated.","some of the times changes help some of the time not so much","I work in a great team.  Couldn't be happier.","Front-End productivity is a bit less tangible than the other departments. Our ultimate goal is to sell the items and close the store. Productivity beyond that can look like any number of things. I think it can be incredibly mentally taxing to adopt an \"always stay moving\" mentality with a department that feels the full physical and social force of under-staffing of growing crowds. There is no compromise with our work, moments to breathe are important.","The front is only functional because a lot the cashiers and supervisors give so much extra every day.","Within my department there are varying degrees of tenure within their roles which can be difficult to navigate as a newer member.  I have only recently begun to feel more comfortable being myself and expressing my opinions (in my own way) in my department.  A large part of this is not reflective of the actions of others within the department, but more trying to navigate a new role without a guide book to follow.  It is important to me to have connections with those in my department to know we are working toward the same goals and have each others back.  I have had minimal opportunity for such casual interactions with my department.\nIt is often difficult to introduce new ideas within my department, as I feel some are not willing to modify operations or structure to explore alternatives.  I feel we operate very differently and are not cohesive in our goals.","I am a bit newer to the department, so I don't have the best grasp of everything. I feel like it's good, but sometimes, I feel a little left out since some people have been in it for a good amount of time and really know each other. I know that will pass, though. I can tell the team is always looking for ways to improve productivity. I feel like team meetings help figure out the bigger goals, and that's good to have a clear idea of where the team is going.","On the topic of productivity: to be honest, often I can barely keep up. The comment I hear most frequently from teammates (especially during periods of high retail activity) is \"I feel overwhelmed.\" Even if the physical demands are manageable, the work can be mentally and emotionally exhausting.","I think there could be more cohesion and ability to share and create new things together as departments. Some managers feel unwilling or like collaboration throws their flow off entirely.","The dish pits work load is out of the dish pits control. so efficiency is a matter of survival.","I work well toward clear goals, but often feel it's up to me to set my own goals. That has developed my long-term planning skills, but defining goals feels beyond my pay rate.","Rory is not always clear about identifying action items in meetings and assigning responsibility for those items. It feels like there's an assumption that someone else will take care of it. We do (take care of it), but it's his role to either handle some of it or at least delegate.","Operations tend to go well for the most part. It is important for all of us to be on the same page and I'm finding that to be lacking from certain management and staff. Ex. Certain people really want recipes and instructions catered for just them. This is not realistic or even effective.","Department expectations and standards are generally upheld by most employees, however accountability for those doing a sub-par job is occasionally lacking.  Some employees simply need to do better and should be told as much.","I have a lot of trust and confidence in my coworkers and manager to support me and help each other out when necessary!","We are working toward improving efficiency and communication. We have probably too many changes in too short a time based on the request of upper management and it's been a bit hard to coordinate it seems. They are working hard to make it more balanced. We're getting there. Also, one of the biggest issues has been supply chain issues or sometimes not having the ingredients we need. Not something we always have control of.","It is my opinion that we are currently struggling to work together as a management team in a balanced and effective way.","Our group of managers works well together, but I think we could be more productive and efficient in our time together. We tend to go over the same topics and sometimes have more people in the room for topics that don't concern them. I'd love to see us have fewer but more effective meetings in general.","Our department is often in a position where we can't not work efficiently.  If we did, we would sink and drag the whole store down with us."]},{"Question":"58. Comments about People & Culture practices?","Comments":["They tend to take the side of management instead of being impartial or looking out for workers first. This makes it feel like the best way to resolve conflict is to go directly to management instead of wasting your time with the middleman/lap dogs.","I am unsure what the entire process of what I should do in case I need to report incidents of discrimination and harassment at work. In addition to this, I'm not sure what is considered discrimination / harassment in some circumstances.","This is the most inclusive and mental health positive workplace I've ever had the privilege of having a job at.","I get on well and feel respected by most of my coworkers, but genuinely often feel doubts about how protected I would actually be as a trans person if push comes to shove.","i aint crossed path too oft with the Peoples and Culture lot, but when i have, not a single squall nor sour word has passed between us, only offering aid where they could","Complete waste of money.  Let's get this clear, it's just a made up name for HR","just say ur HR like","I've been yelled at before at the COOP and belittled by an older Coworker and got told my area is lazy, beacuse he give us stuff we werent supposed to deal with/wash, defeinlty nourves and didnt know who to tell about it, finaly told my manger what happened and he said hed have a talk with the other persons manger","As many people in this country, I do not wholly trust the HR/ People and Culture department. Changing your name to People and Culture does not make me feel that you are here for the employees, only that you are trying to move away from the image employees have of an HR dept. in their heads. I feel that they are very far removed from the true day to day tasks of what happens downstairs. The folks upstairs spend time and money coming up with a new title for their department, while those downstairs get lectured about time theft in an all-hands meeting, with no real explanation of what that is. We all worry about getting in trouble for taking a brief break to socialize or stretch and have no clear image of what is expected of the office departments who have much more flexibility than we do.","I think the co-op will respond appropriately to workplace harassment between employees. But microaggressions from customers I think are harder to deal with. But I haven't seen or heard of of the co-op dealing with those effectively, but I have heard of them significantly bothering some of my coworkers. I don't know the best way to deal with them, but I think it's an area for improvement.","When the name changed, I thought it was indicative of more than just rebranding. But it's not yet clear to me that it's anything other than a name change.","One of my coworkers has been dealing with a lot of misgendering and transphobia, which is not cool. I’m not sure if any action has been taken on it, granted it is not my business but I do care a lot about my coworkers and their safety, but the coworker that has been causing said problems continues to misgender them to other employees, so I don’t really understand why he’s still working here if the co op stands so strongly against it","P+C has turned a blind eye to homophobic and transphobic discrimination in the past and I do not have faith that they have changed for the better.","pretty good overall","Similar to what I said before, I haven't had the most respectful experiences with HR (or People & Culture). Partially my own experience has made me feel negatively towards HR, but I have also heard a lot of my coworkers talk about their own bad experiences. I don't go to HR for conflict anymore, I usually go to a manager.","I think it is worth remembering that this job is different for those who belong to different identity groups. Women receive much more harassment than men, and people of color deal with almost constant microaggressions from customers who don't know how to correctly communicate with a human cashier. When considering why someone might not be coming to work, consider the environmental factors that might make the thought of working completely exhausting, don't just threaten to fire people. This job is difficult for me, I cant imagine how difficult it must be for others.","The People & Culture team and our practices are the best I have experienced in my career for being clear, firm, fair and appropriate.","I think it's good. I mean, there is always someone there if you have a question, and they take the time to check in. I feel like People and Culture should try to make a stronger presence, you know, to really make people feel safe that they can come and talk.","It is really nice to work in a place that values and upholds such practices of equality.","the coop can get a little defensive when such a problem arises that puts them in a bad light","Our people & culture team is one of the best run teams in the entire co-op. I have immense respect for Michelle, Lori, Nicki, and Shannon.","Complaints taken to HR seem to be automatically dismissed/HR is very defensive of high level employees/managers.","In my experience, People & Culture really pick and choose when to apply policies. They are fairly inconsistent in their applications of our \"rules\"","There is no consistency between how P&C treats one employee vs another. Some people are kept on long past what would have been a firing offense on another employee. It is a hard and uncomfortable feeling to have your employment depend on how much someone in P&C likes you.","I think there is a disconnect between people and culture and the lived experience of most staff, largely due to economic differences.","I do not feel comfortable reporting things to People & Culture. Many times, I have observed that they handle situations poorly and meet feedback with defensiveness.","The safety and security of staff has always been a high priority here, and I appreciate that. Things may not always been addressed as swiftly as some people would like, but I do feel that the managers legitimately care. Staff are encouraged to speak up if they are being treated poorly by customers or other staff.","This is taken very seriously here. Nothing is dismissed without a thorough examination.","Doin great!"]},{"Question":"67. Comments on training and development?","Comments":["Check ins are too frequent, especially in the beginning of employment. These could be limited to a form filled out by manager and emailed to employee to sign and return. No need for manager to read the form to me.","It's a grocery job, it takes a certain type of person to find meaning, growth, and engagement here. If you don't have that disposition, then there is little meaningful development.","I feel like department traning is good for the most part I feel the department struggles with the development of staff additional traning get pushed off and not done .ie deep cleaning, checking in trucks. Leading to cleaning not being done, and things not geting checked in in a timely manner","For question #61: I've found on-the-job training to only be effective at preparing me for my job if the training itself is both detailed and covers all of the demands of the job. So, while I do think on-the-job training is in theory effective, it differs depending on what is taught.","Job check-ins are very helpful!","Every other food service position I've been in didn't train and pretty much just threw me into the job like a baptism by fire, I appreciate how thorough the training is here.","Check-in results seem more generalized for the department as a whole rather than specific to each individual employee and what they need to work on.  I think the training worked well for me as someone with prior grocery/produce experience, but clearly is lacking for others in the department who still do not understand basic knowledge and procedures even after months in the department.","Since I've the knowledge of me ship up to tha crows nest, itd be right clever ta nab the chance ta swindle some new skills, such as with Excel, savvy?","I value being able to have check ins especially because some shifts I don't have an opportunity to do so.","I think its good and prepares people for the job","I unfortunately need to carry around a copy of my job description in my pocket because, while it is clear to me, my manager often tells me that various tasks are within my job description, such as learning a new task in another department or being treated as a supervisor and delegating tasks, when that is completely untrue. I would assume a manager needs to know the job descriptions of the employees and if they don't they should look it up before making assumptions and trying to force more work onto an employee. It is deeply uncomfortable that I feel the need to keep my job description on me at all times and have had to use it.","I would love more cross-training. While I am here infrequently now, when I am here, I am often the last one out the door, so I would love to know more in case there are things to troubleshoot. We all forget to do things before we leave and sometimes that accumulation is a lot for one person to handle alone late at night.","I’m not sure how my coworkers are being trained since I was trained 3 years ago now, but there’s something different happening with the training that I can see through their work ethic. My managers have said they want me to start training new folks that work here (my hours were cut during school upon my request which is why I haven’t been working enough to train) so I’m really really hoping I can start to close that gap between work ethic across the department","when an employee is given more tasks one should be compensated.","I think some shifts could use more than 3 training days","At some point, check-ins just kinda become a bit of a pointless bi-annual stress. I scan and sell items. I talk to people. I enjoy my time. I don't necessarily want it to be any deeper than that. I haven't had new goals as a cashier since my second check-in, and I feel pressured to create new goals with each subsequent check-in when I'm already feeling comfortable and confident in my work.","Check-ins are not useful","I think the biggest opportunity we have as an organization is to improve our Training programs.  While we may have operational training that gets the job done enough - it covers the tasks of a person's day, I feel we should work on improving our overall training for staff and leadership.  Relying on the department managers to provide an overall, complete training of our organization and the \"finer points\" to the Coop is not enough, IMO.  Development of a Training Department should be considered.","I don't think there is a big training/development program or one that helps people get the skills they need to grow. I feel like I applied to loads of positions, and I wasn't given a fair opportunity because I didn't have all the skills. And they would hire someone else who would last like 2/3 months, and it was super frustrating. And even in my new role, I feel like I am on a thread because I don't have the skills, and I'm starting at the bottom. But you've got to start somewhere. I feel like sometimes they would push me into things because that's where they say I fit, not my own goal.","I think formal check ins are less useful for department managers as you are constantly assessing your goals and where you are at with your manager.","There is a narrow difference between what a manager and assistant manager does here. I'm very happy in my rather difficult position, but only because I'm passionate about moving up in the co-op, and earning enough money to live in Bozeman.","As managers, we now write our check-in goals ourselves for approval. This greatly helped make them clear.","Check-ins for long term employees feel less and less useful or neccesary.","You have to write something as feedback for staff and I've found that some feedback I've received to be rather tone deaf. Ex. At one point my department was overproducing and expecting one staff member to be doing two peoples jobs. When this issue was brought up, the feedback that was reciprocated was \"You need to step up\" 'Stop being negative\" When it was literally too much product to process in the given shift and I tried to problem solve with management to no avail at the time.","Staff training should be an ongoing process and continue to occur after the initial on-boarding.","I've had the experience multiple times of training new staff while understaffed and because of this, not being able to give new employees the time and attention to feel confident in their ability to perform their role.","From my experience, the training in my particular department is chaotic. There has been an issue in the past with new employees learning too many new things at once, and not being given adequate time or check-ins to make sure they feel fully assimilated into their complicated roles. It has often been rushed and not very organized, with complaints from the new staff about training needs not really addressed by their manager.","Check-ins are very useful and I appreciate how they tie in what's happening at the management level and apply them to staff so we can all share a common goal.","As far as training I do a lot of training new folks. It seems like we have a varying degree of experience and that does require differing training skills. Sometimes we do hire folks that just aren't the right fit. I do think when that is the case management goes a long way to try and help the new hire get on board. A few times it has felt like a challenging fit has been kept a bit too long.","I really appreciate that the check-ins aren't just a list of everything someone needs to work on, but is both an acknowledgement of the good things going on in my work, as well as attainable and reasonable goals to work towards. There's also an understanding that not every goal will get accomplished, and that neither diminishes the importance of those goals nor the value of work done as long as one is doing their job well.","I would say our dept. may need more training days for people with little experience. Or there should be the expectation that training continues on beyond the first three or four official training days.","Again, the succession guides will be helpful with management job duties"]},{"Question":"79. Comments about supervision?","Comments":["My management team of mangers and assistant managers are some of the best I've ever worked with.","Too many check ins, not useful. Need more inter-department communication.","I have no particular praise or disparagement for my manager. They do a good job.","Not every one is held to the same standards making other who are held to the higher stander have to pick up the slak  for other employees.  When talking to manger we are often brushed off or given an excuse for why those employees are not held to the same standard, it makes it hard to go to them for problems when action is hardly taken","For question #68: Top down communication in the produce department could definitely be improved. My manager is very prompt at letting me know what expectations have changed while working together. But when a department expectation has changed, it often isn't dispersed using any of our communication resources.","MANAGER ALWAYS WANT TO SEND PRODUCT TO KITCHEN INSTEAD OF SHRINKING IT OUT","none at all Garrison is the goat.","We have been having continuous performance problems with specific people for months, creating a divide between the employees who are skirting by and the employees who are picking up the slack to make sure everything gets done and the department looks good for customers.  For months multiple people have brought these concerns up the our assistant manager, who in turn seems to have kept the information to himself and not acted on it.  I was always talking with our assistant manager because I saw him and interacted with him more regularly.  Now that I know concerns were not passed on, I have started actively seeking out our manager, but this can frankly be difficult and time consuming. I also find Steve to be less intimidating than others do and have an easier time speaking freely with him. But without being directly told, both managers seem oblivious to any issues in the department, there is no real individualized feedback (positive or negative) within the department except the occasional \"thanks\" for doing a task that is literally just part of the job, but others tend to avoid or neglect doing.","I've no quarrel with the captains orders or course set for the ship.","Jill and Sarah are doing a great job in the bakery with new recipes and managing of employees.","great but the above management no","Hes super good and helpful stays up with everything and is super condirate of peoples time and there lives outside work","I feel that issues in my dept are not addressed at all. At most they are written on a white board which is then ignored by most employees. I have watched numerous employees repeatedly show up late, not do any work, generally goof around and not be disciplined in any way. While I am held to a much, much different standard based on how I have been treated by the manager. Anytime I help someone of another department, I feel that I am going to get in trouble from my manager because it is not within our department, even if it is not taking away from my work at all. And I believe working at a co-op means cooperating with other departments to make sure everything is running smoothly. I feel that many decisions made are unfair by my manager. I would consider the approach a \"throw it at the wall and see what sticks.\" I am constantly having to defend my schedule, why I do the tasks I do (which have been consistent since I began my role) and what I choose to do when. It would be nice to have a week go by where my manager is not trying to force myself or someone else into a schedule change that they never agreed to, because that puts us in the uncomfortable position of constantly having to defend ourselves. No one wants to come to work wondering if they are going to randomly be told they should change their schedule yet again.","The co-op is EXTREMELY lucky to have Shiloh.","There is not a manager during the evening, so there’s a notion that night crew can get away with less than the bare minimum. Morning crew is held to a higher standard due to this, which is fine, I like leaving the store feeling good about my work, so I’d do that regardless, but I think there either needs to be a manager that stays later or some sort of night supervisor","really hard to find a manger some of the time","I have no complaints.  Very happy with my manager and the managers of the Co-op in general.  They care about their employees as people, not just numbers.  I feel valued and respected.  This helps create loyalty to the Co=op.  I feel very lucky to work at such a great place.","I just scan and sell items.","I find the communication and relationship with my manager to be effective and helpful.  We are able to address problems, find solutions and progress effectively.  I appreciate their ability to let me work independently and make my own decisions, however they are always available when assistance is needed.  I also appreciate their honesty and willingness to explore new ideas and remain focused on personal development.  I often feel energized when discussing goals and priorities.","Overall, the manager is good. I think hearing that I'm doing a good job, mostly being in a new role, I need that affirmation more often, not just in check-ins. I feel like they are good with telling me what my goals are and figuring out how I can achieve them.","I would do anything for my manager, because she would do anything for me.","I feel like I have to actively seek feedback. Re: positive attitude, this feels like it's improving, but there were some blowups in the past year. Consistency is needed to fully restore trust.","I've gotten very odd feedback from asst. management of \"You need to be more mean to staff\" \"I'm not in the room when this happened, so I don't know, but you need to put your foot down more\" It is as if certain management doesn't understand that some staff just will not listen despite utilizing all of the tools you have available to you and being very clear and direct.","I don't have much perspective on how effective I am in my role, and specific metrics (sales, waste numbers, etc) that are able to be shared would help me better understand my departments performance and how I can improve those metrics.","I have had difficulties bringing important, difficult conversations to my manager. They have been defensive and dismissive of my concerns before, and have also caused me to have a panic-attack with their tone and severity of conversation that I was not expecting or prepared for. We once had a meeting where they told me that it should be easy to take concerns to any manager, it did not have to be them. I have done this, and have had much more success sharing my concerns with managers outside of my department.","Weekly meetings with my manager have proved very helpful in helping me keep focused on my goals. Even if it's only for a short few minutes.","Our direct manager is very new and was hired out of house. She's great. There is so much for her to learn but also much we can learn from her. Her being hired was a good choice. We have a ton of change. We are all committed to learning new skills and when the production list is too long there is the opportunity for adjustment. That is much appriciated.","I work in several depts however, my scan manager is as amazing as can be. She is very approachable and listens to any concerns I have. My job duties are clearer defined and she gives me opportunity to help in other ways. My Front end manager is also amazing. Brody is doing an amazing job.","Check-ins, regular meetings, and am ongoing text thread keep us all working together and focused.  We manage priorities/emergencies well and plan projects.","Pat's awesome"]},{"Question":"88. Comments about job satisfaction?","Comments":["Appreciation for consistently going above and beyond should be recognized with merit based wage increases in addition to yearly guaranteed raises that anyone, regardless of work ethic or value of employment, receives.","OVERALL I LOVE COOP CONCEPT AND COOP HAS SOME OF BEST CUSTOMERS IVE EVER SERVED THEY ARE SO APPRICIATIVE OF ANY EFFORT OF CUSTOMER SERVICE BUT I STILL HAVE A FEELING OF UNCERTAINY HERE BUT HAVE NOT RESOLVED IT WITHIN MYSELF BUT WANTING AND HOPING TO COOP HAS SO MANY GREAT QUALITIES","I am definitely starting to feel more taken for granted than valued in my department.  I know I am a major contributor to keeping the department up and running smoothly, but it sucks that basic work expectations are not being evenly upheld for all employees with some doing far more of the work than others.","Me work keeps me hooked, especially while brewing up somethin new","My job here at the co-op has been, by far, the best job I have held. I love and look forward to coming to work, have built relationships with coworkers, and learned valuable skills beyond the workplace!","Not much recognition for doing an excellent job. Regardless of whether you choose to go above and beyond or just to fill the basic requirements, the level of recognition is about the same. Would really like to see great work recognized and encouraged, and consistent improvement in our department rather than remaining in mediocrity/just making ends meet.\n\nLove working at the Co-op but I do work very hard and it would be nice if that was noticed by someone other than myself and my customers. As it stands, it can feel like I perform the same job working twice as hard for the same level of pay and recognition. If our organization really wants to foster a culture of improvement and growth, then good work needs to be recognized and legitimized in some tangible way, whether for individuals or team-wide.","As stated before, the tedious web of upper management makes the job difficult at times","I just wanna be able to afford the cost of living here man idk","I think wokring at the COOP is very intresring and you get to meet a lot of new people well wokring here, I don't really like talking about wokring about the COOP outside of it beaucse of its repution for more hipes and LGBTQ+ cummunity which doesnt really hit my demographic and shouldnt feel focused towards just that cummunity and should feel more open to everyone","Overall, I enjoy my time here and the role I have is a good fit for my personality. There are a lot of things I would personally change about management/ upper management but the grass is always greener, right? My experiences here far exceed other jobs I have had and I feel more comfortable here pushing back on issues I have than I ever have. I would prefer not to have to do it as often as I do, but so far it has not led to any issues between myself and my manager so that is why I stay.","overall mostly okay with everything but things could be improved","It's fun here. As long as I am having fun, I will like working here. Sometimes it's just a job. Sometimes it's the best part of my day. I'm okay with it becoming just a job, but I'd rather it didn't.","I am overall very satisfied in my role at the Coop.  As with any job, good days and bad happen, however I appreciate the space to work through challenges and find solutions.  Any dissatisfaction or struggle within my role stems from 1) challenges with embracing change management 2) lack of connectedness between others in the department 3) frustration due to lack of cohesion within the two operational divisions (Food Service & Retail Operations)","I have been here for about 5 years(they only have 3 years since I left for 3 months). I have really enjoyed my time here. I feel like it's given me more of a purpose, I feel like it's helped me figure out my bigger goals. I really love my co-workers who have turned into friends. I dont think there is another place i would want to work.,","Question 83: This job is more than satisfactory for me. The culture we have here alone is a huge reason for that. I've worked in just about every work environment you can think of from the good to the toxic and it's quite nice to be able to come to work and just feel good. I'm forever grateful to have landed this job and to be experiencing it with great people, thank you :)","I feel that working on continuous improvement is seen as a burden or a change in values by some staff. Work improvement discussions can come off as saying \"i'm not doing a good job\". I'm not sure if it is Co-op related or just job related, but I think folks should look to celebrate and improve what we do well or weaknesses without a sensitivity to those conversations.","I came form a \"hard\" workplace before this. When I started, I thought I was about to get jumped, because everyone was being very nice at the same time. Took me a few weeks to realize folks were just legit chill here.","We are always \"striving for continuous improvement\" but I don't relate to the measuring stick of \"improvement\". I don't want a third store, I want member-owner dividends to return. \nThat is my personal measuring stick of a healthy co-op.","Acknowledgment goes a long way for me and that doesn't really happen. Certain management tends to focus on negativity and this overshadows some of the more positive aspects of our jobs.","Go us!","I love my job. More now than ever. Our new GM has been great. He's been with us about a year now. Super nice person. Love the snack shack. He can think outside the box.","I love this place, and I've been treated very well during all the years I've worked here. I feel legitimately valued, and have never been made to feel expendable or unappreciated. I appreciate our support of our local community, and our commitment to celebrating people from all backgrounds, honoring people as they are today and respecting those who are going through personal journeys of all sorts. Had I not worked here, I would not have had the opportunity to get to know such a wide variety of people, and I am a better person for it. I could be making more money somewhere else, but I'd rather have the security and satisfaction I have here than to deal with the stress and politics and impersonal treatment that would likely come with another employer.","Best placed I've worked at in over 20 years.","I know business has to business, but at what point is enough enough? It's okay to not grow. As long as the business works, it doesn't always have to be about a growth mindset. I think the co-op needs to take some time to focus on herself and not always be pushing."]},{"Question":"93. If you chose \"other\" above, please note","Comments":["Arrrgh I be a Pirate","Ukrainian"]}],"results":{"Overall":{"response":"The survey comments reveal a complex and often contradictory employee experience at the Co-op. While many employees express profound appreciation for the Co-op's strong values, inclusive culture, positive coworker relationships, and particularly its exceptional benefits package (including 100% paid health insurance, 401k, staff discounts, and the snack shack), these positives are frequently overshadowed by significant and widespread frustrations. \n\nKey areas of concern include deep distrust in upper management and the People & Culture (HR) department, perceived as biased, dismissive, and inconsistent in addressing employee issues and accountability. Communication breakdowns, especially between departments and locations, are reported as chronic, leading to inefficiencies and a lack of organizational cohesion. Employees also voice strong dissatisfaction with compensation, feeling that wages do not adequately meet the high cost of living in Bozeman, and there is a pervasive desire for merit-based raises to reward high performance. Furthermore, training programs are often described as inadequate or chaotic, hindering professional development and contributing to a feeling of being undervalued and overworked when standards are inconsistently applied. The feedback suggests a critical need for the Co-op to bridge the gap between its stated values and its day-to-day operational realities, particularly in management practices, communication, compensation, and staff development, to ensure a truly equitable and supportive work environment.","sentiment":-0.09},"Question 10":{"Sentiment":[0.8,-0.95,0.95,0.7,-0.1,0.85,0,0.2,-0.75,0.7,0,1,0.9,-0.15,0,0.75,-0.8,-0.6,-0.5,-0.7,-0.9,-0.4,-0.65,-0.2,-0.6,-0.15,0.1,0,0.25,0.8,0.5,-0.6,-0.9,-0.9,-0.4,0.95,0.98,0.3,-0.1,0],"Highlights":["Many employees express a strong positive perception of the Co-op's dedication to diversity, inclusion, and creating an accepting workplace environment.","A significant and recurring concern is the perceived inconsistency between the Co-op's stated 'Ends' and its actual practices, particularly regarding the fair treatment and support of marginalized (BIPOC, queer/trans, differently-abled, mental health) employees, and the overall dignity of workers.","Critiques are raised regarding the Co-op's sustainability practices (e.g., global sourcing, non-recyclable packaging), high pricing that limits accessibility, and product selection (e.g., 'junk food' vs. local/sustainable options)."]},"Question 20":{"Sentiment":[0.95,0.3,0.7,-0.4,0.7,-0.5,-0.9,0.9,0,0.05,-0.85,0.6,0.75,-0.7,-0.5,-0.6,-0.9,0.9,0,0.8,-0.85,-0.7,-0.4,0.98,-0.5,-0.8,-0.75,0,-0.9,-0.2,-0.3,0.1,-0.6,-0.85,0.7,0.6,-0.1,-0.5,0.2,0.75,-0.4,-0.95,-0.98,-0.6,-0.98,-0.5,-0.4,-0.1,0.9,0.95,-0.7,-0.8,0.3,-0.4,0,0.6],"Highlights":["Employees express strong praise and trust for their direct managers, citing support, listening skills, and positive interactions; however, there is deep and widespread distrust in upper management and the People & Culture (HR) department, frequently accused of dismissiveness, lack of empathy, and poor handling of serious employee issues.","A pervasive negative theme is the perceived inconsistency and leniency in applying corrective action, leading to frustration among diligent employees who feel unfairly burdened by underperforming colleagues.","Concerns are raised about the Co-op's perceived 'corporate style direction,' prioritizing business over employee longevity, and a perceived failure to consistently protect marginalized employees, along with regressive policy changes like dress codes."]},"Question 27":{"Sentiment":[0.9,-0.3,-0.5,0.8,-0.6,-0.7,0.7,-0.4,-0.8,0.9,0.5,-0.1,0.85,-0.9,0.2,0,0.75,-0.7,0.4,0,0.6,-0.85,-0.8,0.7,-0.2,0.5,-0.95,0,0.7,-0.5,-0.6,-0.9,0.6,-0.8,0.7,-0.4,-0.1,-0.95,-0.7,-0.8,0.2,0.9,-0.4,0.3,-0.85,-0.5,-0.4],"Highlights":["A critical and dominant theme is the severe lack of effective communication, particularly between different store locations (CWM and CDT) and across departments, leading to information gaps, operational inefficiencies, and a general feeling of disconnection.","Employees report inconsistent and often ineffective manager-employee communication, with ineffective check-ins, dismissed suggestions, and a reluctance to raise serious issues due to perceived lack of follow-through from management.","Concerns are raised about a lack of psychological safety for expressing differing opinions, systemic hurdles to communication, and a 'blame game' among managers rather than active problem-solving and accountability for communication breakdowns."]},"Question 34":{"Sentiment":[0.9,-0.9,-0.98,0.7,-0.4,0.1,-0.6,0.9,0.9,-0.5,0,-0.2,-0.7,-0.8,0.9,0.3,0.98,-0.6,0.7,-0.1,0.3,0,0.4,0,0.8,-0.8,-0.95,-0.6,0,0.1,0.9,0,0,0.7,0.4,-0.8,0.75,-0.9,0.1,0.7,0,-0.2,0.9,-0.7,0.98,0.7,0.4,-0.7],"Highlights":["Employees overwhelmingly praise the Co-op's outstanding benefits package, including 100% covered health, dental, and vision insurance, 401k, staff discount, and snack shack, often citing them as superior to other employers.","A dominant and deeply negative theme is that wages are insufficient to meet the high cost of living in Bozeman, with many employees reporting financial strain, living paycheck-to-paycheck, and feeling unfairly compensated.","There is widespread criticism of the current compensation model's reliance on tenure-based raises and a strong desire for the introduction of merit-based raises and pay differentiation for added responsibility/leadership to incentivize high performance."]},"Question 42":{"Sentiment":[0.6,-0.7,-0.6,-0.7,0,0.2,-0.75,0.6,-0.7,0,-0.1,-0.9,0.1,-0.98,-0.9,0.98,-0.6,-0.3,-0.95,0,-0.9,0.7,-0.98,-0.7,0.7,0.1,-0.5,-0.3,0.9,-0.5,-0.6,-0.5],"Highlights":["A systemic and pervasive issue is the critical lack of communication between departments and store locations, leading to inefficiencies, wasted resources, animosity, and a fragmented organizational structure.","Significant concerns are raised regarding cleanliness and safety, particularly in the Produce department (mold, lack of cleaning regimen), crowded working conditions causing injuries, an unsafe parking lot, and food service kitchen safety concerns being unaddressed.","Employees report inadequate tools, outdated technology, and insufficient access to critical information and support, which contributes to inefficiency and frustration in daily operations."]},"Question 51":{"Sentiment":[0.9,0.8,0.7,-0.98,-0.6,0,0.2,-0.99,0.98,0.9,-0.2,-0.75,-0.9,-0.6,-0.99,0.9,-0.95,0,0.9,-0.2,-0.5,-0.9,0.2,-0.7,-0.6,-0.2,-0.3,-0.5,-0.2,-0.6,0.95,0.1,-0.6,-0.2,0.1],"Highlights":["A deeply negative and frequently recurring theme is the widespread inconsistency in performance standards and a lack of accountability, leading to frustration as diligent employees are forced to 'pick up the slack' for underperforming colleagues, particularly in the Produce department.","Comments highlight significant internal communication gaps within departments, with unaddressed concerns and ignored suggestions, coupled with resistance from some management to new ideas and operational changes, hindering efficiency and innovation.","Employees frequently report feeling overwhelmed and mentally/emotionally exhausted due to high workloads, understaffing (especially in front-end and support roles), and the pressure to maintain operations despite systemic inefficiencies and uncertainty around critical hiring decisions."]},"Question 58":{"Sentiment":[-0.95,-0.5,0.98,-0.4,0.7,-0.9,-0.1,-0.6,-0.98,-0.2,-0.1,-0.98,-0.98,0.6,-0.9,-0.9,0.98,0.2,0.8,-0.5,0.98,-0.95,-0.9,-0.98,-0.6,-0.98,0.5,0.9,0.6],"Highlights":["An overwhelming and consistent theme is a deep distrust of the People & Culture (HR) department, perceived as biased towards management, lacking impartiality, disingenuous in its rebranding, disconnected from floor staff's reality, and defensive when confronted with issues.","Multiple comments accuse P&C of significant inconsistency in policy application, showing favoritism, and failing to effectively address serious concerns such as misgendering, transphobia, homophobia, and microaggressions, leading to feelings of insecurity and lack of protection for marginalized staff.","Despite the deep distrust in specific P&C practices, some employees still laud the Co-op as a generally inclusive and mental health-positive workplace, valuing its stated practices of equality, though often with caveats about actual protection when serious issues arise."]},"Question 67":{"Sentiment":[-0.3,0,-0.4,0,0.7,0.9,-0.3,0.7,0.7,0.6,-0.98,-0.4,-0.2,-0.4,-0.3,-0.6,-0.5,-0.9,-0.95,-0.1,0.2,0.7,-0.4,-0.98,0.2,-0.6,-0.9,0.75,-0.1,0.9,-0.4,0.5],"Highlights":["There is a strong and consistent demand for improved, standardized, and continuous training programs, as current methods are often described as chaotic, rushed, insufficient, and lacking in detail, especially for new or inexperienced staff.","Employees express frustration with ineffective, overly generalized, or 'tone-deaf' check-ins and feedback, reporting instances where valid concerns are dismissed or managers misrepresent job duties, leading to discomfort and feelings of being unheeded.","A lack of clear opportunities for growth, cross-training, and skill development is noted, with internal candidates feeling overlooked for promotions due to perceived skill gaps, indicating a need for more robust career development pathways."]},"Question 79":{"Sentiment":[0.95,-0.5,0.3,-0.98,-0.2,-0.1,0.9,-0.99,0.7,0.9,0.1,0.9,-0.99,0.98,-0.7,-0.5,0.98,0,0.99,0.6,0.98,-0.2,-0.8,-0.4,-0.99,0.75,0.9,0.99,0.8,0.9],"Highlights":["A significant disparity exists in employee experiences with supervision, ranging from extremely positive and supportive relationships with direct managers to deeply negative, even traumatic, encounters with supervisors perceived as defensive, dismissive, unfair, or causing distress.","A dominant negative theme is the widespread failure of some managers to hold all employees to the same performance standards, leading to a 'divide' within departments where diligent staff are forced to 'pick up the slack' for underperforming, undisciplined colleagues.","Communication breakdowns are frequently cited, with some managers criticized for poor top-down communication, not acting on employee concerns (or being 'oblivious' to them), and being difficult to find or engage with, especially during evening shifts, leaving employees feeling unheard and unsupported."]},"Question 88":{"Sentiment":[-0.7,0.5,-0.9,0.7,0.98,-0.95,-0.5,-0.95,-0.2,0.3,-0.1,0.2,0.4,0.99,0.99,-0.6,0.9,-0.4,-0.7,0.5,0.98,1,0.98,-0.4],"Highlights":["Many employees express high overall job satisfaction, often citing a positive, 'chill' culture, strong coworker relationships, a sense of purpose, and alignment with Co-op values as primary drivers, with some choosing satisfaction and security over higher pay elsewhere.","A prominent source of dissatisfaction is the perceived lack of recognition and merit-based rewards for hard work and exceeding expectations, which de-incentivizes high performance and makes employees feel undervalued, potentially hindering a culture of continuous improvement.","The inability to afford the high cost of living in Bozeman on Co-op wages remains a deeply negative undercurrent, significantly impacting job satisfaction, coupled with a critique of the Co-op's continuous 'growth mindset' over stability or member-owner dividends."]},"Question 93":{"Sentiment":[0,0],"Highlights":["The comments demonstrate respondents feeling comfortable enough to include personal, non-survey-related, or humorous self-identifications, showcasing a diverse range of individual expression.","Unlike other survey sections, this category did not yield substantive feedback or critical commentary regarding Co-op operations, management practices, or workplace culture.","The nature of these 'other' comments highlights the function of open-ended survey options in capturing unique, unexpected, or personally specific responses that fall outside the typical scope of operational or sentiment-driven feedback."]}}}