{"comments":[{"Question":"7. Comments about Co-op Values?","Comments":["They have a high level of standards and it shows","The co-op's stated values are not usually represented in day to day operations. Working at the co-op doesn't feel any different than my previous experiences working for conventional grocery stores. There's a vast disconnect between admin staff and store staff that creates a very corporate feel.","\"1. A thriving, just, and sustainable local food economy \n\n2. A source of healthy, nutritious, affordable food, and water \" \nI don't understand how GMO's, preservatives and food dyes are supported with these statements. We provide foods for all and we aren't a privately owned company - but do our owners support our shelving GMO's?","Could be better for disabled people but not the worst out there. Incidents in the past make it seem like allyship is performative, but this year we seem to be doing okay.","Upper management is definetly out of touch with the inner workings of the store. They are not efficiently running the store, in fact I would say since renovation, day-to-day work flow has become more difficult. Also, it is not very democratic and definitly not inclusive. Uppermanagement is a united front of cronies and they only listen to and respect each others' ideas. They say they are transparent but we never got the results from last year's worker survey! We've asked plenty of times to see the results but they just keep playing dumb. I appreciate honesty and we don't always get that here. Don't they have to publish the results? We would all like to know.","It brings me joy to work in an environment that totally supports diversity in all of it's manifestations.","Grateful for the Coop's more evolved culture.","The Belfast Community Co-op Grocery department has a great team spirit and encouraging, cooperative members as its staff.","I believe leadership works to uphold these values in their decisions. The lines get blurry when someone has a viewpoint that is a bit more controversial, or perhaps of a different political persuasion than most of the Co-op staff. Upholding the values of diversity can run against that view point and create the feeling that that individuals view point in acceptable/honored. As someone who's had to work with previously employed staff carrying such viewpoints, I wasn't really given language or guidance on how to deal with that incongruent situation. \n\nThis is a very limited example, only a handful over the years I've been here. That said, it has created sticking points in the past. I think the Co-op upholding their stance for the great good of the community is applause worthy.","I do believe the Co-op is a great place to buy local goods to help our fellow farmers and business owners in the area. I, however, entirely disagree with the reasonably priced side of it unless you are able to utilize the Farm Fresh rewards program (which I really really love by the way). I understand the wholesale costs are going up and it is not in the buyers' power to change that, but I do believe margins are way too high and making the price of many items unreasonable, especially when I can go to Hannaford or the local farmer's market and get the same thing for much less.","Principles 1 & 2 are well implemented. Principles 3, 4 & 5 are sorely absent from our work and in need of more attention.","While I think the co-op since changing operations managers has done much better in adhering to co-op values, there is still some space to be bridged.","I believe that we could do more to promote why the food we sell is healthy, who benefits from what our patrons buy and how the money stays in the community. It's very easy to say we value diversity in a community strictly comprised of white wealthy people. We could \"Do More Good\" by actively partnering or possibly sponsoring local indigenous and other ethnic communities in the area. Then there is the board of Directors... What is needed is to make engagement in this Democratic system obtainable for folks who work hard to support them selves and there families. That looks like meeting times and obligations that fit in with the schedules and needs of people who do not have inherent privilege. The Board should also be tailored to make it more accessible to Co-op employees to join and have their \"feet on the ground\" voices be heard.","\"An efficiently managed\" As so often happens, uppers have passed down some REDUNDENT and sluggish tasks that clearly are non essential. It is not even noticed if they go undone","I think they are doing well in this aspect. Better than any other place I have previously worked.","I agree with question 1 and 2, but I feel that we have strayed away from \"economic &  environmental sustainability\"","I believe we value diversity,  but were a pretty white workforce.","There are a lot of people in the community who don't shop here in part because they know it's politically biased to the left.  Unfortunately it's just how the division in the country plays out.  For everyone else it seems like a welcoming place."]},{"Question":"18. Comments about Co-op Management Practices?","Comments":["For some questions I have little to no information on. I'm not aware of any co-workers' disabilities or of any corrective actions having ever taken place.","There was a lot of confusion about why and how the last kitchen manager was let go without protocols being followed. \nThere was a lot of fear for the workers being negatively affected by work conditions during construction, how to navigate their time while coming into work at that time and also for their job security. The firing of Jane Anderson really stoked these fires.\nThe co-op stayed open on days when the construction was creating unsafe air quality and debris and did not allow for time off without having to use vacation time or sick time - it was not an option. I had to use lots of vacation time to recoup from the effects of mold toxicity last year. I'm still detoxing from mold but am not requiring time off due to exhaustion.","It's hard to judge them overall as a team since some managers are great and others are lacking. I'd say most managers are fair and concerned about workers. The outliers make it difficult to see the positives sometimes.","In a small buisness the impacts of a single manager have wide reaching range of effects. I feel like sometimes there is a disconnect between operations management and the clerks, which leads to delays in pivoting away from practices that don't work well, as well as implementing flawed stratagies that could be avoided with an on the ground perspective. I am left thinking that the demand on our managers may be quite high.","There is a lot of diversity in management practices, depending on the individuals and the depts, with a lot changing over this past year.  There isn't always visibility into other dept practices, besides how people talk about things anecdotally.","I think all and all they do ok, but I think It would be nice to be nice to have the  all the Management team to brush up on the Register, and other  departments of the stores.","I believe, as someone who's used the complaint procedure, that the practice is fair and works. I believe that staff aren't comfortable using this process either out of ignorance or out of a lack of trust. My guess is it's the former, and there's just a lack of awareness about how to find the information (which is frustrating, because it's a shortcut in beekeeper and super easy to find).","Since I am commenting on the management team as a WHOLE, I will say MOST of the managers are very good at their job and a lot of us are comfortable approaching them especially where I work alongside them every day. They are extremely friendly, but they do know how to approach a serious situation when the need arises. I have seen other managers care very deeply about their staff and it is one of the things that I love most about the co-op.","I don't clearly understand how management decisions are made regarding conflict resolution, corrective action, or meeting the needs of workers (with or without disabilities).\nExample: I've asked for a certain piece of needful equipment several times and have never received a direct reply as to yes , no, maybe, soon, why or why not.","Department Managers are all awesome. Upper management/admin seem to be a potent mixture of inept and lackadaisical.","In reference to question 17 about disabilities, I have heard of some staff not getting accommodations. Specifically in consideration that stools were previously available for those staff in the front end who have mobility issues or issues standing. There is now not even room for a stool. Secondarily all positions the co-op hires for have the \"requirement of full color vision\" despite co-workers who are colorblind, and got through needing little to no accommodations.","It appears that \"lower level\" employees are under the chopping block for time attendance more than their leadership counter parts. A solution could be to adjust schedules when a trend of tardy points arise. Some days folks are sick (or contagious) for a day or two and should not need to pay out $300 to have a doctor sign that they have what the entire town has caught to be expunged of penalty points. They should also not need to miss five straight days for sickness to be forgiven at all.  I have never heard of our conflict resolution procedure. It seems that leadership gets rather persnickety when valid everyday concerns are brought up by folks operating the store. I have seen first hand how worker requests and valid ideas of acute issues are swept under the rug for months before being resolved.","Decision making seems to occur in a bubble. Management does not seem to seek input from the staff prior to making decisions, in other words there is not a pre-decision feedback/input aspect to decision making at the Coop.","there has been a lot of tension, lately, between managers","As a person with some disabilities in the workplace, I have felt I have been met with hesitance and disbelief, which makes me not always feel comfortable asking for my special needs or accommodations to be addressed. It makes things very challenging sometimes. I have tried to utilize our remote HR person, but he truly hasn't helped much and is hard to get a hold of. I have been told to soldier on before in the midst of crisis and anxiety attacks. That is no easy task and I felt invalidated.","Management is generally disengaged from the day-to-day experiences of Co-op workers, and seldom physically present in the store.","I feel there is a disconnect between management and the lower level employees of the coop. It feels like the concerns and criticisms are often ignored to curate an image to shoppers.","In my opinion the mgmt team had good intentions and goals but seem to be misinformed or share different priorities than supervisors and workers. It would be nice if the board members and mgmt team spent some time working some shifts in the different depts to aide in the decision process.","I don't see anyone with disabilities,  so I can't answer that.\nI feel this co-op is very management-centric.  There definitely is a split between management/non-management.","Things feel more fair with Michael gone. Some of these questions would be answered more negatively if he were still here."]},{"Question":"24. Comments about Workplace Communications?","Comments":["Not being able to have input on decisions that affect how my work is done is one of my biggest frustrations working at the co-op. The Admin team often makes decisions that directly affect us without any prior discussion. This has resulted in some really unnecessary waste and inefficiency, and often leaves the entire store staff feeling annoyed and disrespected. There are too many examples to lay out here. Given how often Admin references the co-op principals, I'm constantly astounded by how little communication and collaboration occurs.","Beekeeper can be really useful, but it is not easily accessible for me because my phone is incompatible with apps, so I'd need workplace computer time to access it. I only go on when I'm on my computer at home, which isn't great for situations that require quick responses.","There was a big issue with transparency which created low morale. There seemed to be a level of secrecy and it was unsettling. We no longer have consistent crisis situations happening with the construction being finished but I have no idea if things would be handled differently if it were to all be done over again. For what is happening today, now, a level of transparency is happening that helps me know whats going on. But again - the threats are low and I don't see if things have actually changed.","Things vary wildly. Sometimes we're right on target with planning and working together. Other times I feel bulldozed and out of the loop on important decisions.  Communication can be really challenging which is disappointing when it should be top priority.","Communication and roles have been very clear and working well of late!","We have gone largely virtual with upper managers of HR, Finance, and GM which has led to less communication- quality and frequency.  Less communication and opportunities are in 1 on 1 or face to face and must be asked for or instigated.  Communiation lags as well, bogging down response and follow through.  Due to decentralized nature with these upper managers, there are unnecessary communication loops, misinformation, or slowing down that happens.   It has not been an improvement and feels like a lack, especially with great disruptions to the store and teams over the past year.","Putting your input is great but sometimes, when they don't use it anyways and makes the employees not happy, not silly and stupid. and them feels bad themselves.","The Co-op has had a reoccuring phasing in-and-out of silo'd communication. It does feel like the tide where it's good for awhile, and then grows poor, and then we work to break down the silos, and so on. I'm unsure if there's a good fix for that, but there are times where folks aren't feeling heard or considered. Sometimes this is an unwillingness to come to the table, but sometimes folks are left out of loops. Communication is a hard beast to wrangle.","I think the regular department meetings are kind of pointless and redundant and can be communicated via a Beekeeper post easily. We all have things we need to do at work and those meetings take away from that especially when they're scheduled in the middle of the day and my supervisor does not check in with the rest of us before scheduling them.","Most descisions are made without worker or even supervisor input.  When workers are given the opportunity to give input, the outcomes are better ones.\n\nAll-worker and department meetings have a tendency to explore very little new territory, but I understand their usefulness from a management perspective.","Communications overall are fine with the exception that above department managers input is not used.","Please sight previous comment box","workers have a lot of great suggestions to make the co-op a better place, but they are not being heard. Decisions are being made without the input of effected departments, when they have the knowledge of how these decisions impact the day to day. When speaking up how how these decisions are impacting day to day, they are not being heard.","Communication regarding changes is handled in a top down manner. There is not a lot of room for comment prior to a decision being implemented.","too many pinned posts on beekeeper. If you want something seen just use the \"read and understood\" prompt.","We need more all-worker meetings that revolve around Q&A between staff and management. I think this needs to be a group affair as it gives everyone the confidence to talk and hear what management has to say. Transparency isn't always paramount here at the co-op. More department meetings would be nice too. We have less meetings here than any workplace I've worked before. Beekeeper works for some staff, but not for all. Those who it doesn't work for seem to be judged for not using it or not remembering it and that feels wrong.","Top-down communication at the Co-op is tightly managed, and carefully spoon-fed to workers. The lack of transparency is in constant evidence.","There is a lack of explanation with some of the decisions being made, most notably the lift and post renovation projects.","I like the staff suggestion box. I've used it numerous times.  Suggestions are taken seriously,  and change has occurred.  Thanks to Evans!","I feel that it's too much to ask of staff to attend more than one staff meeting per year.","Senior management has a habit of making large over reaching work flow decisions without consulting the effected parties, negatively impacting everyone except for them."]},{"Question":"30. Comments about Compensation?","Comments":["I don't believe we are given merit based raises","It could be better but I can understand the nuances of why it isn't. I am lucky that I don't feel like I'm struggling but I fear that others might not be in the same position.  My household is double income no dependants so I think in other circumstances it wouldn't be enough to be comfortable.","As we all know.... Inflation seems to be a constant lately and real estate in the area has also taken off. We could all use a few extra dollars to manage our lives outside of work.","it sucks everything has gotten more expensive and I know the co-op has tried to stay on top of compensation, but it is a challenge to live and work in Belfast. Increased Compensation has not totally made up for greater volume of work due to budget shortfalls.","I think having a thank you day for the employees  lunch or something like  a quarter may nice.  Just a little something that would be a nice little thank you for the workers","We aren’t making the $21 needed to simply sustain living wage (for rent, diapers, childcare)","I know there are better compensation and benefit packages around, but for this particular industry, I do feel like I'm being provided what I need to live and take care of my people. It's a hard industry to pay folks what they are actually worth.","Compensation is the worst part of working at the co-op in my opinion. I have a lot of responsibility and operate heavy equipment daily. I am responsible for making sure goods do not get damaged along with pedestrians and fellow co-workers. I do not feel the experience and skill level I brought to the job is compensated fairly and truly appreciated by others that do not understand how difficult it actually is. Part of my issue is the starting pay for a clerk or in the cafe is above the wage I make currently. They have less responsibilities and are less likely to get docked if a mistake is made. They can burn a pizza and remake it. I can't remake a human and pallets are worth several thousand dollars.","I am unaware of my pay rate in relation to other positions, as that is not public info. I am uncertain about comparing benefits to other workplaces, as I have nothing to compare with.","I am currently working two different positions within my department and it is a lot to take on and I believe that I am not being fairly compensated for it.","I'm not sure if pay increases are related to job performance","Wages are all but stagnant and the health insurance is a straight up scam. I've never worked this hard at a job and been compensated with so little.","I can't say enough how life-changing the Free to Staff offerings are.","Our pay raises are not based on merit, therefore they cannot reflect the quality of job performance.","Compensation is generally a hot button issue. The co-op at one time having been 100% at a living wage now (To my knowledge) Has no positions at a livable wage bellow an assistant manager leaving the majority of the co-op significantly below it.","It is a fact that the majority of our work force is paid from under a livable wage going down to the poverty line. I know that I am one that falls on the poverty line and I am not at the bottom of the list. With the recent renovation it feels as though the Co-op is in a constant pirouette and could flop at any hiccup. Could we consolidate tasks across departments, hire less people and incentivize our core folk with livable wage? Could stockers be produce and could facilities be perishables? Could we all be paid over twenty an hour to run registers and sweep floors? Could we melt down all the job position categories that breed an inherent idleness and train our competent staff to kick ass everywhere and be paid for it? It sure seems our Cooperative would be way more resilient.","As many workers have, adding extra tasks outside of job description, to avoid team burnouts, that then become expected without compensation","I understand the challenges of running a business very well and so I understand where the coop is at financially, but I hope that we can use our ingenuity to come up with ways to save money/boost sales/ raise prices enough that we can start to pay workers more money. perhaps raising store prices 1%, keeping staffing where it is and not hire more people ( I would rather work harder and earn more), optimize our departments workflow, create capital campaigns that will benefit workers wages. I cant say the coop is a viable option for long term employment and I think that is something that is important to being a business is thinking about managing long term viability of workers so that your staff is as professional and knowledgeable as possible and so that we aren't spending so much money on training and re-training. I think if we start to see our sales rise to 12 million and upward it would stand to reason that we could raise the average wage of workers at least 1$ if not 3$. I understand the pressure the management is under due to construction debt so it is not an easy matter, but it is important for workers to make a living wage and not be going into debt every week just to get by.","living wage","We're constantly told that the floor workers are what keep the store moving and thriving, yet I feel the pay doesn't reflect that. We break our bodies working there every day and make less that we should.","Every month, the Co-op breaks sales records, placing more and more demands upon workers. If their pay remains stagnant, how is that not tantamount to wage theft?","I feel that I am undervalued and undercompensated compared to other positions in the area.","I definitely think I have more to offer.\nI don't know what my coworkers makes, so I can't say if I'm compensated fairly.","It would be nice to receive a bonus at years end tied to the number of years of employment.","Our health insurance is horrendous. Even my provider commented on it."]},{"Question":"36. Comments on Store Operations?","Comments":["We are lacking a lot of information when it comes to accident, security, and safety procedures. Many SOPs/documents I've seen pertaining to those things are outdated to the point of being useless, especially post-renovation. For example, the Power Outage SOP references a power outage kit with headlamps that each department should have. We currently do not have these kits. Similarly, when I was first hired I inquired several times about having a plan in case of an active-shooter. I was told that Gina had attended a comprehensive training on the topic and would be developing a plan. That's the last I heard of it. It's been over a year. In general, Admin's response to safety concerns is always reactive, never proactive.","Now that construction is over, yes, big concern/unpredicted/unknown areas don't seem to be happening but when there is a concern with the receiving bay, for instance, and our safety, communication is thorough and consistent","While I believe the renovation helped ease the safety issues we still have a lot to work on. Other things just can't be changed at this point. I don't think things are set up with the intention of being safe for disabled people, workers and customers alike.","Over All the Store Operation lets us know what's going on.","We're working on more effective channcels for worker involvement, but what's here is working most of the time.","I said agree/disagree to the safety concerns being addressed promptly. I have brought up major safety concerns that have been ignored and then very minor ones are tended to immediately. Just as in the medical field, a \"triage\" of sorts should be put in place when several safety concerns occur at the same time.","I think we're doing okay with the limited space we have but the kitchen often feels prohibitively cramped. Navigating the tight space with things that are any combination of sharp, heavy, and/or hot can be a harrowing experience.","The receiving area next to the entrance to the break room is a dangerous error in planning.  The doors to the break room, Gina's office, and the employee bathroom should all open where facilities' work bench is located.  No expectations that this poor design will be fixed, but more safety precautions need to be taken.","I'll reiterate my experience that worker input is not solicited by operational or marketing staff before decisions are made.  To my best knowlege, operational decisions are made in a managerial vacuum.  My perception is that \"We know what's best for you\".  I find that patronizing and not in the best interest of the Co-op.","Again worker involvement is minimum as decisions are made without input of those who work in the environment.","The over-all store environment post-renovation is vastly improved from prior conditions. Conditions during renovation were poor.","pre order shelves","Our break room is through a forklift bay. No elaboration needed."]},{"Question":"40. Comments on Department Operations?","Comments":["Discrepancies in dept to dept operations, due to many factors, some understandable due to nature of work, team makeup, location, etc.\nSome dept discrepancies come down to individual managers and styles and preferences.    We have lost whole store consistency over the past couple years with upper management changes.","I am uninformed about the way storewide expectations are outside of my department, I don't know how other supervisors manage their staff.","Without a doubt I know my department as a whole is so well organized and tight knit. This is both from a fantastic manager who exceeds every expectation I have ever had, and a current staff of empathetic and dedicated co-workers.","sometimes they are bullying issues. Such as The funeral, and the muffins.","I often don't feel appreciated by management. We rarely see them and they don't feel involved in the daily workings of the store. They walk through and say hi a couple times a week and that's about all the interaction I notice. They care enough to know our names, but we rarely see them out in the store or witnessing our hard work,  let alone hearing any praise for it.","Work ethics vary widely among departments. Responsiveness varies widely among departments.","Management has more leniency with attendance.","The grocery department is lagging due to the current buyer and not being held to the same standards as other buyers are/would be."]},{"Question":"51. Comments on HR Practices?","Comments":["Wish we had in house HR but Ken is cool and better than nothing. It seems like there are things that could be handled better. Overall I haven't felt discriminated against.","I went to HR about concerns I had regarding two people in uppermanagement who had a relationship that was innaprporiate. I was told I would remain anonymous but I know it got back to the two people I complained about because one of them shunned me for months. That is retaliatory and unproffesional.","I really don't know the answer to the last 2 questions which is why I chose the middle answer.","Ken seems to have a lot of experience and is easy to talk to.","We have lost consistency and faith in HR practices with a large amount of rapid and uncontrolled changes over the past year.\nWe had a heavy HR practice and involvement and then shifted to the other spectrum, very light and hands off.  Managers are doing what they can to keep it up, but we lost several key people and the difference and effect is tangible in our culture.","it would be nice have someone as HR person but the Consultant does a great job","We have need of more help in the building, but our consultant does a great job keeping up with us.","I believe Ken O. is a fantastic HR consultant and I felt comfortable talking to him.","per question #7: Free of direct and overt discrimination and harassment. But not free of biases of ageism and ableism. IE: my supervisors are all over 10 years younger than me, and don't have the perspective that when people get older they can't and should not be expected to perform like they did in their early-mid thirties.","I think the absence of an in-house HR person is a grave injustice to the employees.","Having an actual in house Human Resources person was a great advantage and I think that many situations now probably go unreported or are not discussed.\n\nMy interactions with the HR consultant were over payroll matters.  They were handled promptly.","ken is nice","The HR guidelines are clear and concise. It's our lack of an in-house HR person that is troubling. Our remote HR person is hard to reach and doesn't have the personal feel that we used to have with our previous HR person. I felt like the current HR person was annoyed with my issues after a while. I also received no response on several accounts and had to get another member of the staff to \"nudge\" the HR to respond to my needs. It's challenging and sad.","Who exactly decided that an organization of this size can run effectively without in-house HR?","I've never needed to speak to HR.","Ken has been great to work with."]},{"Question":"59. Comments on Training & Development?","Comments":["I get informal feedback about how I'm doing but no official overview. Unfortunately the situation just hasn't allowed for a 1 on 1 with my manager about my performance. Which is fine as long as that doesn't make it harder to gain merit based raises in the future and my work is being appreciated.","I haven't had a performance review in two years.","I have not had an official supervisor check in/ evaluation since 2023.  Informal check ins have continued here and there, but few and far between, despite asks to resume with my supervisor.   \nWe had a robust evaluation process once that was well followed consistently across the store, but I have no idea how it is carried out across other depts at this time. I do not see the evidence of it in my area- I do my best for my reports and I believe some depts/ managers continue the practice.  \nOrientations were also more robust in the past, I'm not sure what standard is being held for ongoing orientations.","I haven't had an Evaluation for a while and I feel like I would like learn and grow in my job status,  I'm good at my job and I know it.  Not  tooting my own. horn but I have customer comment cards on it. I enjoy training others.","Reviews are infrequent. Some of this stems from renovation. Some of it is inconsistent application of a program. I historically have inconsistently been give \"goals\" to hit. Personally I would like more feedback, I do better with the occasional \"good job,\" but I also know my manager is quite busy. Upward mobility has been an institutional problem for awhile.","Training was kind of poor and I was left on my own to figure a lot of things out.","I haven't had orientation for 18 years so I have no opinion about that.\nMy job performance is not evaluated and therefore there are no performance goals.  I am expected to work up to my highest potential here and set my own goals.  I think that is true for everyone here.","thought my job utilizes my skills, they are not recognized or taking seriously by management. Even applying as an internal doesn't always equals an interview or discussion why not. And yes criteria is clear but evaluations are few and far between if remembered to be completed so working toward goals are usually already long completed and left to wondering where you are falling performance wise. And usually a shock at yearly raises when you think you have hit one area but given something different without discussions of performance issues.","Performance reviews are not happening on a regularly scheduled basis."]},{"Question":"68. Comments on Supervision?","Comments":["I would love more department meetings for store support!","I appreciate my manager. He has a lot on his plate but has always been helpful when I need it. Has apologized in the past when communication has faltered and left me in a really uncomfortable situation and worked towards a solution. Overall is one of the big reasons I've stayed as long as I have.","My supervisor rarely checks in with me about anything. He'll pop in and say hello every once in awhile but other than that I barely see the guy. We never talk about what I have going on in my department, I pretty much run things solo, which honestly is okay with me. If there are schedule changes regarding the people who work directly under me, I never heare about it. Communication as far as scheduling goes definitely needs to improve.","Evans is an amazing, wise and perceptive human being.  One could not ask for a better supervisor.  I feel I can talk to him about anything.","I know our GM has had a challenging year, with many personal and professional challenges, not to mention team/ manager challenges, and ongoing renovation.   That being said, it has felt like working with a new person this past year and it has been challenging and frustrating to continue to the work without the support and framework of supervision and support.  In essence, our GM, Finance, and HR managers have all turned into virtual managers who are available only upon request, and not seemingly accessible or available.    There is much 'soft work' that is left to those still in office and in store to pick up for the lack of managers who have become contract or are not in office regularly.  I do not believe this added labor and effort has been acknowledged and appropriately replaced, leaving the burden on those who show up.","Terry and Andrew are my supervisors. They are unbelievably positive and encouraging to me. I honestly have never worked in a place where I have felt so valued and part of a team. I also feel that when I have concerns, my supervisors are quick to take action and help me sort out a situation. I feel as through they both treat everybody in my department with kindness and compassion.","Sometimes it's hard to nail down vacation time, when you put in months in advance notice.","My manager is still onboarding on a long term program. I would like more communication, feedback, and praise, but I also am realistic with the amount of available time they have to work with and the scope of their job.","I can't always get clear answers on issues regarding my work (gets distracted easily while talking), but otherwise he is a very nice individual and is respected by many.","Supervision definitely encourages sharing ideas, suggestions and concerns, but how well they are received is unclear. IE: see previous comment RE: requests for needful equipment, and getting no response.","I think Catherine has done a good job acclimating and taking charge in the kitchen. I've been extremely impressed with her ability to receive feedback and implement changes based on that feedback.","My supervisor is fantastic, no notes.","In regards to my department, the grocery manager is often never seen, nor heard from barring the rare meeting or chance meeting in crossing. I basically work under the buyer in my sub-department. She is amazing and wonderful and supportive and keeps our world running. The grocery manager is very good at his job I'm sure, and is supportive when I go to him, but it feels like he is never there. I can't remember the last time I've heard praise from him. He only seems to pop through for short moments and never says much. I understand he is busy, but it doesn't feel good. I feel the managers should spend some time in the field a couple hours a week so they can be on the same level with us and understand our needs and also witness our successes. This is something the co-op does poorly. It feels like a huge divide.","I could definitely do more in my department.  I've made suggestions,  but  they go unneeded.","DM is holding current buyer to a different(Lower) standard, negatively impacting the department."]},{"Question":"75. Comments on Job Satisfaction?","Comments":["Best job I could have hoped for after retiring from full time employment. I love what I do","I feel valued by my coworkers, community, and my direct manager. Sometimes it's really hard to recommend working here due to when there are problems they tend to be big and hard to get through. I want us to do better because  I care about my coworkers, my community, and the future of cooperation. We have all worked so hard to make the co-op what it is and it doesn't always feel like that's acknowledged.","I feel valued at work becuase of my coworkers. I have gotten some recent recognition from management but it's not often. I do have satisfaction with my job because I am learning a lot and growing. I'm gaining confidence in myself and for that I am grateful.","Our co-op is a GREAT place to work.","In these times, I am grateful to work somewhere that doesn't leave me feeling like I am part of the growing problems in our world.","Glad to be on the team.","It's been a really hard couple of years.  It's not getting easier and we could use a new infusion of energy and support after great amounts of change.  We just keep rolling forward, but we do not go back and assess and heal and seem to bury our trauma.   \n\nAlso, working in this sector where food and community come together during this unique time is incredibly daunting and challenging.","I've been here for a very long time,  My Coworkers are the best and they recognized me.","This place has come a long way from when I started, and I think it's better for it. It's not always glamorous work, but it's good and it's good for the community.","I believe the co-op is a great place to work and I absolutely love everything it has done for the community and in providing healthy, sustainable food sources. I do think it is a slight slap in the face seeing what the co-op offers its employees for a pay rate and the raises that are(n't) given.","I enjoy my job and absolutely adore the people that I work with from all departments.","I would be more satisfied as a 32 hour/week employee and with more part-time employees in my department.  Management has said they do not want 1-2 day/week employees because there is not enough \"buy-in\".  Every other retail store in coastal Maine hires part-time help in summer.  It is too bad this hang-up is preventing the co-op from being properly staffed.","As much as I find my role to be important both in the co-op and the community of Belfast, I at the end of the day cannot recommend it. Low wages, and an unstable support structure for the average worker in the co-op has lead to multiple employees burning out in my department and others.","I am interested in staying because I have seen what this place can be and become again. Right now the Co-op feels to be at a fork in the road and can choose to be the Cooperative we know and loved or continue down the path it is going and be cooperate. Until the direction is chosen I can't recommend anyone work here as it currently doesn't feel like a healthy environment.","I would love to work here over the long term! provided that the pay can start to be raised I intend to stay for a long time","i like this job.","I don't feel recognized for my hard work by the management team. It makes moral and just the satisfaction of doing a good job not feel worth it often. It's hard to want to go above and beyond whats asked for when you feel invisible. Most praise I hear is from fellow floor workers and that's all well and good, but the management side of things could be more involved.","Co-ops have a completely different sales model from other retail stores,  so I'm proud to be a part of that."]},{"Question":"76. Any final comments?","Comments":["Great job, great manager and great team","I feel as though sometimes when it comes to PTO and earned time off that it is (according to some managers) never a good time to take time off for vacation or an event but the same manager will take multiple days and not have trouble getting the time off approved. I feel as though this happens store wide, but is swept under the rug.","I think the ridged top down management structure is creating issues through hierarchy. Making it so others opinions and ideas are valued more than the rest. As a democratic business I think workers should be trusted to fulfill the needs of the community, each other, and the business as a whole. Sometimes it really doesn't feel like we are listened to about our concerns or given all the information about what is going on. The person \"lowest\" on the poll deserves to be heard as much as the person on \"top\" especially concerning the day to day goings on that make the co-op actually run.","This survey will change nothing, it never does. I just hope we get to see the results this year! I also thinks they should publish last years results too. I also want to throw something else in here as well. Recently on social media our GM's girlfriend made co-op clothing that said \"Johnson #Co-op daddy\" \"Come in for the bulk bins, stay for the hot GM\" and a lot of us found that disgusting. Uppermanagement needs to defalte their egos a bit and come back down to earth. They aren't gods and they need to stop acting as such. Talk to your people, include them in your decision making, act as if your one of us. This elitist bull shit needs to stop!!!","Grateful to be at the COOP. Love supporting local farms and little businesses in our community! Anything to make these opportunities more attainable for our community members is so important to me.","I am concerned that if we don't build our team back up soon and take some proactive measure, we run the risk of burning out who is left or suffering greater because we have lost much operational capacity and knowledge.\nEssentially, we went from a co-op of abundance, to the point of beuaracracy limiting work to a co-op of scarcity where the limiting factor for work is how  much can the few people left do?   We lost much efficiency and institutional knowledge and it is hard to be one of the now few who remembers when things were working more effectively.  I'm tired.","I love working at the Belfast Community Co-op. It is a staple in our community and really makes a difference in the lives of so many people. I love that I get to be a part of it all. I appreciate the supportive environment management has created. I've never felt so valued as an employee, and that is why I'll be here for a very long time. It is truly a special place.","I forgot to write on for my surpriser part that ir would be nice that they put the customer comment card in the good thing in the beekeeper.","Not at this time. Thank you as always for helping the workers share their voice and experience.","In summary the co-op is an imperfect animal and while there are parts I adore, especially, in respect to the community it breeds in the employees and town as a whole. At the end of the day it has fundamental flaws that make it hard to have confidence in.","Being a Co-op it is sad that we don't meet the living wage. transparency about admins salary would be appreciated. respectfully","Time to paint those IN/OUT arrows on the parking lot pavement!!!!"]}],"results":{"Overall":{"response":"The survey comments reveal a distinctly negative overall sentiment, largely driven by critical concerns spanning compensation, management practices, and internal communication. While employees often express strong pride in the Co-op's mission, its positive impact on the community, and fulfilling relationships with many coworkers and some direct supervisors, these positives are frequently overshadowed by significant systemic challenges.\n\nKey issues highlighted across multiple questions include a pervasive lack of transparency in management decisions and survey results, a considerable disconnect between upper administration and frontline staff leading to feelings of being unheard and undervalued, and profound dissatisfaction with compensation, which is widely described as falling below a living wage and not adequately reflecting responsibility or effort. Furthermore, shortcomings in HR practices, a lack of formal training and development, and notable safety concerns contribute to the prevailing negative sentiment. Many comments emphasize a desire for the Co-op to genuinely embody its cooperative values, which they feel are currently undermined by what some perceive as corporate-like structures and an 'elitist' management approach.","sentiment":-0.223},"7. Comments about Co-op Values?":{"Sentiment":[0.7,-0.8,-0.6,-0.1,-0.9,0.9,0.7,0.9,0.3,0.1,-0.5,0.2,-0.3,-0.6,0.8,-0.4,-0.2,0],"Highlights":["Many comments highlight a significant gap between the Co-op's espoused values (e.g., sustainability, community, democracy, diversity) and the actual day-to-day operations, management practices, and pricing.","A strong recurring theme is the perception that upper management is 'out of touch,' exhibiting a 'corporate feel,' being 'not democratic/inclusive,' and lacking transparency, particularly regarding previous survey results and decision-making.","While some appreciate efforts, there's critical feedback on the practical application of diversity, noting a predominantly white workforce, issues with supporting disabled individuals, and challenges in honoring diverse viewpoints or making board engagement accessible."]},"18. Comments about Co-op Management Practices?":{"Sentiment":[0,-0.9,0.2,-0.4,0,0.1,0.3,0.9,-0.6,-0.7,-0.8,-0.8,-0.7,-0.5,-0.9,-0.6,-0.7,-0.2,-0.5,0.4],"Highlights":["A dominant theme is the perceived disconnect between upper management/admin and day-to-day store staff, leading to decisions made 'in a bubble' without worker input and a lack of understanding of operational realities.","Multiple comments detail specific instances of staff with disabilities not receiving appropriate accommodations, feeling invalidated, or facing challenges in having their needs met.","There are strong criticisms regarding a lack of transparency in significant decisions (e.g., staff terminations, construction impact), perceived unfairness in attendance policies, and unresponsiveness to worker requests for equipment or concerns."]},"24. Comments about Workplace Communications?":{"Sentiment":[-0.9,-0.2,-0.3,-0.4,0.8,-0.8,-0.6,-0.3,-0.5,-0.6,-0.1,0,-0.8,-0.7,-0.2,-0.6,-0.8,-0.5,0.8,-0.3,-0.8],"Highlights":["A pervasive frustration is the top-down nature of communication, where decisions are made by management (especially senior/admin) without consulting affected staff or departments, leading to feelings of disrespect, inefficiency, and unheard suggestions.","There's a clear concern about a lack of transparency regarding important decisions and changes, historically causing low morale and a feeling of secrecy, with some doubt if things have truly improved.","While platforms like Beekeeper are useful for some, accessibility issues exist, and meetings are often seen as redundant, poorly scheduled, or ineffective, leading to calls for more interactive Q&A sessions between staff and management."]},"30. Comments about Compensation?":{"Sentiment":[-0.5,-0.2,-0.3,-0.7,0.4,-0.8,0.3,-0.9,0,-0.7,0,-0.9,0.9,-0.6,-0.8,-0.9,-0.7,0,0,-0.8,-0.9,-0.7,0,0.4,-0.9],"Highlights":["The most critical and consistently repeated theme is that the majority of the workforce is not paid a living wage, with many comments describing it as 'poverty line' or 'undercompensated,' leading to difficulties in managing life expenses.","Employees feel their compensation does not reflect their responsibility, skill, or hard work, with a lack of merit-based raises being a key point of dissatisfaction, compounded by uncompensated additional tasks.","Beyond base pay, the health insurance is explicitly called 'horrendous' and a 'scam,' adding to the overall negative sentiment regarding the total compensation package, though 'Free to Staff' offerings are highly valued."]},"36. Comments on Store Operations?":{"Sentiment":[-0.9,0.3,-0.6,0.5,0.2,-0.6,-0.5,-0.8,-0.8,-0.7,0.4,0,-0.9],"Highlights":["There are severe criticisms regarding lacking or outdated safety procedures (e.g., power outage, active shooter plans) and dangerous design flaws (e.g., break room entrance via forklift bay, cramped kitchen), indicating a reactive rather than proactive approach to safety.","Consistent feedback highlights that operational decisions are made without soliciting input from the workers directly affected, leading to 'managerial vacuums' and decisions not in the best interest of the Co-op.","While some specific safety communications are praised, there's inconsistency in addressing concerns (minor ones prioritized over major ones), and particular attention is drawn to the store's lack of safety and accessibility for disabled people post-renovation."]},"40. Comments on Department Operations?":{"Sentiment":[-0.5,0,0.9,-0.6,-0.7,-0.4,0,-0.6],"Highlights":["There's a noticeable lack of consistency in operations, management styles, work ethics, and responsiveness across different departments, partly attributed to upper management changes.","A recurring complaint is the perceived disengagement of management from daily store workings, leading to employees feeling unappreciated and rarely receiving praise for their hard work.","While one department is highlighted for its 'fantastic manager,' organization, and team spirit, there are specific criticisms about other departments, including issues like bullying and lagging performance due to specific personnel."]},"51. Comments on HR Practices?":{"Sentiment":[0.1,-0.9,0,0.7,-0.8,0.4,0.4,0.8,-0.6,-0.8,0.3,0.5,-0.9,-0.8,0,0.7],"Highlights":["There is a pervasive sentiment that the Co-op needs an in-house HR person, with the current remote consultant, despite some positive individual interactions, often perceived as hard to reach, lacking 'personal feel,' and unresponsive, leading to issues going unreported.","Significant 'rapid and uncontrolled changes' have led to a loss of consistency and faith in HR practices, shifting from 'heavy involvement' to 'very light and hands off,' negatively impacting the Co-op's culture.","A serious incident of an HR complaint not remaining anonymous, leading to retaliation, highlights a critical trust issue. Additionally, concerns about implicit biases such as ageism and ableism within management are noted."]},"59. Comments on Training & Development?":{"Sentiment":[-0.1,-0.4,-0.8,-0.5,-0.6,-0.6,-0.5,-0.8,-0.5],"Highlights":["The most prominent issue is the widespread absence of regular, formal performance evaluations and consistent feedback, with many employees reporting not having had a review in years, or only receiving informal feedback.","This lack of structured evaluation directly impacts employees' ability to understand their performance, work towards goals, feel recognized for their skills and hard work, and potentially attain merit-based raises or internal advancement.","There's an indication of inadequate initial training and a lack of consistent, robust development programs, with employees often left to 'figure things out' on their own, and a past 'robust evaluation process' being noted as having disappeared."]},"68. Comments on Supervision?":{"Sentiment":[0.4,0.9,-0.6,1,-0.9,1,-0.3,-0.1,-0.1,-0.4,0.9,0.9,-0.8,-0.4,-0.6],"Highlights":["There's a clear split between highly positive experiences with specific direct supervisors who are praised for being supportive, encouraging, and responsive, and highly negative experiences with absent, disengaged, or virtually inaccessible upper management (GM, Finance, HR).","A significant concern is the perceived absence of managers (particularly grocery manager and upper management) from the day-to-day operations, leading to a feeling of being unvalued, a lack of praise, and a 'huge divide' between management and floor staff.","While some supervisors encourage ideas, there's a recurring issue of employee suggestions and concerns (e.g., equipment requests, vacation time) not being acted upon or clearly responded to, contributing to a sense of unimportance."]},"75. Comments on Job Satisfaction?":{"Sentiment":[0.9,0.1,0.7,0.9,0.8,0.7,-0.8,0.8,0.7,0.2,0.9,-0.5,-0.9,-0.8,0.3,0.6,-0.7,0.8],"Highlights":["Employees express high satisfaction stemming from their coworkers, direct managers (in some cases), connection to the Co-op's community mission, and personal growth. However, this positive sentiment is often overshadowed by significant dissatisfaction regarding low wages, lack of management recognition, and an unstable support structure.","Low wages, high workload, and a perceived lack of support from upper management are explicitly linked to employee burnout and a feeling that the Co-op environment is not healthy, making it difficult for many to recommend it as a workplace.","While many employees express a desire to stay or a belief in what the Co-op 'can be,' their long-term commitment is often conditional on improvements in pay, recognition, and a shift away from what feels like a 'corporate' path towards its cooperative roots."]},"76. Any final comments?":{"Sentiment":[0.9,-0.8,-0.9,-1,0.9,-0.8,1,0.3,0,-0.2,-0.8,0],"Highlights":["There's a profound sense of distrust and cynicism, with comments expressing that the survey 'will change nothing,' demanding publication of results, and strongly criticizing upper management for perceived elitism, inappropriate conduct, and lack of transparency.","The 'rigid top-down management structure' is a significant pain point, with calls for workers to be 'trusted,' 'listened to,' and included in decision-making, emphasizing the disconnect between the Co-op's democratic ideals and its operational reality.","Concerns are raised about the current operational model leading to employee burnout, loss of 'operational capacity and knowledge,' and a shift from a 'co-op of abundance' to one of 'scarcity,' directly contradicting the foundational values."]}}}