{"comments":[{"Question":"6. Comments on Co-op management practices?","Comments":["I think it is important to have clear and concise guidelines when dealing with the discipline of an employee. There have been a couple things to fall through the cracks that still need correction.","inconsistent with variety","Confusing","No comments","They seem to occasionally operate on a case-building method at times, and bring a list of issues to an employee's attention rather than addressing issues as they arise.","I think everything is pretty fair I'm not involved in decisions but from what I see things are handled well!","I think the managers each \"follow the rules\" on corrective action but I think that differences in their individual management styles, and communication of expectations result in slightly different application. I don't know of any staff upset about it though.","honestly i’m fairly new so i might be a little bias, but i love everything about everyone here . no complaints on my end :)","My Management team act thoroughly if there is a disagreement between any employee are employees and resolved the situation","I think that while there is a policy of transparency in place, it does not often appear that way in practice. There's a couple areas where this transparency is not evident, such as in compensation.","Corrective action sometimes seems inconsistent, varying from department to department.","When trying to resolve disagreements with management, I've found that my manager is not responsive to what I have to say and makes no changes. When I realized this and started going to HR instead, I was told not to, and that my going to HR was inappropriate and should not continue. I know of several other people who have had conversations with their managers as well that did not become a productive conversation. There was guilt tripping and gas lighting, most of which to avoid taking any kind of accountability. The behaviors discussed in those meetings were never changed, and left the employee feeling like they're in the wrong for having the conversation in the first place.","The Co-managers are always available to help either myself or a customer. If you bring a concern or need assistance with a product they will research it for you and they are happy to help.  It's actually so nice to work in such an environment.","Communications can vary, depending on each employee/employer.","I think it's getting better and more consistent. The team is stronger and working together to better the departments.","Do we have a 'grievance procedure'?\nIf so, has it been reviewed with staff in the past 2 years?"]},{"Question":"11. Comments on compensation?","Comments":["I wish there was a little more wiggle room with pay raises and that they were based on merit and not just yearly","longevity is not respected in wages , merrit is very slight;y respected  in wages.","Healthcare is always an issue, but I understand why it isn't offered. \n\nSome sort of savings plan/incentive would be nice to have for pre-tax dollars.","I think we need medical insurance coverage , the job at some point effected on our health and make us in a direct or indirect way could be injured .","We continue to lack healthcare. The benefits offered here are a joke compared to other coops nearby. Expired food as a benefit? Really?\nThe PTO is ok. The employee discount should be higher. We need more paid holidays.","Flexibility and support for work/life balance are good benefits for me","We should have health insurance","it’s all great lol, once again no problems over hereeee and thank you so much. i’ve been offered all those things .  again thank youuu .","The compensation is fair to my working skills","We have no benefits.","The pay falls far below the living wage in Connecticut and I feel I exceed the requirements of my role and go far above what I am paid to do. There is also a lack of transparency of how much money exists to pay staff in comparison to what staff are being paid.","Compensation will always be a hot topic. We are paid fairly well, but the consistent economic strain is a challenge that is hard for any company to face.","The holidays are good, discount is good and PTO. However, I've had an injury preventing me form working to the fullest extent for months now because I don't have insurance to cover it. I make too much to qualify for state but I make too little to be able to pay for it myself. There's been talk about insurance but no follow through, which seems to be a common theme here.","I took the job as a part time employee and the pay is fine with me.","It's still very up in the air. There's no clear way of providing raises or when that will happen. I've been asking since the beginning of the year based of my work and tenure and have not received one."]},{"Question":"19. Comments on store operations?","Comments":["inconsistent due to high turn over management and teams","It seems those that don't pull their weight are given a break. Over and over. Especially with call outs.","no comments","roof leaks should be resolved","The store operated on a time schedule that is reasonable for working purposes","I have consistently watched the brunt of the grocery departments work fall on the shoulders of select few people while others are allowed to continuously disrespect attendance policy and employee expectations.\nThis labor imbalance has resulted in frustration and burnout amongst the departments best employees and it's a shame to see the department fall apart as it has. \nThe back areas of the store could really do with some reorganization.","The working environment is safe but I often struggle with the disorganization and mess. There are necessary repairs that often go overlooked for a long time or it feels like they are not cared about.","Safety protocols and information should be addressed both verbally and passively (signs, trainings, etc.)","The only time my supervisor has let me know what's expected of me was after he got written up. He sent me a lengthy email, and didn't think to schedule a time with me to discuss it, leaving me wondering what I did wrong and what I need to change. This left me wondering all weekend, until Tuesday, what I was supposed to be doing. This led to a breakdown in communication. The endcaps didn't get ordered and the sale didn't get planned because he stated he wanted a heavier hand in this process. I asked him if he wanted to do it, told him I was leaving it for him, and it didn't get done.  My supervisors decisions are not fair nor are they consistent. He often talks about how some of our employees are on thin ice, but does nothing to correct these actions that cause them to be on thin ice. This leaves their workload for other employees because their actions are not being corrected, so now they believe they can get away with it. The same thing happened with a woman who used to work here who was consistently late. He had me mention something to her in passing, but never sat down with her. He mentioned to me one day that she's close to being fired. I asked him if he's had any conversations with her and he said to me if he did then we would be needing to hire another stocker. Him and I argued about this for several minutes, with me saying that it's absolutely unfair of him to jump to that solution without letting her know she's on thin ice at the very least. He goes on week long vacations out of the country, but she asked several times for an extra day off so she can go to college in person, because online school was really messing with her mental health. He said no. She went on to have a mental breakdown and quit. I happen to be her friend, so I do have stronger feelings about this situation, but I feel as though I can separate my relationship with her and my work relationships. He also left my other friend alone up front to usher out confused and angry customers during a fire alarm. Nobody checked on her, but he told tauj that there was communication between them the entire time, which was a lie. He told Stanley he knew nothing about the lube and toy cleaner we were bringing in, which was a lie. He told Stanley that I didn't communicate about moving some bulk bins around, which was a lie. He is why I'm quitting after three years of being here and I do not want that to get lost in translation. It's never been made clear to me who to contact. My supervisor doesn't know what to do in emergency situations for the most part, so when I contact him he either points me to Kourtney, Stan, or Lexa. This one though I can give him the benefit of the doubt because it's likely due to shitty management training, which I haven't received any besides one Merriman training course, so I can see why he wouldn't have a good grasp on what to do. The most we get on emergency procedures is a quick \"this is what you do\" in huddles. Multiple employees have asked for some kind of training, and while important, the only real training we've received is Narcan training. The parking lot is not safe. Not only does Tony sit out there and yell at our customers, but its uneven with huge chunks of asphalt everywhere. I've tried several times to organize a cleaning day and I've been told to wait, to figure out legal concerns, and again nothing has happened. Absolutely no follow through.","The staff makes it possible to talk to one another and come to a solution.","Safety procedures are addressed, however not often enough (that is assuming there is no room for concern in most cases). Physical working conditions may also vary, even when damaged products are found scattered in random places."]},{"Question":"27. Comments on human resources practices?","Comments":["Everyone here seems fine with casual misandry. Comments like \" Men are trash\" etc are overheard and make me uncomfortable.","The HR practices at Fiddleheads are unlike any I have ever experienced. Our HR manager is kind, understanding and applies the rules fairly to everyone.","informative upon request , not ignored","no comments","Human Resources addressed any discrimination towards an employee are employees pertaining to their harassment in the working environment","Tauj rocks!","The workplace is at odds with neurodivergent people and does not take their needs into consideration.","The handbook is helpful, but seems like it may be missing some points, and the attendance policy is confusing.","Tauj is fantastic. The policies, however, are enforced differently in every department and sometimes vary from employee to employee. My friend, the woman who quit, was told she was on thin ice and if she was late again she'd be fired. There is a man who woks here who calls out consistently and has no call no showed around 3 times and nothing has happened to him. He's been spoken to once about attendance. He calls out because he's \"sick\", and then employees see him at dockside or some other bar downtown. It's absurd. Some managers follow the attendance policy to a T, and then others don't really care at all. It makes it confusing and irritating especially when I'm trying to enforce the rules but my supervisor doesn't really seem to care, and gets snippy with me when I raise my concerns. Sorry I'm trying to do your job for you.","While the Employee Handbook does come to use, it can also be overlooked when in a situation. For example, an employee having to be written up for several issues that were not initially addressed before written up."]},{"Question":"33. Comments on training and development?","Comments":["For my role in particular, I think more training should be added in the future if it comes to that","could use more defined protocol but again high turn over with management and team , hard to establish bec of turn over","no comments","my job description should be updated","I have excel in my job pertaining to the training and development skills I achieved in the work environment","Training for new FRESH responsibilities has been sporadic. Some of us have had the opportunity to learn certain tasks while others still haven't. Not everyone is up to date on things like fish prep, cheese cutting, etc.","The evaluation seemed arbitrary and left little room for discussion.","Just need more consistency in evaluations department to department","My job description clearly outlines my job, but several extra responsibilities have been moved around between me and my supervisor. I've asked to sit down and go over it with him, and this didn't happen until he implemented a PIP to tell me I wasn't doing my job according to the job description. Maybe I would have if we had sat down to talk about it sooner. From the email he sent me, my focus is gen merch, center store, beer, freezer and bulk. The only thing I'm not buying for in that list is bulk, which I still complete orders for sometimes because we haven't hired anyone else  to order for these areas after losing our buyers. I've asked for help several times. Help has not come. I've also tried to implement solid training hours and routines, none of which have had any follow through because while I can make up the outlines and whatnot, I do not have the power to make these things happen. They need to be implemented by my boss. Whenever someone is being trained and I'm not the one doing it, I see my supervisor sit at his desk and explain what to do as opposed to having someone work side by side with our new employees until they're ready to go off on their own. This is not training. This is why we cant seem to keep employees. I will be gone before we hire new people for the buyers position and for my position. I can only imagine what their training is going to look like. I don't think anyone knows what the goal of the department is. y goal is growth, which I have done. I'm also unsure of how I'm evaluated. I believe my supervisor uses the same criteria that we did for the raises, which honestly just shows me he can't assess people's performance on his own. This is what happens when someone is promoted with zero management experience. I come in and do things I see need to be done. It's easy when there isn't someone telling me I need to wait for something that's never going to happen, like when our margins are ridiculously low and I want to raise the prices, but I have to wait for Lexa or this or that. That's why our numbers are so low, because in a department where our target is 40%, half of these things are at a 25% margin. Good god.","When it comes to development, the goals and performance when it comes down to doing tasks can be clear at times. In other times, not so much. Training too can be slow, but feasible once the opportunity comes up."]}],"results":{"Overall":{"response":"The survey comments reveal a predominantly negative sentiment across the organization, driven by significant concerns in several key areas. While individual managers and certain aspects like work-life balance or manager helpfulness receive some positive mentions, these are largely overshadowed by widespread dissatisfaction. The most critical issues revolve around inconsistent management practices, a severe lack of transparency, and a perception of unfairness in policy enforcement, particularly concerning attendance and corrective actions. Compensation and benefits are major pain points, with a strong demand for health insurance and complaints about pay being below a living wage and a lack of merit-based raises. Furthermore, the effectiveness of training and development is frequently criticized, leading to high turnover and a feeling of inadequate support. The detailed accounts of poor supervisor communication, lack of accountability, and physical store issues paint a picture of an organization struggling with systemic operational and HR challenges, leading to employee frustration and burnout.","sentiment":-0.685},"6. Comments on Co-op management practices?":{"Sentiment":[-0.4,-0.3,-0.5,0,-0.6,0.6,0.1,0.9,0.7,-0.5,-0.4,-0.95,0.95,0,0.7,0],"Highlights":["Significant inconsistency in management practices and corrective actions across different departments.","Concerns about a lack of transparency, responsiveness, and accountability from some managers, including discouraging employees from utilizing HR channels.","Positive feedback highlights managers' helpfulness and a perceived improvement in consistency and team collaboration in some areas."]},"11. Comments on compensation?":{"Sentiment":[-0.4,-0.5,-0.2,-0.8,-0.9,0.7,-0.7,0.9,0.6,-0.7,-0.95,0.1,-0.85,0.5,-0.6],"Highlights":["A critical and widespread demand for healthcare benefits, with many employees reporting direct negative impacts from its absence.","Significant concerns about pay, including it being below the living wage in Connecticut, a lack of merit-based raises, and poor transparency around compensation.","While some benefits like flexibility, PTO, and employee discount are appreciated, the overall sentiment regarding the compensation package is largely negative."]},"19. Comments on store operations?":{"Sentiment":[-0.5,-0.7,0,-0.4,0.5,-0.9,-0.6,-0.1,-1,0.6,-0.4],"Highlights":["Pervasive issues with perceived unfairness, inconsistency in policy enforcement (especially attendance), and workload imbalance leading to burnout among diligent employees.","Serious concerns regarding supervisor communication, accountability, and competence, exemplified by a lengthy complaint detailing poor support, dishonesty, and ineffective emergency response.","Operational problems include neglected physical store conditions (roof leaks, disorganization, unsafe parking lot) and inadequate training for emergency procedures."]},"27. Comments on human resources practices?":{"Sentiment":[-0.8,0.9,0.5,0,0.7,0.8,-0.85,-0.2,-0.9,-0.6],"Highlights":["Mixed feedback on HR; while the HR manager (Tauj) is praised for kindness and fairness, there are significant reports of systemic issues.","A major recurring problem is inconsistent enforcement of policies, especially attendance, leading to perceived unfairness and frustration among employees.","Concerns exist about the workplace's inclusivity for neurodivergent individuals and instances of casual misandry creating an uncomfortable environment."]},"33. Comments on training and development?":{"Sentiment":[0.1,-0.4,0,0.1,0.7,-0.6,-0.5,-0.4,-0.98,-0.1],"Highlights":["Significant issues with the consistency and effectiveness of training, characterized by sporadic learning opportunities, a lack of defined protocols, and poor hands-on guidance.","Evaluations are perceived as arbitrary, lacking consistency across departments, and sometimes used punitively rather than for employee development.","Concerns about outdated job descriptions, a lack of management support for employee development initiatives, and the negative impact of ineffective training on employee retention and departmental performance."]}}}