{"comments":[{"Question":"8. Comments about Co-op Purpose?","Comments":["The co-op is not aligned with the first sentence of its mission statement.","The concept of the co-op is admirable in intent.","I appreciate the push towards sustainability and supporting local communities. First alt is the hub for this in our area.","With the growth of NCG arranged Co-op Deals and the instistence that we carry every Field Day item, I feel we have moved away from our mission of supporting local food producers.  The cheapness of Field Day prices and their inclusion in so many catagories throughout the store harms are higher quality/smaller/local brands.  It's almost like the Walmart effect on small businesses.","In the commissary I feel we have quite a diverse group of folks, and despite disagreements I think generally our differences and needs are catered to. That said I think the Co-op purpose is lost sometimes in our workload, the passion and pride I would hope possible in the kitchen not always present.","yknow its about as good as you can get in this economic system. wish it was an actual worker's co-op though.","I've always appreciated our co-op's vision and mission, I think more organizations should follow suit. However, these are things we can aspire to, but how we implement these practices matters. We can only show our commitment toward the business we want to be in action. I often wonder if we are putting in the real, DIFFICULT, work to be the change, I can't help but feel our business as a whole take an approach to our purpose that exists in convenience.","I think everyone at our store does a great job of upholding our Co-op mission.","Relatively queer safe from Day 1. Could always use improvement but lots of gender diversity, cis and trans. Keep it up! When there have been issues, I have seen others and have been comfortable myself voicing concerns when we are missing a perspective.","I feel these are areas that the coop really excels and one of the ways the coop provides real value to our community","Throughout the years, the co-op has struggled with putting its money where its mouth is in regards to being inclusive interpersonally. This tends to vary between departments.","Me coste buen trabajo que asen con los trabajadores y productos","Some managers demonstrate a bias towards those they get along with better personally, even if they're lower performers.  Some managers are bias in their hiring practices.  I don't think newer managers are being coached or guided for how to conduct an interview or given enough perspective on selecting candidates.","It seems that we strive to provide minimally packaged goods in our mission and I would love to see this refelcted in the packaging we provide for our FA Kitchen goods which are currently in plastic clamshells..","Better than most, but the Co-op has been better about these things, internally and externally, in previous years.","The Co-op has always been very \"left/Democrat/Liberal\" leaning, I would love to see more overt ways for them to be more accepting of everyone, including those whom opinions don't always align with our own.","We should do a better job at buying more local products.  We depend too much on UNFI.  Ordering locally is more work but extremely important.","Co-op's business purpose is unique, however, the work culture still operates too similar to a corporate culture.","It's difficult for \"differences to be accepted\" and diversity to be valued in a town as homogenous as Corvallis. The leadership of First Alt is overly saturated with white people and Cis-Het men, and largely because that's our main demographic here.","I love our mission but over the years have a found it hard to truly believe in aspects of it. Specifically: innovative education and community outreach, minimally packaged products, and acting ethically and appropriately in our pricing practices as well as seeking to provide a democratic business climate, fostering worker participation. Specifically I feel more recently things are less and less worker focused, specifically the new handbook feels very strange and aspects of it feel inappropriate for us as a store, the lack of clarity in that the handbook is also infuriating.","The co-op does good work, especially with its inclusivity but more can always be done","I've seen the Co-Op's mission in practice while working here, however I take a very big issue with the fact that the Co-Op sells goods from Israel. I believe that financially supporting Israel goes directly against the Co-Ops purpose - The UN has declared that Israel is comitting a genocide. I feel uncomfortable knowing that I am working for a place that financially supports Israel. Also, when fliers advertising community events supporting Palestine are posted in the breakroom at the North Co-op, I have noticed that they are removed fairly quickly.","much better than any other store in town","The co-op struggles with accepting and honoring diversity related to religion (especially Christianity), race, and disabilities. While they state they care and honor these things, and have relevant trainings, the attitude and bias expressed throughout the co-op do not align with these values and I don't think the co-op does enough to combat this cultural issue.","The Co-op is the best model for environmental sustainability among grocery stores in Corvallis and the surrounding area.","I think that it is a very awesome step in the right direction for us as a community to be heading in. The acceptance of others when others are respectful of themselves and their surroundings is how we as people and as a society should come together as a whole."]},{"Question":"16. Comments about Co-op Management Overall?","Comments":["I say this genuinely: Co-Op management needs DEI training. The entire organization does, really.","Less time in offices at computers & meetings & more time in the physical store working & observing the day to day business needs in each department.","I am not really privy to how management is running other than it is succeeding to stay in business and seems to be reasonably approachable.","I have noticed there are large variances in our management's commitment to these practices and employee welfare in general depending on what department/manager is being considered. Some members of management go above and beyond to support their employees, while others are often found to be lacking in their willingness or ability to do so.","Most staff at our co-op have good communication and fair practices. Some newer management staff appear to need overall training in communication skills as a whole making them appear unreliable at times. Most staff members in this area have years of experience and you can see this reflection. Overall, some may need more training on soft skills.","\"Do more with less\" seems to be the constitant messaging from the Co-op Finance committee and General Managers.  Something is profoundly broken within our capitalist society and it can be seen and felt here at the Co-op.  We're in a race to offer the cheapest prices (contractual obligation to carry Field Day items) with lowers margin dollars but increases the amount of receiving/stocking that must be done to keep those items on the shelves.  Almost all departments are understaffed, with call outs/PTO with no one to cover causing an increased amount of stress on the workers that are working on those days.  Managers are burning out and stepping down and there is no discernable attempts being made to fix these situations.  In my opinion, everyone is so overwhelmed that it's not even possible to take a step back and examine exactly what is wrong and how to fix it.  My major concern is that the current GM was a major contributor to the disfunction in their role as Finance Manager, so I have no hope that things will change with them now as the GM.","Please addresses staff who use cell phones on the clock. My understanding is that cellphones should be put away in your locker and should only be used during breaktime. I see most of the Groc/Bulk stocking team using their phones excessivly. This is on top of excessive talking that's taking away from getting work done.","Interactions with general management are limited when working in the kitchen and at least personally, I don't see much effect from actions they take. The coop is generally diverse and I think management at least somewhat reflects that, though I feel there's always room for more.","i appreciate the level of trust the commisarry management team puts in their employees. it cultivates a healthy work environment.","Very minimal interaction with General Managment and Store Managers outside of my department since I have started. Maybe only interacted with any of them in my orientation.","I have had, for the most part, neutral-negative experiences with co-op management. I often feel as a stocker my perspective isn't valuable to the organization, or less likely to be considered than staff in more similar demographics (age, gender, race, sexuality) to the management / ALT teams.","I think management does a great job of letting employees voices be heard.","While I do agree there are channels to communicate to management, there usually isn't a point since they don't listen to us and usually don't really try to make us feel heard.","I think that the department managers work very hard to provide a great work place for employees and are only hindered by the higher powers that be.","seem to be doing a great job","I have seen cases where an employee repeatedly fails to meet standards and this is overlooked because the employee is well-liked.","tOO DISTANT","When a temporary general manager fired the entirety of the HR department over (rumored) harassment litigation it severely damaged the level of trust in management, and especially the board, that I and many other employees had. I do not believe a temporary manager should have had the authority to fire managers, especially HR, and I firmly believe the firings were retaliatory (and thus illegal)..","management team is great!","I wish that I knew more of the management and specifically the HR  team, or that they would introduce themselves to everyone.","Estoy deacuerdo con los reglamento que tienen","Staff are treated inconsistently depending on their supervisor.  Things that stand out to me are inconsistent treatment of staff regarding punctuality and attendance, handling time off requests, conducting evals on time, wage placements and inconsistent expectations of staff performance.    The treatment of salary hours has been inconsistent and to my understanding against BOLI guidelines.  BOLI suggested I submit for reimbursement of hours that were taken from me while I was a manager, but Mark (Finance manager at the time) was “mistaken” about how long our contract with Paycom lasted and we lost access to our historical hours, so I couldn’t get the data I needed to submit.  He supplied me with a “download of that data”, but it had glaring errors. I knew if I asked for the real Paycom data we would have to re-up that expired contract and I’d be resented even more.  I never got those wages back and I believe that Store Managers still use PTO to cover any hours under 40 down to the minute, but it doesn't go the other way when you work over 40 (at least not equitably).    I no longer feel like there is a point to expressing any grievance.  Admittedly I have not tried Natasha, but in the past I have expressed significant concerns about policies, fellow managers and admin and was left feeling ignored and quietly resented or retaliated against.  Those concerns were expressed to Store Managers, HR managers and several GMs in the past 2 years.","I would like to mention there is a bit of a disconnection between ALT and operational hurdles of staff working directly on the floor. There are departments that need more support from floor staff, increasing labor in these departments will aide in our growth at South. I also think asking department managers to take their entire team off the floor to meet once per month is unrealistic, quarterly was a bit more attainable. There is barely any one to cover the floor during these meetings which limits how much we can help customers and reducing overall experieince and sales. If support was provided for floor coverage that would be ideal.","I feel fine about my position within these perimeters, but don't have equal confidence for other departments.","In the department I work in, I hear many things including how other department teams are feeling about their supervisors. So as it turns out there are managers that don't operate in this way, that are not approachable and are not team players. They treat workers as if they are a nuisance, not respecting them. One of them specifically is a manager but isn't supposed to be managing people  or trying to \"manage\" them, not his job. He is only the brand manager and should not be bossing people around in the matter he does. He is making a very unsafe work environment for many people, due to targeting the female gender as if they don't know how to do their job.  The upper management are not even really seen on the floor but they seem like the could be receptive for feedback except many folks have reporting to them and nothing has been done about it. More staff have been fired for speaking up then managers have changed, so that is very concerning. ","They treat some people differently for doing the same things / making the same mistakes as others","I have worked here for a while and have seen different GM's and HR in my time. I have answered these questions with past experience as much as current. As I feel some old ways of doing things remain and hope to see better improvement in this category with the new HR and GM team.","Overall management is good, however there are still some corporate like work activities that I think should not be a part of the Co-op culture.","The deli management is phenomenal and the best I've had across all my previous employment experiences","never let Melanie or David HJ leave. we love them.","I think my issue is more with the allocation of resources through the coop. every department has been running on a skeleton crew probably since covid. which was probably fine while businesses and people were still recovering, but now that mostly everything and everyone is somewhat back to a level of normal, we are in no way sufficiently staffed even on our best days. one callout should not completely gut a department for the day, and then shift that responsibility to the PICs, department managers, or that departments floor staff. our staff are not super heroes or octopi, they cannot be in three places at once doing the job of two people for one pay. and then still be expected to keep a smile on our faces and not completely burn out physically and mentally. yet it happens in every department and everyone sees it and nobody has done a thing about it. and I dont feel like its fair to blame it on the labor budget while your employees are actively deteriorating and doing the best they can with no reward or acknowledgement. I think they only way to resolve this issue is a complete restructuring of our budget WITHOUT THE BOARDS INPUT. because it is my opinion that, if they truthfully have no idea what is going on on the sales floor, and are not willing to jump in and help, they do not deserve to decide what our labor and health is worth.","There seemed to be confusion this year in the transition of management/HR positions. A general lack of clarity in the delegation of tasks between management/HR some issues for employees. Some employees did not receive benefits when they were eligible, up to a majority of this year and most of last year, this was due to a breakdown of communication between management/HR/finance and directly resulted in employees missing out on benefit dollars. There needs to be better communication and accountability going forward to better support our co-op staff.","social awareness could be better, we are all going through it right now and a lot of us have marginalized identities that can make work difficult","While I understand that the situation was messier than I really understand, Anthony Mattos still working here shows how the depth of nepotism at the co-op. Someone in my department brought a grievance towards another employee for telling her he had a dream about her, and he had his entire schedule moved and was required to not be present while she was working. Anthony Mattos had several sexual harassment complaints brought up, but since the only people who still worked here were considered unreliable, ALT disregarded complaints from previous employees and prioritized Anthony. Anthony also previously was romantically involved with a member of the ALT team, which in the previous employee manual was an unallowable relationship, yet relationships between managers and their employees in other situations were unacceptable. Just another example of unfairly applying policies when it's favorable to ALT. Additionally, the commissary was rebuilt just small enough that it wasn't required to include an elevator, further showing how the co-op doesn't prioritize disabled employees or making the co-op more accessible for future employees.","When long-time employees leave and we get a log note saying their last day was a few days ago without any explanation or context, it makes my employment feel somewhat precarious.","Everyone so far has being pretty fair for the most part. There are sometimes days that which feel like there could be a little more direction in what the direct tasks of certain employees are supposed to be doing on their day to day, but overall things are pretty alright all things considered when entering a new work position in a new enviornment.","The GM is very visible in the company, has an open door policy, and has a positive impact on operations. It's unclear what the Leadership Team provides for the company. I know they meet. I don't know what they necessarily provide for the organization. Perhaps a monthly or quarterly update on things they have been working on could help."]},{"Question":"24. Comments about Workplace Communications?","Comments":["Listen and engage in two way timely communication with employees, whether it's face to face or via email.","I feel that a significant reason I feel informed about what is going on at the co-op is because of my owner status. Much of the overall happening information comes from those marketing emails. I do feel that decision-making is a bit slow at the co-op and this could be an opportunity for improvement, although it probably contributes to the relaxed atmosphere which is a nice day-to-day perk.","Generally communications are adequate to function reasonably well.","This varies a lot based on department, for example I think Front End excels in this category but I have heard about the ways in which other departments struggle to communicate and be heard by their management.","The workplace appears as though it is comfortable and the culture is fun. Overall, this is what impressed me about the co-op.","I feel like their is a breakdown in awareness/knowledge by the Finance Committee/GM who determine the amount of labor dollars that are allocated to each department.  Overwork, overwhelm, working shorthanded, too much to do/too little time or labor, do more with less, don't worry about doing your best just shoot for average.  These are the messages being put out either explicitly or implicitly.","Can we make board meeting minutes accessable for staff to read?","Communication at least in the commissary has broken down a bit since the open of the newer kitchen. While I may have a general feel for what's going on a lot of it is more word of mouth through coworkers than a direct communication from management. It can be difficult to find time to discuss workplace grievences and feel like I'm maintaining the work I need to complete, concerns brought up are dealt with relatively fast but might depend on who is concerned. Input the cooks have for recipes and such are only sometimes addressed.","Being in the commisary feels like being in a different workplace all together, besides shared break spaces.","I think that when channels for communication are used effectively and honestly, we become more successful, like in the commissary! I think the already small management teams are spread thin in responsibility, so they don't always have the time to make a good faith effort toward improved communication in any of this section's questions. I think often people take action that they consider \"going the extra mile\" but because of being overburdened, fail to acknowledge that they're neglecting what *should* be the baseline expectations of staff!","I think the Log Books are a great source we have at the Co-op to stay in the know of everything happening at the store.","As I said previously, the majority of our ideas are either flat out denied without much reason beyond \"it's not in budget\" or completely swept under the rug. I've known a lot of people who really really cared about the co-op and genuinely felt excited to make suggestions to make it a better place who became complacent because they weren't heard out or their ideas were brushed away.","Because management wants to carefully consider all suggestions and, combined with heavy workloads - especially during transition - sometimes the responses may seem untimely but I would rather wait to be heard then not being heard at all or being put ahead of another request.","The prior year did not increase trust in upper management's ability to communicate. However, Mark has been a long-time employee and is much more trustworthy than his predecessor, and our HR department has been visibly working hard to make sure that department is up-to-date and communicates openly.","Co-op going-ons are sometimes lost in the high volume of signage throughout the store.","Creo que puedo comentar sierras cosas con las que yo puedo compartir","I have an email folder called \"The Abyss\" for all of the emails that haven't been responded to by admin, sometimes referring to things as significant as money that had gone missing.  I'd try more than once too.","It would be amazing if all log ntoes going out in the all staff log were shared with supervisors so they can reference them in log notes for their own department logs. As much as we ask not everyone reads the staff logs but do read their department logs.","Communication within my department is fine, trying to communicate between departments tends to be less effective.","Why do things only change when either someone gets injured or almost? I've noticed as long as you can figure out how to make it seem like managements idea then change can happen. Otherwise sometimes even if it makes absolute sense in my department flow, change never happens because management can't seem to see it from our perspective.","The GM is very difficult to get anything from. He is often over working himself trying to do everything. He needs to find a balance and when will Finance team be able to not need the GM as much? My direct supervisor is management so this question is answered in both outlooks weighed together.","I am satisfied with the workplace communications.","i think we need a place to track recommendations and suggestions down so they aren't lost to time or aren't souly put on management to remember.","Appropriate and overall very kind interactions","In regards to Question #20, employee ideas make a difference at the co-op when they are listened to and carried out. In regards to Question #22, the logbook is always updated and my supervisor always keeps me filled in. I wish there were more time for department staff meetings and all staff meetings to get a broader view of the store and it's respective departments","everything moves SLOW here","the world needs many more organizations like this","some ideas from huddles/meetings have sort of been put off","Good from individual store managers but poor from HR","As a commissary employee, I really have little to no interaction with co-op management, which is why I put \"No Opinion\" for most of these. I honestly have no idea how management reacts to communication","I am very comfortable with my position here at the Co-op and communicating with my coworkers. I have never had any negative experiences with any of my coworkers and I feel that my input truly does matter.","Bill is excellent and amazing about responding to my questions, comments, and suggestions. I never hear from the rest of ALT and don't feel like I have a good avenue to bring things up to them. I feel like I can talk about some parts of my background and cultural experiences, but others are not viewed favorably by some and I make a point to just not bring those up because I don't know who will judge me or argue with me. While communications about what's going on at the co-op are ok, I feel much more in the dark about updates compared to when I was in management. I brought questions and comments to HR related to the new employee manual and I haven't heard anything in response yet.","My suggestions get heard eventually, but often it requires multiple gentle nudges to the higher ups to remind them.","Not really. Everyone seems pretty great and not afraid of problem solving or conflict resolution.","The community involvement and staff support is there, however it does seem like the different departments and management are a bit siloed. People clock in, clock out and go home in some departments. There was an owner's day at the park, staff was told about it through the log book, but I didn't get the sense managers where wanting staff to come and hang out, outside of work. I don't know if summer parties, or holiday get togethers ever happen. In general, the log books are ok, but if they could be combined with bulletin boards where staff could post about fun things outside of work, that might be nice."]},{"Question":"28. Comments about Compensation?","Comments":["Compensation feels low for leaders, and often employees make a significant amount more than their managers. I also feel like a lot of people choose to work here with lower wages because of the perks of the culture which is valuable.","I feel that the PTO banks for vacation and sick time should be separate. For example, it would be better if we recieved X amount of vacation time per year, and then accrued sick leave in a fashion similar to how we do now. Also it would be nice if we could get a better insurance provider","While I do think I'm paid fairly compared to other jobs in the area, it still doesn't quite feel like enough. It would be nice to be able to shop at the store that I work at, but at my current pay level that is not sustainable. This is more of a systemic issue throughout the US admittedly, I do believe that First Alt does what it can to have fair wages and I appreciate it. I really appreciate the benefit dollars program, the small bonus every paycheck from that program makes a huge difference to me. I feel like the staff discount could be higher, especially considering that board members get the same 15% off as we do. I feel like the people who are actually in the store working every day should get a bigger discount than those who come in from time to time. As far as PTO goes, this is my first job to have it so I definitely appreciate it, but I wish we had a separate sick pay bank. It sucks having to use our earned PTO for unavoidable and unpredictable sickness, and it seems like most other places have separate PTO banks.","It is disappointing to be given such a small compensation for the experience I have in this field. Overall, this is an area where it appears as though there is a lack of understanding of current cost of living and the correlation between the work being done and the expectations. With this, it makes the employee not feel as appreciated for the dedication they can or will put into natural foods and the like.","Even though we are paid more than minimum wage, the wages have not kept up with the cost of living in the area.","I am against private health insurance on general principle and believe our country should have a universal system. The Co-op seems to make do with what it can, but our private health insurer's transgender health benefits are lacking, which has led me to desire less hours that I may get on OHP. Ideally, I would be able to work more, but it is what it is. Premiums went up a ridiculous amount in 2025, as well, in a way that seems difficult to square with what we are paid. The benefit dollars that the Co-op gives to employees *is* nice, however. As for pay increases - I do not like the needs improvement / meeting expectations / exceeding expectations system. In my view, if someone is good enough to work here for the better half of a decade, they deserve the full raise. There is only so much growth one can do in a stable position.","no one i know has ever gotten the maximum raise. it is at best one level below that. this makes it clear to me that hard work will not be reawarded and makes me less likely to apply myself.","A number of staff are capped out for wages so no longer receive merit increases and there is nothing in place to recognize or compensate for good job performance.","As I have been here around 8 months, I have not had an employee review or a way to see how my performance appears to managment. also no chance for a raise without the evaluation.","The gist of the constructive feedback I received on my annual evaluation this year was that I \"need to fail more\" and lost 0.5% off of my maximum annual pay raise. I don't think there is consistency as an organization for how compensation is awarded.","Oftentimes we have to solo close, which is essentially doing two jobs when we're only paid for one.","no matter how great an employee is, evals are often late so pay increases happen late","I wish there were more opportunities for growth/higher compensation without having to enter management. I feel that I climbed the ladder as much as I am interested ibn without entering management and feel stagnant at times. I would like to see higher compensation offered for completing cross-training in other departments.","The world is an expensive place and being paid more feels like a need sometimes too","I wish we had a sick time pool to pull from. I understand there might be some limit, but getting sick uses our PTO as far as I understand. Recovering from sickness shouldn't take away from necessary relaxation/recovery from work.","I have consistently seen raises on top of COLA increases, with management explaining in detail why those raises came about. I feel it is rewarding to have both that feedback of what I'm doing well and the monetary bump.","I do not feel I am adequately compensated for the work I bring each day to this department, especially when you compare my work to the work my co-workers do. It also makes no sense for the final say in Annual Performance Review raises to belong to a Wage Committe who, for the most part, has never met me and has absolutely no clue about what I provide to this department.","For the most part, yes, but mostly my pay increases reflect how much work I put into my eval form. I do not believe the forms accurately assess the quality of anyone's work in the kitchen. They generate nonsense responses.  As far as benefits are concerned, our insurance is not great, my dental insurance just dropped my dentist.","I've had no pay adjustments for my work. Though it is from changing positions.","Estoy de acuerdo con los beneficios recibidos por que hay otras compañías que no dan lo suficientes beneficios que me ofrecen","For MANY years COLAs have been more than the possible Merit increase at evaluation time.  That is demotivating.  The wage cap for a salaried manager is too low for the area and makes it impossible to afford to buy a home.  Eventually I came to the conclusion that it's not the co-ops fault that I've outpergf=formed their wage scale, but it does lead me to think we will lose quality staff beause we're not willing to do what it takes to keep them here.","I think folks stick around for the supportive work environment not the pay. I think a lot of departments juggle multiple hats and are not always compensated for doing all of them. As a manager I am on Salary but I do not get a full salary if I am not clocked in for at least 40 hours. This does not take into account all of the texts/emails etc. that are recieved off the clock with urgency. I have been here awhile and can do the same job faster because I have more experience than my counterparts so why am I docked for being more efficient?","Removing more affordable healthcare options was unfortunate.","I appreciate the consistent COLAs. The gleaner and staff table genuinely make a big difference in my quality of life, I would not be able to afford to shop here without the gleaner + staff discount. I do not feel like my 6mo evaluation was a fair assessment of my work and I was disappointed to receive the lowest wage increase. My evaluation was 4+ months late and I have not received backpay for that time (I've brought this to HR's attention)","Pay increases are usually cost of living adjustments which don’t have anything to do with job performance.","More could be done to help people understand how pay here is quite good with all the other benefits we get. Most grocery stores you can take home as much free food. Plus Management doesn't grind us so hard like other stores (which maybe they should more sometimes), so it does make it way easier to work here.","I think the discount is a little on the low side","We should reevaluate the pay cap.  Pay does not keep up with living wage.  Would like to get an IRA where co-op matches my contribution","About question #29: I don’t think grocery should be at the very bottom of the pay scale. I understand it is somewhat of a majority of workers but I also think that it is a lot of what allows the store to run","I believe the compensation is very low compared to similar roles in other companies. Apart from the compensation the benefits aspects such as paid holidays are only 2 in the entire year.  My assumption would be that working at a Co-op that cares for the well-being of employees would have much more holidays than a typical corporation.","Co-ops notoriously can't afford to pay higher wages for management positions, but it can be challenging at times to have such a tight PTO accrual and base level wage as an upper-level staff member","i work my hardest no matter how much i am paid","I'd always appreciate more","I feel fairly compensated by the coop given the capitalist, union-less, corporate focused, billionaire ruled society that we live in.","Needing to exceed expectations for a year for a *chance* at a *maximum* of 4% raise after self review, peer review, and a meeting is insulting.","I was eligible for full-time benefits at the three-month point of my employment, but accessing those benefits felt very difficult to me and I could not get any full-time benefits before I had to go down to part-time and became no longer eligible.","I am maxed out on pay so I will not see anymore pay increases.s","There are inherent flaws in the performance review process. My manager does not spend enough time with me to know the quality of my work. They have to instead make assumptions and guesswork to complete the review. Many of my achievements were left off the review, despite listing them myself.","When your salary/wage is capped, I don't feel the pay increases reflect the quality of job performance.","great all around, and when you consider the intangibles of this group we're top notch","There is no reason for a dishwasher job to be lower paid than cooks in the commissary, it is more difficult and skilled.","pretty happy with the pay","My recent placement for my promotion felt very inconsistent with my previous experience here and the amount of work and dedication I put in for our store and my department. It didn't take into account my longevity here and earned merit increases. I built up to the job and accomplish the vast majority of it already, and it felt like that didn't mean anything based off what HR saw on paper, despite what my manager advocated for me. It took them a few months into my new role for them to even figure out what my placement was. Our new HR Manager seems to have a new criteria for wage placement that is inconsistent with the previous and doesn't value the natural foods retail knowledge and co-op experience that it used to.","Not enough","I reached the cap on my pay scale about 10 years ago, so have had no merit increases since. I receive COLAs and other adjustments that happen, but no merit raises.","The time off system is pretty convoluted and strange to me. All of my previous jobs have been so much easier in regards to time off, as long as I requested time off far enough in advance, I would get the time off granted. I've never felt so incredibly restricted with my life and time. Thinking about trying to get time off is such a big stress every time, especially because I pretty much have to count on rarely ever requesting time off unless I have a ton of PTO. At all of my previous jobs in my 11+ years of work history, I would just get my time off requests approved and then I chose whether or not I would use any PTO for that time off. The whole time off system at the co-op is really my only true qualm with working here, and it's a big qualm. I want to be able to request time off without the stress and pressure of needing to have PTO built up. And the whole unpaid time being \"capped\" at 40 hours per year is just bizarre. Perhaps I cannot even fully convey the extent of how much I detest the time off system at the co-op..","I appreciate that the co-op is aware that we are not paying livable wages (via the 2024 annual report) and would like to keep working towards livable wages. I'd love to see health insurance more accessible to those working less than full time. It's really only affordable if you're full time and only paying for yourself, but working full time doesn't always make sense, and it's not family friendly. I'd love to see more communication from HR about benefits evaluations. Can they look into how much it would cost to provide healthcare to folks at lower hours like at 20 hours. If it's not fiscally possible that's fine, but I'd love to see communications about things like that, like \"hey we looked into this and this is our evaluation of how much it would cost if we did x, y, or z, and why we decided to only offer x\" or something like that, rather than just \"we're offering x\".","Health insurance is abyssmal everwhere, but at least we have it here. My pay is fine, relative to other employers in the area, but the capitalist system we are stuck in keeps us poor.","I have very strong opinions on the horrible slope trend of wages compared to cost of living for the common folk. It could be better and should be better. Statistically speaking through out the last 100 years of our economy's progression does not line up with what folks are paying. Cost of living has far surpassed what is being provided for entry level employees. There needs to be a change. The balance is not there.","Please consider increasing PTO. Perhaps two buckets that build simultaneously: sick PTO and vacation. I know some of the more senior staff accumulate more time off faster. This was felt by staff over the summer months when most of the managers were on extended vacation and assistant managers covered."]},{"Question":"39. Comments about location operations?","Comments":["There are a lot people who have the mentality of \"this is how we've always done it\" meeting others with new ways of thinking. So there's resistance to change for the sake of improving operations in all regards.","They appear to be fit.","It would help if there were an additional scanner or two, and more sets in Catapult.","We currently only have 3 seats at both stores and alot of employees place orders with this software. We have problem with excess of inventory in backstock and organization is chaotic.","i feel some managers opt to not answer pages sometimes","We don't have much space, so we are constantly having to move things back and forth and try to squeeze by each other. The parking lot is too small for how busy we are. We have too many bins crowding aisles making it difficult for staff and customers to move around. In the parking lot, we still need bollards to keep staff safe from cars.","Organization in the Commissary could be better. Generally coworkers and managers when on shift are easy to work with and coordinate with, but it borders being in spite of the systems we have in place more than a natural coordination. I don't think we're understaffed anymore but sometimes the organization can make it feel as such.","the only reason the area seems unsafe is due to the homeless","The parking lot is mostly safe but I have seen people trying to get into car doors that didnt belong to them. To be safe I lock my car and do not have valuables inside.","there is always room for improvement, but there are a lot of fantastic staff onsite who work towards making us successful!","There are unstable shelving units in backstock that have repeatedly been recorded as being a problem, but nothing has been done about it. Also, while safety matters are promptly recorded and discussed by the safety committee, often manager action after the fact takes quite a while and solutions are months and months away from when the initial incident took place.","The parking lot still feels very unsafe following the car accident, as evidenced by the fact that a car recently hopped the curb in pretty much the same spot and went onto the sidewalk. More safety measures like concrete bollards should be added in front of the window facing spaces at a minimum.","We do have some miscommunications from deli to commissary that cause issues or confusion from time to time. Most of this is resolved by supervisors but can leave the impact of our work unclear if expectations are not communicated.","The Produce backstock and cooler situation at the North Store is an absolute joke. It is literally just a hallway that we are expected to find room in for large quantities of product. The coolers are tiny, crammed, and unsafe to maneuver in. No floor drains means frequent pooling water. Impossible to use proper body mechanics when attempting to move product in or out of the coolers. And like I said, it's a hallway not a proper backstock storage area, so people are constantly walking to and fro throughout the day.","Practices in grocery are not scaling well with the continued growth of the Co-op. Processes have redundant lifting of heavy boxes and can cause disorder when stocking UNFI shipments. Lack of Active Inventory system places large burden on purchasing crew. Occasionally there are not enough handheld scanners or Catapult login slots available, especially when UNFI orders are due (3x/week)","Las condiciones son obvias para trabajar y tenemos contactos con quien dirigirme","We had a car crash through our building last year.  It almost happened again in the same spot about 3 weeks ago.  We still haven't installed bollards to keep that from happening.  I have panic attacks at registers 1 and 2 and my heart drops every time I see a car pull in too fast.  The car trashed a register set and the co-op still hasn't replaced it over 18 months later.  Every day I work I have to see broken wood, tape and scratched plexiglass where my friend almost died. We still have a broken kiosk that insurance should've already reimbursed us for.","The addition of the second SOS PIC was very helpful with increasing the inter departmental cooperation. I almost think we need another specific SOS PIC for the AM. Managers are desiganted PIC's but most tent to focus soley on their own department and are not always comfortable with current policies that fall outside of their own department.","Other departments have been struggling for a little while, makes it hard for the staff that are already running behind to be available.","Would be nice to have security officer in the parking lot at night.","Thank you SOS PICs, we would drown without you!","Mostly all good, there is not much cooperation between departments. Workplace collaboration could be increased to improve employee wellbeing and camaraderie","We should have gotten pylons right after the car ran into our building.  We need to keep doors closed so insects don't get into our back stock.  Better air flow in the maintenance room, the used rags should not be stored in areas where people work/eat","It would be nice to have more scanners and phones available for general grocery use, especially on days when people are ordering there are not enough scanners.","I think both locations operate differently because the locations in the parts of the city are very different from each other. The South store is located in more of a commercial zone and the North store is in a more residential area making it safer in a more local community,  while the South could be impacted by more foot traffic passing through the city.","Bulk needs a lot of work... there are no prior instructions from past leads about proper chill storage techniques, chill rotations, cleaning, sanitizing, and food area cleanliness and food prep sanitation areas","Often store policies are not applied at all, let alone consistently.","The way PIC's work and the amount of time and labor hours that goes into covering PIC shifts strike me as very inefficient.  Seems like it would be better if it was purely a Front End responsibility","For question 31 I would say I agree the workl space is safe except for when customers reach past me on the latter or if the bump into the latter","Need better safety for cars not to be able to smash into the building again","Most other staff are cooperative when working with my department, but there are areas where it is more difficult to get this cooperation.","PICs are all great and very supportive.","Requests for basic signage take far too long to be filled. Floor staff who answer the same questions over and over and over again for customers would like to see basic signs that help customers find things like the restroom, or a product that has moved.","The coop has great managers and assistant managers"]},{"Question":"43. Comments about Co-op Operations (between locations?)","Comments":["The stores operate at the minimal level of communication necessary between both stores. It feels like two different companies honestly.","Communication can be difficult because it seems there is no one method that can reach everyone. There does seem to be a bit of a confusing difference in staffing needs between north and south that is based on money made rather than what feels like staffing needs. I'm not sure how to solve that but it seems worth mentioning.","The other store feels very distant to me, I don't really know any of the staff over there and it doesn't feel like we're working together as much as it could.","It appears good at this time.","Everyone is so busy/overwhelmed, that the Grocery leadership at both stores have a hard time communicating/strategizing effectively.  The amount labor dollars allocatted to the Commissary and the amount they are allowed to exceed their budget is staggering.  While other departments are reprimanded for being slightly overbuget, the Commissary seems to be immune from corrective action.  Additionally, the amount of managers they are allowed to have is shocking.","10 days to complete this survey doesn't seem like enough time for 150+ employees to complete.","At North we rarely see members of the Alt team. We don't have much office space here currently, so hopefully they will be more present once the remodel happens.","At least in my department it feels like we can never get on the same page or someone wants to be contrarian. I don't think we completely fail at this, but there is undeniably significant room for improvement to me.","It's getting better, but it feels like North is left to take care of themselves, especially regarding administrative support. The remodel at North will help massively in balancing that inequality, creating space for Adimn to work over there..","definitely get an us vs them vibe from some","Same as the other comment.","Communications between the commissary and the delis are more often baffling than effective.","Inter-store transfers are not always completed thoroughly and in a timely manner.  MS Access process is easy to have things 'slip through the cracks'.","I don't find the North and South store comparable. It feels like North has to make due with shortage of space and budget while south is seen comparable to north store and given comparable if not more space and funding, when North is making the sales.","let South work with less labor for a change. North gets the shaft every year. Insulting.","There are a few issues that involve Produce specifically and that they at times bring in a lot of different products at North (usually multiple varieties of the same items that all have different PLU's and prices) while South has Customer experieince in mind and makes sure to avoid confusing price clashes. But they both share the same flipcharts which are used by FE. This has caused multiple issues in the past and North Produce managers are not really interested in considering customer experieince when pricing/ordering.","Other than the negative of having North location receipts unavailable, I don't have strong feelings either way.","We are supposed to be 1 store but it has never felt like that. We don't have anyway of knowing (by face) who works at each store. Way back before 2020 we had a board in the break rooms that had photos of everyone. I miss that!","I don’t really know much about it","More needs to be done to help improve collaboration between locations. Hopefully the North remodel will see more Alt team at North more often. Would still like to see more staff work at both stores on occasion.","There is a divide between the stores.  There seems to be a communication barrier.  Store management does not help facilitate communication, they just decide things without letting the departments work together","I think both locations do a good job working together to achieve the overall Co-op goal.","I don't know much about South store and I don't personally communicate with them often, but in the cases that I have, it has been a positive experience. I know we work closely to keep operations sucessful.","Resources such as administrative staff, upper level managers, and HR are not equitably distributed between locations. Our South store is treated as the primary location even though it falls noticeably behind in sales, service, and performance. Our North campus should be the main HQ for First Alt but it is left out of the picture most of the time","communications between the Commisary Kitchen and north Deli could be improved.","In regards to all of these questions, I am referring to my individual department in both locations. I don't have enough knowledge to judge for the whole store/other departments","There are times when changes are made because of the north store with no explination or consideration for the south store. The labor budgeting between stores also seems absurd. I can understand that they have a higher volume of customers, but at a certain point there is a minimum staffing requirement to be opperational that it feels like is sometimes overlooked.","I personally haven't had a lot of interaction or communication with the south store or the employees there","At times one store has to much or too little product and that doesn;t get shared communicated or prices adjusted in a timely manner.","i really don't know the between location communication, cooperation, etc., but i am certain that if i wanted to educate myself i would be able to learn. And i expect i'd find high levels of interstore cooperation, etc.","seems to function smoothly","The 2 stores are run with different attitudes and expectations. I see areas where so much more communication and cooperation between the stores could make them both run more smoothly.","Would be useful if both stores had access to each others' transaction history.","I rarely if ever understand what's going on at the South store and the commissary. I think the locations could work more effectively together towards common goals. Manager meetings that involve managers from all stores more often than once or twice a year would be a good start.","I appreciate that we have the other store available to call for help and support. I like that I can make a Page to the other store from any phone, and they can respond immediately.","There seems to be a view that the coop is broke and can't afford to fix things, or replace older equipment. Perhaps twice a year updates on how much money the coop is spending on tech, equipment, imprevements, etc. so staff feel better about this issue."]},{"Question":"50. Comments about Department Operations?","Comments":["I see opportunities to improve productivity and staff experience, but that there would need to be more income brought in to make changes, and I don't see an interest in efforts to generate more income. Maybe that's okay though to keep the co-op culture. An example would be the electric car charging station, maybe we could pay higher wages if we make an income on that? Maybe that's in the works, I'm not sure.","I love Front End and genuinely feel it is the best department to work in at FA in terms of management and team morale. Although it is tiring to be the front line for customer service in the store, our management and team does so good at communicating and supporting everyone.","Our department works well together.","The majority of the department staff are new and we have a very friendly culture. There is way too much talking during shift time that the work isn't getting done. The work pace is also very slow as if there were was no get products put away.","At times it feels like people are treated differently based on how much a staff member is liked.","Department meetings have been unable to happen for quite some time, I feel it has made some operations more difficult. Communication between the halves of the week is a game of telephone, sometimes successful sometimes not. While I feel respected I do feel some people may be less so. Its hard to coordinate ways to increase productivity and keep all of us feeling happy and respected when we are unable to be in a room together without having to actively work. There isn't strong defined goals or if there are I feel as though they do not resonate within the commissary","In my experience, the effort toward successful department operations is weak. I think we often repeat the same mistakes.","I love the FE department at North. Alyssa and Ella are exceptional managers.","I love my dept!","Regarding the following question (#51) I would really appreciate the Deli having dedicated meeting times the way the Grocery dept. does.","Not sure our goals are clearly defined, besides \"make enough to break even.\" But we've worked hard to make the kitchen a good place for everyone.","Daily goals are not ideally defined and can vary from individuals. Overall goal of the store is consistent, but department-wide are less-so.","Si estoy desacuerdo con las reglas que tenemos dentro del empleo","North management team is awesome","My department is very collaborative and are all really trying to keep their own departments afloat. I appreciate my team and their efforts to assit me if I ask.","No complaints.","The north Store Manager sometimes struggles to connect with the people he manages. He struggles at times to absorb and react to people concerns consciously. Change is slow and small steps toward improvement are made if the resolution is too difficult otherwise.","Students seemed to get priority scheduling","I think there is too much emphasis placed on past grocery experience. It’s weighed very heavily in hiring and pay. Stocking is not a difficult job and doesn’t require past experience to pick it up quickly. I am an intuitive learner and pick new things and systems up quickly and shouldn’t get paid less because I didn’t previously put things on shelves.","There are a lot of department operations that are not valid anymore because as the business grows, the demand for a process change becomes more important to achieve efficiency.","It can feel like other members of my department require a certain level of \"hand-holding\" from admin/Store Management. They receive this help, but those of us who get our tasks done efficiently and singularly are not offered the same assistance. I would like to see the bar raised for work completion and accountability for running a department effectively.","In regards to question #51, yes and I wish there were more","communication is spotty and questions not always followed up with a response.","I feel like there is a barrier between management and employees. I feel uncomfortable speaking my mind and tend to remain silent during our meetings.","clear focus, skilled people all around, great team and teamwork","Perhaps if people communicated more instead of letting it pent up inside then we wouldn't be making other people feel uncomfortable around them.","My managers are very new and not as efficient as the last ones. That's fine, everyone does things different and they have a lot to learn, but no we're not as efficient as before.","We're awesome in the Front End!","Slight ways I would like to see things get changed. But overall the dept. is in a really solid spot.","I work in maintenance and there was no place for me to make note of that on the first page."]},{"Question":"64. Comments on HR Practices?","Comments":["I'm not confident that people are held accountable for their actions in this workplace.","I think at times we've over-valued internal candidates, and that we could have improved manager qualifications if we consider outside candidates a little more. The North Grocery Manager could be an example of this although I think we did pretty good.","We had a case of sexual harassment involving many people. HR did the right thing, but a manager who is no longer here protected the person.","We had a serious problem of having nobody working in the HR department for more than 6 months last year so that was not great. It seems to take a long time to fill vacancies like that, which is frustrating and upsets operations. I do think our new HR team is doing great and striving to make real positive impacts here! But it's not as accessible as it could be.","They appear to be working in the favor of the co-op.","The current HR department, I haven't had enough direct experience with to give a comprehensive view. Past HR (the folks who were here when I was hired years ago) left a lot to be desired. In regards to being treated equitably, I would say that people try, and sometimes miss the mark. In general I do not think anyone is trying to cause harm to others, at least not in the commissary. I have occasionally been misgendered, but it's not a big deal, just a bit uncomfortable.","HR always feels welcoming and honest.","I unfortunately previously had negative experiences when reporting a grievance to the previous HR team. I have an open mind to the new team, but I don't know if the channels I used previously will fail the same as last time.","Because of issues in the past with the previous firing of our old HR manager and an incident of intimidation in the workplace, I'm not entirely confident in being protected from retaliation.","the only HR reps who really seemed to advocate for employees ended up fired so not a lot of faith in HR","Regarding questions #52 and #51, the answers are accurate if this is the same thing as the Employee Handbook. I haven't been given something specifically called the \"Personnel Policy Manual\"","I have not worked with the new HR. I've been here so long, I don't know if I have received the Personnel Policy Manual","I have heard tell of some cases mishandled and hesitate to ask HR if I can ask my direct supervisor or handle things person to person.","As mentioned previously, a prior manager destroyed the trust in our HR department and the co-ops history of retaliation. I would appreciate clearer communication on what would/should happen in our organization specifically. In a related issue, the sexual harrassment seminar from last year was woefully inadequate.","HR is wonderful to work with!","Is \"in general\" really good enough? Either we are, or we aren't, treated equitably.","Nothing at the moment.","I know that the co-op will side with the management as opposed to the staff members. That is so concerning on multiple levels.  I hope this HR team will have more of a back bone and stand by staff.","Maybe HR can refresh us about everything they can help us with aside from interpersonal/performance-related issues? To my understanding, HR can potentially provide us with accessibility tools like stools/floor mats/things of that sort? Thank you!","Some people are treated differently than others sometimes, I believe based on their gender identity.","Previously the Co-op has struggled with this a ton, I have seen 4 HR managers in the short time I've been here. I hope to see more resolution with our new team in this Category. I have loosely answered this in relation to our new HR team.","I have no experience with HR.  They barely say hi, don't seem to know my name and I rarely see them at the store.  I have no opinion because I do not know them.","HR department is doing a great job","i am confused about \"channels\"","I have not gotten responses from HR to email questions.","I don't know what the Personnel Policy Manual is.","Natasha in HR is awesome!  Just wish HR in general had a presence at North Store.","good people doing good work and striving always to be and do  better","The role out of the updated handbook wasn't great. More communication was needed. Our HR department is also so new, I'm looking forward to consistency in what we can rely on them for.","Personnel policy manual is a confusing term...are we talking about the Employee Handbook?","In regards to Question #60, the only discrimination/harassment that I have ever witnessed was always coming from a customer towards either another customer or an employee. Fortunately it does not happen often.","HR didn't communicate that an update to the employee manual was coming, even to management. They didn't point out the differences, and included things that don't seem fair, and in some cases legal (saying that just continuing in employment means you're agreeing to everything in the manual, for example, regardless of signature obtained). I don't think HR did a good job communicating or taking feedback about it. I think I've seen the HR manager once, and never seen the HR assistant manager. I don't know them and don't know how much I can trust them because of that. I'd like to see them at North on a regular basis.","We could use a bit more help and support with using UKG (our HR software). UKG is clunky and unintuitive, and the resources for help are limited.","I dealt with an issue through HR earlier this year and it was handled very well, and gave me confidence that I am working in a positive organization that does want staff to have a safe, supported work life."]},{"Question":"74. Comments about Training and Development?","Comments":["There have been no training programs on DEI at First Alt, not for the past few years at least. But as mentioned before, the organization desperately needs it.","I did not receive an initial 6 month review & adjusted change in compensation as I had already been hired to another team higher in organization chart. I am unclear if that 6th month review would have changed my compensation in my currently position, or my rate of accrual of PTO etc","I'm proud to work somewhere that has as good of a training on diversity and inclusion as we have here.","Training is often delayed and disorganized making the training feel as though there is a lack of accountability. Often trying to get trained on my own through different outlets, management fails us in this way, making us seek new information on own which is not necessarily our jobs and through this it reflects on the co-op poorly with whine they have decided to place as new management.","My evals are always 3+ months late","trainings on diversity and inclusion have stopped  and haven't been done in over a year, and are sorely missed.","While my evaluations have not always been timely, I have always received back pay so it is ok.","Trainings for general Co-op seem to not often affect commissary members though I can't comment much because there aren't as many we're brought into past being a new hire. Maybe I don't notice them but I also don't see many trainings happening.   Commissary specifically I think could use better direction for general work standards and as such training can get messy. Work flow can also be hard to maintain so skills or knowledge can be outweighed by the need to just get the job done, not always possible or necessary for there to be growth from current positions","I said earlier but it bears repeating: I think evaluations are a useful tool conceptually, but I often feel like when people need correction or development, it is better to approach them and discuss how they can improve rather than dangle the promise (often not met) of a high raise in front of them. If we train new hires on the floor, we can correct and develop there as well. Goal-setting *is* useful, but evaluations often feel pointless to me this many years into working here. There is little I see that I can do to improve - I know how to do everything in my part of the commissary, and I work as much and as efficiently as I'm able.","I think the evaluation schedule needs to be upheld better. Orientation for commisary/bakery felt completely unhelpful/lack of representation.","I was told by someone on the management team during my 2nd annual evaluation that management had been, more or less, told to be more attentive to where they want to see improvements to reduce from the 4% maximum percentage increase. I was told a lot more employees who has previously received the maximum would likely see less. I can understand from a management perspective why, and to a degree, a financial view why this is important, but when I receive feedback on my evaluation about needing to \"fail more\" it doesn't tell me anything about my performance other than I am doing my job successfully and being chastised for it.","There are no opportunities to develop more skills.","training has never been adequate in my opinion","I haven't received any training programs on diversity and inclusion at work.","evaluation is a month overdue","I had orientation 3 years ago. I value the D&I trainings from that era, the most recent one was crap and I did not feel gave a realistic look at behavior in the workplace. Real Zero Tolerance Bullying policy from public school, I honestly felt condescended to as opposed to previous trainings that were specific and actionable versus abstract to the point of useless.","After a year I'm still waiting to complete grocery training, new cashiers in the last year have not been grocery trained despite it being part of our training checklist.","Onboarding training SOP is not well established, other than initial orientation process. minimal staffing leads to lack in training capacity by crew.","Si cuento con estos reglamentos","FE-Mgmt has done my eval on time.  When I was FE-M, Bill never got my eval done on time.  Store Support is a unique position, so the JD doesn't encompass all of it.  The only 2 people in the role used ot be managers and stil handle a fair amount of PIC duties even though we are 2 wage brackets below any PIC.","I think it would be good to offer retraining to staff that may need a refresher in some departments. I think since the new hire orientation has been revamped a lot of folks that have been around for awhile may have recieved different info (I know the safety training is different from what I received!)","Having smaller window, clearer goals that are followed up on would be good, I often forget what my last objectives were long before updated evals.","The job is often \"easy\". The co-op doesn't push people enough - greater turnover in higher positions could be beneficial. The Co-op struggles to continue to challenge people as they work here longer and longer.","There seems to be quite a few people at the co-op that will not use the paging system.  This needs to be addressed","Grocery training needs more structure and less asking employees who don’t get paid that much to train new hires. It should be the job of the leads and managers","JEDI trainings went away.","Diversity and Inclusion work that began in 2020 was quickly left behind at the Co-op. I would like to see that important work resurface","To my new knowledge there are no programs about diversity and inclusion happening at the FA at this time.","Other coworkers and myself were brought on during a weird time, HR had been on leave and then were gone a short time after returning, we went a while without a new HR position being filled. My orientation was pushed back quite a bit, and felt quite silly to go through after having worked in the store for months.","very poor training in my department. very poor resources. very poor expectations. very poor review schedule, taking up to SIX MONTHS overdue. backpay is automatically applied but it's super hard to trust that it's accurate or actually make sure it is. these delays are frankly unacceptable from our management and need to be adressed immediately.","I have not been able to attend a new employee orientation yet, and my performance review has yet to happen.","for #73 I can't actually remmeber if I had a diversity and inclusion training but I was highered when HR was changing so that could be why?","Having commissary workers receive the same orientation as customer facing employees doesn’t make the most sense from the perspective of a kitchen worker. Further, the on-the-job training given in the commissary is oven scattered and not given by a manager or shift lead.","We haven't recently had training on diversity and inclusion.","perhaps an annual refresher training on DEI and job expectations","Trainings in general are a bit chaotic-there's a lot of information to cover.","I think my evals are a bit silly at this point, being here more than 7 years. I feel like my managers have to hunt for improvement for me, and I'm close to being capped out so it's not very motivating anymore. Evals tend to seem more effective for newer folks, and being less relevant in later years. There was some communication about the importance about not discriminating against religious or political beliefs, but it pretty much stopped at some log notes and there wasn't much follow through.","The Co-op does a good job with training, but the \"Training\" mode in Catapult POS system is so limited that it isn't very useful as a training tool.","the only things is i wish the transition was a little more smoother for dept. transferral but it worked out in the end so no outstanding complaints really on my end.","I have taken one survey here since I've started, and to my knowledge staff never received any update on what the coop was going to do with the info, if it was good, bad, etc. I have the same feeling about this survey, will the staff hear anything about how management will use the information? My evaluation process was fine and fair. Has the coop ever considered management evaluations by staff? It would seem a bit more equitable if that was the case, and I think it would help staff be more open to feedback from management."]},{"Question":"82. Comments about Supervision?","Comments":["South FE Management is the best! I feel so supported, more than I ever have at any other job! I have had people from other departments tell me they are jealous that I get to have Melanie as a manager because she does such a good job and is so fair and kind. That can not be said of other managers.","Most supervisors are on point.","Consistently delivers positive and constructive feedback, and works with employees to help achieve goals set by said feedback.","Management/Supervision at times seems stretched thin, the feeling translates further into the work force. While all are welcome I also feel that some ideas can be rejected based on who brings it up. Generally I know what is expected of me but for the overall commissary the expectations have gotten stretched around and sometimes lose clarity. The team seems stretched thin and it takes a toll on all despite a general positive attitude..","aside from the lack of review, I am usually made aware of my performance when it is positive. They are good at letting you know what adjustments need to be made without being harsh.","I appreciate things about my supervisor but there are a lot of areas of weakness. I feel uncomfortable giving feedback, feeling it will be dismissed or ignored, even if I have the best intentions.","I think my supervisor does an amazing job!","don't really know my supervisor","They are awesome!","Often one of my supervisors will leave work early, even if we are behind and could really use their help to finish the day.","The deli environment created by the supervisors is kind, encouraging and welcoming. I am happy to be apart of it.","Si recibo  en mi departamento este apoyo","My supervisor is very level headed, and really listens to concerns and makes efforts to really change things. I completely trust their dedication to the co-op's vision.","Really great to work with","Amy is the best there ever was, is, or ever will be","No notes, she is incredible","Anthony and Derek are awesome!","I don't spend a lot of time with my supervisor. I am mostly working independently. I prefer to monitor my own performance for ways to improve.","caring humans, skilled and engaged leadership / \"supervising\", enjoyable to know and work with","supervisors should be socially informed","I have thrice approached my supervisors with minor issues. I felt immediately listened to, and action was taken to resolve each issue quickly","Communication is excellent with weekly check-ins and constructive feedback."]},{"Question":"89. Comments on Job Satisfaction?","Comments":["I won't say it for a third time. What I will say is while it's still the best customer service job (not saying a lot) I have had, I am disappointed that it's not as committed to its mission. Seems pointless to have if we follow only half of it.","Generally I would recommend FA to people, but there are some departments here that I would not recommend due to poor management, high staff overturn. (deli, grocery/bulk)","The work is good and I appreciate the mission statement.","Even though First Alt isn't perfect, it is still a great place to work and I feel it will continue to try to be better.","Overall I've stayed with this job because I feel like a person and not a numbered employee, the work is inclusive and I enjoy the foundation of values that the coop has been built on. I think sometimes the values can be lost in the need to keep up with work but I'm unsure how that could be helped. The coop is a safe space for many folks and it's appreciated even if not perfect","Very happy here.","I really love my job, I love the co-op, I am not the type of person who would stick around if I didn't feel that way.","This is by far the best job I've ever had.","I feel appreciated by the team members of my depratment, but not necessarily by my managers.","overall i am happy to work at the Coop","My departments' commitment to an inclusive work environment has contributed to my overall job satisfaction. I'm proud of the work we've done in the commissary to make our coworkers feel safe and included.","Emphasis on quality culture for employees and customers is a strong factor that keeps me at the Co-op.","A mi me gusta trabajar en esta compañía por el apoyo que me brindan como trabajador de esta compañia","Satisfactory","I feel valued in my current department!<3  However, I felt notably undervalued and unfairly evaluated when I was in another department. Head management was not good at providing positive feedback, but very quick to provide negative feedback.","Is the Co-op better than most places, absolutely yes. Does it have it's own set of struggles absolutely. Are those better or worse than other jobs, hard to say...","Working here has been a significantly greater experience compared to my previous employments, and a big part of that is the team and management. I think the Co-op does a great job at hiring well-rounded and kind people that bring a positive atmosphere to the work place.","I love the coop, I love the customers, the vision, the staff, the community, and what it has stood for in our community. but the more profit driven it has become makes me want to be here way less. I hear old stories about what the coop used to be and how it took care of its employees and I just wonder where it went wrong.","recognition for going above and beyond is equivalent to normal appreciation for meeting expectations. exceeding is the expectation which is unfair.","for 85 I would say my job here is satisfactory and in my top three jobs but unfortunatly doesnt beat my first fav","Although I am not satisfied with my pay, I do like my coworkers and the general atmosphere of the co-op!","a very good workplace and community to belong to, take part in, share some lifetime with.","While the job duties themselves are pretty standard for the field, the environment and mission at the co op keep me more satisfied in this role than I would be elsewhere.","First Alt is truly a wonderful place to work, with wonderful humans, and great products.","It's alright 7.5/10","In regards to Question #83, I feel valued by some co-workers and supervisors, but not all. I definitely feel more valued by my customers than I do by my co-workers and supervisors, and for that I am grateful and fortunate.","This is a good job and I'm paid a good amount for what I do.","This is the best job I've ever had and I hope to stay!","Inclusion sometimes feels like an empty word, not just at the coop, but in general in society right now. It's hard to feel included if there's so little information coming out to the overall staff. How are sales, how is labor, what does next quarter look like, who, what, where, why?"]}],"results":{"Overall":{"response":"The overall sentiment from the survey comments is moderately negative (-0.203). While employees express appreciation for the co-op's mission, inclusive culture, and the supportive nature of many immediate team members and some specific supervisors, there are deep-seated and widespread concerns across multiple operational areas.\n\nA dominant negative theme revolves around compensation, with employees feeling wages haven't kept pace with the cost of living, dissatisfaction with the performance review and raise system, and inadequate benefits (particularly health insurance and PTO structure). Operational inefficiencies are also a major point of criticism, including severe understaffing, unaddressed safety hazards, poor organization, and a \"do more with less\" mentality from management, leading to burnout and stress. Furthermore, a significant disconnect is perceived in communication and trust, both between upper management/HR and floor staff, and between the two store locations, which often feel like separate entities with inequitable resource distribution. While there is a desire for improvement and recognition of some positive changes, especially within newer HR efforts and individual management teams, the prevailing sentiment points to systemic issues that impact employee well-being, motivation, and the co-op's ability to fully live up to its stated purpose.","sentiment":-0.203},"8. Comments about Co-op Purpose?":{"Sentiment":[-0.7,0.6,0.8,-0.9,-0.2,-0.1,-0.3,0.8,0.7,0.9,-0.7,0.3,-0.8,-0.3,-0.2,-0.6,-0.6,-0.4,-0.7,-0.9,0.4,-1,0.7,-0.9,0.9,0.9],"Highlights":["Mission Alignment Concerns: Many employees feel the co-op is drifting from its core mission, particularly regarding supporting local producers, sustainability (packaging), ethical sourcing (e.g., Israel comments), and fostering worker participation, often attributing this to financial pressures or a shift towards corporate practices.","Diversity & Inclusivity Discrepancy: While some acknowledge efforts and success in creating safe spaces (e.g., queer-safe), a significant number of comments highlight a struggle in truly accepting and honoring diversity across various groups (religion, race, disability) and express concerns about bias in management/hiring practices.","Positive Impact and Intent: Despite criticisms, there's a strong underlying appreciation for the co-op's admirable vision, its push towards sustainability, and its role as a valuable community hub, with several employees recognizing genuine efforts to uphold the mission."]},"16. Comments about Co-op Management Overall?":{"Sentiment":[-0.7,-0.6,0.3,-0.2,-0.1,-1,-0.6,0.1,0.8,0,-0.7,0.7,-0.8,0.3,0.7,-0.6,-0.5,-1,0.8,-0.2,0.5,-1,-0.7,0,-1,-0.7,-0.2,-0.1,1,1,-1,-0.9,-0.6,-1,-0.7,0.4,0.3],"Highlights":["Staffing & Resource Allocation Crisis: A pervasive and strongly negative theme highlights severe understaffing, managers burning out, and a \"do more with less\" mentality leading to increased stress, inefficiency, and a feeling that employee well-being is not prioritized. Several comments specifically call for budget restructuring and question the board's input.","Inconsistency, Bias & Lack of Accountability: Employees report inconsistent treatment by supervisors, unfair application of policies, perceived nepotism, and a lack of accountability for managers, especially concerning serious issues like harassment. This has led to a significant erosion of trust in management and HR.","Communication & Visibility Gaps: Many express a desire for more direct engagement with general management and HR, feeling a disconnection between leadership and floor staff. There are calls for better communication, more visibility from ALT, and a need for management to be more receptive to employee feedback and ideas."]},"24. Comments about Workplace Communications?":{"Sentiment":[-0.6,-0.2,0.3,-0.2,0.8,-1,-0.1,-0.7,-0.1,-0.3,0.7,-0.9,0.2,0.4,-0.3,0,-0.9,0,-0.2,-0.8,-0.6,0.7,-0.1,0.8,0.4,-0.5,0.7,-0.3,-0.2,0,0.9,-0.5,-0.4,0.7,-0.2],"Highlights":["Breakdown in Upward & Downward Communication: A significant number of comments point to a lack of effective two-way communication, with employee ideas being \"swept under the rug\" or denied without reason, and emails to admin going unanswered (\"The Abyss\"). There's also a perception of slow decision-making and a lack of transparency (e.g., board meeting minutes).","Impact of Overburdened Management: Several employees link communication issues to managers being \"spread thin,\" leading to delays, inconsistent information, and a failure to meet baseline communication expectations. This also contributes to a sense of isolation in departments like the commissary.","Positive Channels & Desire for Improvement: Log Books are frequently cited as a good communication tool, and some individual managers are praised for responsiveness (e.g., Bill). There's a clear desire for better inter-departmental communication, more accessible information for staff, and clearer channels for suggestions and grievances, suggesting a willingness to engage if systems improve."]},"28. Comments about Compensation?":{"Sentiment":[-0.3,-0.6,-0.4,-0.9,-0.7,-0.8,-0.9,-0.8,-0.6,-0.9,-0.7,-0.6,-0.7,-0.5,-0.6,0.8,-0.9,-0.8,0,0.6,-0.9,-0.9,-0.6,-0.5,-0.4,0.3,-0.3,-0.7,-0.5,-0.9,-0.7,0.5,0.1,0,-1,-0.7,-0.5,-0.9,-0.6,0.8,-0.6,0.7,-1,-0.5,-0.6,-1,-0.4,-0.3,-1,-0.6],"Highlights":["Inadequate Wages & Cost of Living Disconnect: A pervasive and strong sentiment that compensation, despite being above minimum wage, has not kept pace with the rising cost of living, making it difficult for employees to afford shopping at the co-op or even basic necessities. This is exacerbated by wage caps and the feeling that hard work isn't fully rewarded.","Flawed Performance Review & Raise System: The current system for performance evaluations and merit increases is widely criticized for being inconsistent, late, not accurately assessing work quality, and often leading to dissatisfaction or demotivation, with employees feeling raises are hard to achieve or even \"insulting.\"","Benefits Shortcomings (PTO & Health Insurance): There's a clear desire for a separate sick leave bank to avoid using accrued PTO for unpredictable illness. Health insurance is also a significant concern, described as \"lacking\" or \"abysmal\" (even if standard for the area), with calls for more accessible options, especially for part-time staff."]},"39. Comments about location operations?":{"Sentiment":[-0.6,0.2,-0.4,-0.8,-0.4,-0.9,-0.3,-0.6,-0.2,0.4,-0.9,-1,-0.5,-1,-0.9,0,-1,0.4,-0.6,-0.5,1,-0.2,-0.8,-0.4,0,-0.7,-0.6,-0.7,-0.1,-0.9,-0.2,0.8,-0.6,0.8],"Highlights":["Critical Safety Hazards & Unaddressed Infrastructure Issues: There is a grave concern regarding physical safety, particularly the unaddressed parking lot hazards (car crashes, lack of bollards, leading to panic attacks and physical damage) and unstable shelving. Multiple comments highlight long-standing problems with no resolution, leading to employee anxiety and visible damage.","Operational Inefficiencies & Resource Deficiencies: Employees report significant issues with inadequate space (backstock, coolers, aisles), lack of essential equipment (scanners, Catapult seats), poor organization, and outdated practices (e.g., in grocery and bulk) that hinder efficiency and strain staff.","Communication & Policy Inconsistencies: Miscommunications between departments (e.g., deli to commissary) and inconsistent application of store policies are recurring issues. While some staff members are praised for cooperation (e.g., SOS PICs), there's a clear need for improved inter-departmental collaboration and consistent enforcement of operational standards."]},"43. Comments about Co-op Operations (between locations?)":{"Sentiment":[-0.7,-0.6,-0.5,0.4,-1,-0.3,-0.4,-0.2,-0.3,-0.6,-0.6,-0.7,-0.6,-0.9,-1,-0.8,0,-0.6,0,-0.4,-0.8,0.7,0.6,-1,-0.4,0,-0.7,0,-0.6,0.1,0.6,-0.6,0,-0.6,0.8,-0.4],"Highlights":["Significant Divide & Inequitable Resource Distribution: There's a strong and consistent sentiment that the two store locations operate more like separate entities, with an \"us vs. them\" dynamic. Employees at North particularly feel under-resourced, undervalued, and \"left out of the picture,\" especially concerning administrative support, funding, and labor budgeting, despite often higher sales.","Poor Inter-Store Communication & Collaboration: Communication between locations is widely described as minimal, difficult, \"baffling,\" or a \"barrier.\" This leads to inefficiencies in transfers, inconsistent product pricing, and a general lack of understanding or coordination between staff and management across stores.","Desire for Unity & Transparency: Despite the current issues, employees express a desire for greater collaboration, more frequent cross-store manager meetings, and a stronger sense of being \"one store.\" Suggestions include photo boards to recognize staff from both locations and regular updates on financial health to address perceptions of being \"broke.\""]},"50. Comments about Department Operations?":{"Sentiment":[0,1,0.7,-0.6,-0.6,-0.8,-0.7,1,0.9,0,0.2,-0.4,-0.3,0.9,0.8,0.6,-0.7,-0.4,-0.6,-0.6,-0.7,0.4,-0.5,-0.9,1,0,-0.4,0.9,0.4,0],"Highlights":["Inconsistent Departmental Performance & Morale: While some departments, particularly Front End, are highly praised for excellent management, team morale, and communication, others struggle with poorly defined goals, communication breakdowns, and a lack of efficiency due to perceived resistance to change or issues with staffing.","Challenges in Management & Accountability: There are concerns about manager effectiveness, including struggles to connect with staff, slow resolution of issues, and perceived preferential treatment or \"hand-holding\" for certain employees, leading to a desire for raised accountability standards across departments.","Communication Barriers & Lack of Defined Goals: Departments like the commissary report issues with infrequency of meetings, communication resembling a \"game of telephone,\" and a lack of clearly defined daily or overall goals, making it difficult to coordinate productivity and ensure all staff feel respected and informed."]},"64. Comments on HR Practices?":{"Sentiment":[-0.7,-0.3,-0.5,-0.2,0,-0.1,0.8,-0.7,-0.9,-1,0,0,-0.6,-1,0.9,-0.4,0,-0.9,0,-0.6,-0.3,-0.4,0.8,0,-0.5,0,0.3,0.8,-0.2,0,0.1,-0.9,-0.6,1],"Highlights":["Deep-Seated Trust Issues & Fear of Retaliation: A recurring and strong theme is the profound lack of trust in HR and management, stemming from past incidents like retaliatory firings (especially of HR staff themselves), mishandled harassment cases, and a belief that the co-op sides with management over staff. Many employees express fear of retaliation for voicing concerns.","Lack of HR Visibility, Communication, & Accessibility: Employees frequently comment on not knowing HR staff by name, rarely seeing them at locations (especially North), and not receiving timely responses to emails or clear communication about policy changes (e.g., the new handbook rollout). This leads to confusion and uncertainty about how to access HR support or what services are available.","Positive Outlook on New HR (but with caveats): While acknowledging past struggles and high turnover in HR, several comments express a cautious optimism about the new HR team, noting their efforts to make positive impacts. However, this is often tempered with concerns about ongoing accessibility challenges and the need for more consistent and equitable practices."]},"74. Comments about Training and Development?":{"Sentiment":[-0.9,-0.4,0.8,-0.9,-0.6,-0.7,0.1,-0.6,-0.8,-0.7,-1,-0.7,-0.7,-0.5,-0.4,-1,-0.7,-0.7,0,-0.3,0,-0.4,-0.5,-0.4,-0.7,-0.5,-0.6,-0.5,-0.8,-1,-0.6,0,-0.7,-0.5,0,-0.4,-0.8,-0.2,0.2,-0.4],"Highlights":["Severe Lapses in DEI Training & Development: There's widespread concern and disappointment regarding the lack or inadequacy of Diversity, Equity, and Inclusion (DEI) training, with some stating it has \"stopped\" or was \"woefully inadequate\" and \"condescending,\" indicating a critical unmet need in employee development.","Highly Inconsistent & Flawed Evaluation Process: Performance evaluations are frequently described as delayed (months overdue), unhelpful (\"pointless,\" \"silly,\" or \"chastised for success\"), and lacking in clear, actionable feedback or opportunities for growth, especially for long-term employees who feel capped out or that their contributions are not recognized.","Disorganized & Insufficient Onboarding/Training: New hire orientations are often reported as \"unhelpful\" or \"silly\" due to delays and a lack of relevance (e.g., for kitchen staff). On-the-job training is perceived as \"scattered,\" lacking structure, and often falling to unqualified employees rather than dedicated leads or managers, indicating systemic issues in preparing staff for their roles."]},"82. Comments about Supervision?":{"Sentiment":[1,0.7,0.8,-0.3,0.4,-0.7,0.9,0,0.9,-0.6,1,0.7,1,0.8,1,1,0.9,0,1,0,1,1],"Highlights":["Highly Valued & Supportive Supervisors: A significant number of employees express strong positive sentiments about their direct supervisors, using terms like \"best,\" \"amazing,\" \"incredible,\" \"fair and kind,\" and praising their listening skills, responsiveness, and ability to foster supportive and welcoming environments.","Inconsistent Quality & Management Strain: While many laud their immediate supervisors, there are indications of inconsistency across the organization, with some supervisors being perceived as leaving early when needed, or contributing to a feeling of being \"stretched thin\" which impacts overall clarity and idea acceptance.","Feedback Concerns & Desire for Greater Engagement: Some employees feel uncomfortable giving feedback to their supervisors due to fears of dismissal or being ignored. This suggests a need for cultivating an environment where all feedback, even critical, is openly received and acted upon."]},"89. Comments on Job Satisfaction?":{"Sentiment":[-0.3,-0.2,0.7,0.8,0.4,0.9,1,1,-0.1,0.8,1,0.8,0.9,0.3,-0.2,0,1,-0.6,-0.7,0.1,0.2,1,0.8,1,0.5,-0.1,0.7,1,-0.6],"Highlights":["Strong Sense of Community & Inclusive Culture (Despite Challenges): Many employees express high job satisfaction stemming from the co-op's values, supportive coworkers, inclusive environment, and feeling \"like a person, not a numbered employee.\" The unique quality culture and positive atmosphere are significant retention factors, even if not perfect.","Mission Drift & Profit-Driven Concerns Impact Satisfaction: A recurring concern is the perceived shift towards being more \"profit-driven\" and less committed to its original mission (e.g., worker participation, ethical practices), leading to disappointment and a reduction in job satisfaction for some, who reminisce about a past, more employee-centric co-op.","Inconsistent Appreciation & Valuation by Management: While team members and customers often make employees feel valued, there's an inconsistency in feeling appreciated by managers, particularly head management, which negatively impacts overall satisfaction and motivation, especially when recognition for exceeding expectations is seen as unfair."]}}}