{"comments":[{"Question":"8. Comments on Co-op Overall","Comments":["I find that the co-op values all diversity and sets a great example to the community","I have worked at both stores and I can say that it is a welcoming environment that allows people to express themselves without judgement. The job I had before me was not aligned in my values and beliefs like the co-op is and it is very nice to be around like minded people.","At its core, the co-op succeeds in its mission to provide a positive experience for both customers and staff.","I believe that the co-op, although providing an opportunity for people to participate in a local economy, fails to effectively work towards its goals in a democratic manner open to all individuals, namely those who are employed with the cooperative and wish to have a voice in its workings. There is a significant lack of employee voice regarding the cooperative's operations. I witness a constant inconsistency regarding what information management has available to them and what they are willing to share with the employees.","Does not follow up on concerns with strong visible actions. There are no consequences for actions.","I would like to see our Coop set firmer boundaries around ingredients and corporations we choose to buy from. For example, not selling products with Red dyes or opting out to sell Pepsi or Nestle products. These corporations clearly do not share our Coop values.","The lexington co-op follows some co-operative principles and ignores others.","This is the best place I have ever worked and I feel honored to walk through our doors every day.","I do not see any representation for people who celebrate Eid since Buffalo has a high Muslim community. Even if there was just a sign that implicates we care about that community too","I think the Co-Op has changed in a big way. Its not necessarily bad change, but it feels a lot more corporate than it does a Co-Op. Our oldest customers, even some of the original owners don't agree with how the Co-Op has changed. One big example is, the members being able to volunteer work hours at the store. I think we can bring this back and in exchange for their work they can get a temporary discount for the day. (something to consider during our events and summer seasons)  I think it could help bring back the Co-Op feel and honor the original values of the store.","Hard for us to live up to to the “autonomy and independence” principle with the huge influence of NCG","I have been here about a year and have witnessed the environment of this Co-op as being supportive of the community and it's staff.","Noticeable improvement in attempts to operate within our cooperative principles over the past year compared to previous.","The Co-op overall I think has a good goal of where they want to be but may struggle to be open to new ideas on how to get there.","Significant financial decisions in the hands on non-employee board members should be heavily reconsidered in the near future, as well as a look at restructuring higher management surrounding different areas where contractors are no longer proving their reliability, or excessive contracts can be consolidated, such as pulling POS/WFM/Inventory softwares into one concise package.","Things feel less independent or democratic when department have decisions made for them without even hearing feedback. It doesn't mean we should get the final say- but actually involving your employees makes a big difference in gaining trust and support.","I feel the coop has made strides over the past year to feel more participatory for it's owners, as well as feel more like a co-op. There are certain things, like our product line, that can make things feel more homogenized because of our deal with NCG.","Overall I think the Co-op is good, but it falls short in a lot of places and it gets frustrating when as an organization, or at least the \"leadership\" corporate office refuses to accept or change.","I find it imperative that I pay attention to every bulletin posting and internal news update as \"our times\", and colleagues change so rapidly.  This is essential to working together as a cohesive team.","I feel that the way that higher management operations there is a skisim between the Co-op vision and the reality of the day to day operations.","Maybe more community education? More than just bakery classes","I think in today’s world it is very important that places like the Co-op exist.","I think we are doing a pretty good job of keeping true to our mission. I know that diversity hiring isn't always possible with the applicants we have, and I think we do a great job applying these principles when we're able to. For Question 5, I feel we are lacking in Education, Training, and Information outside of immediate job functions for workers - I don't think the kitchen could tell you much about the benefits of any of their food ingredients, for example. I personally couldn't tell you where we are in our 2050 zero waste goals. Etc. I think Member Economic Participation is very vague and doesn't feel like we have a strong vision for what that is. I also think we don't have true democratic member control, as we vote in board members, but the board's functions are extremely limited. I don't see that as a bad thing - not every board member would feel comfortable talking store operations and making suggestions - but it doesn't read as aligning with democratic principles within the store.","I think Employees should have up to three voting positions on the board, as they are most impacted by the board's decisions.","The place is a very friendly environment, friendly people.","I don't think most of the kitchen staff are well educated enough on the structure of a co-op to confidently explain it to a customer.","I love the Co Op","we are well informed of what is going on and what will be happening in the store","Its a pretty chill environment. Sometimes it can be chaotic but for the most part it is a nice environment to work in.","The transition from a true local cooperative to something that looks and operates more like a franchise is the biggest issue that I have with the way our business runs, and it is not something that will change. There are many things that I appreciate about how this business is different from others, and there are many things that I was disappointed to find are exactly the same.","Very disappointed in how some employees in the department are treated, specifically incidents of bullying. These situations have been brought to the department manager, but some of these situations have been swept under the rug and haven't even made their way to Human Resources.  I think the General Manager would be horrified if he was aware of this.","Fulfils an important role allowing people access to fresh produce in a food desert.","As a business I think coop does what a business is supposed to do well. Overall i think ones experience at the coop depends.","the coop has shown its biggest priority is profit.","Micro plastics are everywhere","A very inclusive and friendly place to work.","Working at the coop as a minority feels like it is free of judgement and harassment.","Proud to work for a business with our vision and values. I am also proud to work for a company that truly values diversity and inclusion.","I am unaware of what programs we have that support education on the importance of nutrition or cooperative principles","Overall the coop honors the principles that it puts forth. Sometimes its hard to see so few local options in produce. I know our climate prohibits the flow of local produce during the cold months. I think there is also some cognitive dissonance between the local promises of the coop and what we can actually offer. It's pervasive in our culture as well and I would love to see the coop being a part of creating greater awareness around the availability of local items. For instance showing customers where produce and grocery items actually come from. Perhaps putting signage out that tells customers when items have traveled very far from their origin, something to tell the customer that they are not buying local. As a work place I think that most staff do a really great job of fostering an inclusive and friendly environment. When it comes to things like heritage months and uncommon events or holidays its very nice that the coop also puts effort into catering to these as well as the common events/holidays. However it would be comforting to involve more outside groups with a voice that can speak to these specific heritage groups and educate all of us more.","per #6, it's easy to just say those things but we don't really put much work towards it (as far as i can tell) example: hot bar menu meant to celebrate black history month was made by 2 white men? AAPI menu will likely be made by the same 2 white men?","The Co-op is a welcoming place to all. I am very proud to say I work at the Lexington Co-op"]},{"Question":"15. Comments on storewide management practices","Comments":["I'd say management in general is very fair and approachable","The management between both stores it good even though sometimes I may not agree with every decision being made overall I do think as a whole they both operate well.","There are times where coaching conversations fall to the wayside, as they sometimes pile up at a pace that feels overwhelming and difficult to catch.  Particularly for TMs or supervisors that work wonky schedules.","Management practices range from inconsistent to abysmal at times, and I feel as if there is a significant pressure on the managers to perform in a certain way despite not having the tools or time to effectively carry out the jobs that they need to. I don't feel (except perhaps regarding the highest echelons of management) as if managerial failures are malicious, but instead spurred by overwork or underscheduling and myriad responsibilities that are outside of the scope of any one individual's actual capacity to manage. This having been said, I do not feel as if my voice as an employee is heard most of the time regarding certain ongoing issues, namely safety and overworking.\n\nStatements here marked \"No Opinion\" are done so to avoid bias; I have not had an opportunity to stress test these policies myself.","Uneven unclear discipline policies","There are times that management practices are fair and just, and other times where we lack as a united front to set standards.","Management practices feel scripted and sometimes lack a personal touch (when dealing with employees)","Management does not care about employees. Management cares about money.","The Co-op should keep working at making corrective action as consistent as possible.","I think we should bring back food donations for employees. There are plenty of my coworkers who are having a hard time with sustaining themselves right now, and with food prices going up, its only getting worse. We should be able to pick from the food donation or at least have a small donation area for employees in the break room. This would really help out so many of us during these hard times.","I have not seen anything that would make me think otherwise of the management and it's efforts to make sure that all people are treated equally-management is clear on their goals and visions for the Co-op.","The current system we use for corrective action is very well intentioned but a bit flawed. I personally have found it a bit difficult to keep up, especially with team members that have very restricted schedules that are hard to overlap with on a constant basis. I think that there is always room to grow in all aspects, of course. I would say that I have never fully trusted any workplace not to retaliate when they are forced to acknowledge potentially unethical behaviors, even if I hope it is true. The transition to a unionized workplace was fraught and bitter at times, and unionizing is a federally protected right - I think that alone speaks to my reluctance to strongly believe in a consistently safe reporting environment.","I feel the co-op is keeping up with other co-ops management practices worldwide.","Ideas, criticisms, and concerns can throw at anyone and everyone, all the time. We do not respond to them or take corrective action in a timely manner at all.","There needs to be a standardization of online communication set in stone moving forward using just one platform, paylocity, basecamp, and microsoft teams are all currently in use and can be streamlined, the grocery department is already working toward this. Minutes need to be taken in shared during board meetings and department/store huddles to effectively communicate important talking points missed in need to know as well as weekly sales totals and growth figures to those unable to attend these meetings.","Ideas seem to stop when given to managers, leaves team members frustrated","Over the time spent as employee, management has revealed itself as an a self-interested, opaque and dishonest entity within the co op. Sarah Love was an asset to management. That time of sincere interest and advocacy for the employee is gone, and has been replaced with I-don't-know-what","Things have seemed more consistent.","I love my managers 🤍","I feel like things have gotten better more transparent to a certain degree with management communications. There are still things I wish management was more direct about, like what priorities are around things like sales per labor hour, and how much our store actually should be stressed about these things.","There have been several incidents with heritage and culture celebrations here that have been very disrespectful to the people being \"celebrated\". Management always takes all of the credit and puts themselves front and center with any of these situations which also creates frustration and disappointment among employees.","Weekly huddles for every shift are imperative to maintaing order, training, policies, and overall team education.","As far as I can see from the bottom it looks like there is a fare and even handed management practices.","Questions 11 and 12 - It doesn't feel like departments are on the same page when it comes to many of our policies, and how thorough our follow up is in corrective action. Some departments seem to have this locked down, others seem to have issues staying on top of coaching and disciplinary action. Some supervisors are very efficient in getting this done, others avoid it if they can. There are some questions about write ups that we've been asking for over a year, and seem to not have clarity on (example - if someone is tardy, and we don't write them up before their next tardy, is this one write up and once incident because we missed the first write up, or is it two separate write ups? It's different based on who you ask).","I don't see enough of what they do to know about this","Usually the communication from upper management is transparent, but when it's not, it's very obvious. I'm thinking back to the bed bug infestation and the lack of communication regarding it. I believe there was a vague note put next to the punch in clock that I happened to miss on my way in/out that said something like \"Bag up your belongings, see MOD with any questions\". I found out that there was a bed bug situation roughly a week after the first one was found via word of mouth. I could've been bringing them home with me (and into the store) for roughly a week, just because I didn't catch that note by the punch in clock. \n\nSituations like this don't happen very often, but it only takes one instance of unclear communication for the repercussions to start rolling in. In the future, if something of this severity is happening in my workplace, I'd prefer to be emailed/called/texted immediately. It felt like this situation was just brushed off because the bugs were no longer an issue after the exterminators came.","Management is always fair and respectful","they seem to be fair ive noticed that if an employee breaks the rules they are called uptairs","I think they do a pretty good job managing the store. No complaints.","As a store I feel like you do well from a financial perspective.","Supervisors at elmwood are great, although I don’t think upper management is as concerned with the wellbeing of wormers","No Plastic","I have been witness to certain staff getting preferential treatment by management.","Management feels good, I personally don't have to go to management much but when I do its almost always a quick and painless experience.","Hiring practices have appeared to shift to focus on inclusion of LGBTQ+ community to the exclusion of other marginalized communities such as African American and immigrant populations which we used to hire in abundance","Managers don't see half of the day so all 'new policies' or long-standing ones are not applied whatsoever at night."]},{"Question":"23. Comments on workplace communication","Comments":["Workplace communication makes things very clear and is informative","Communication is something that can always be improved on even though it may be good overall. Sometimes is hard when you have a lot of people working together that don't all necessarily communicate in the same way. As long as everyone puts in the effort to understand each other it will benefit the collective.","There seems to be a priority to Elmwood when discussing new vendors, products, etc. while Hertel doesn't have as much of an opportunity for suggestion. I haven't been included in any vendor onboarding until said vendor has already been introduced into our system.","regarding question 22 the huddles might be helpful they just happen during the day when im not in the store so i cant really comment on that option","Workplace communication has been much better this year than in the past, but I still feel as if it could do with more improvement. Many things that occur upstairs do not make their way to the ears of the floor employees, who are the ones who happen to have to deal with any changes made to our workplace policy or workflow or etc.. I do not feel as if employees are heard as often as they ought to be (see also: no seats on the board for employees), and there is a general animosity felt among the floor workers for random changes to our workflow that we were not involved in whatsoever.","PFD needs a consistent weekly dept. huddle held by the Kitchen Manager to set standards & boundaries on a more frequent schedule.","Communication from the Store Manager has improved, but I still see gaps in written/email communication.","I feel that communication among my team is highly effective, and enjoyable.","Generally, our communication is good. However, it would be helpful on mental stress if the MODs wait until were finished with a task they have assigned, to give us new ones. I have been stopped in the middle of so many tasks to go and do something completely different. It gets confusing and a bit hard to focus, or I'm left feeling overworked and burned out.","The huddle is the most effective tool for me.","Workplace communication has improved significantly over the past year! I only didn't select open book management huddles because I do not attend them (it is after I leave for the day)","It sometimes seems like org support doesn’t realize what communications would help store-level employees effectively do their jobs. Sometimes we’re left out of conversations that we have valuable input on until it’s too late for our input to be implemented.","As the Visual Coordinator, I am working on making sure that notices and postings are up and in areas for all to see. Also working on a community board for both stores so that the information is gathered into a more central location. Email and Teams meetings are used effectively to coordinate information for groups.","I think there has been some improvement in communication as well, from managers to team members. I have noticed that while it is expected and required that department managers roll out information in a timely fashion, there have been times when getting clarity/information from HR that is necessary to my job depends entirely on who is available. I have had consistent reminders and expectations pushed for me regarding check ins with my team, while not receiving any check ins of my own since starting my position. While I understand that the entire Co-op team is busy, it shows inconsistency.","I think these communication tools are effective BUT I also feel the Co-op is very split. PFD, Front End, and grocery departments all are very separated and hard to keep communication or up to date need to knows.","Information shared at huddles needs to be in writing for those not in attendance to view. Lack of ability to check orders and truck invoices before arrival as a TM1 hinders my ability to provide helpful delivery window expectations to customers asking about current out of stocks/low stocks. Board and OP meetings can be better communicated to the employees in a timely manner with more in depth explanations, the less clarity the less trust the employees have in management.","I'd like to see more direct communication about certain things.  For example, the the people who work in the stores are aware of all events big & small.  It looks as though the details don't always trickle down to the employees who need to know.","There has grown an apparent dearth of opportunities for the expression of opinions. They are mot wanted (unless you are management, and then your opinions can quickly become policy!)","We still haven't achieved even a monthly department supervisor/manager check-in/meeting.  I feel like this would be helpful to get everyone in the same room to discuss our direction and focus as a team.","Employees are almost never asked for feedback in regard to making decisions for the apartment, and suggestions are usually denied.","It’s fairly well","I feel we've gotten better at this, but our communication from certain managers is still not ideal. This starts with Tim, whose communication style feels oblique and indirect. There are often times where I feel this has a trickle down effect to the rest of the organization. I pick up more about what's going on around me by manager's actions rather than their communications. Priorities and energy in certain directions let me know much more than what is told to me or written in need to knows or in meetings.\n\nI also wish we had more indication on what sort of financial trouble the coop is in in actual terms rather than in vague number goals of \"we need to get this sales per labor hour or we're in trouble.\"","Communication, as always, needs to improve and is not adequate at the moment. While there are meetings and announcements, they often focus on things that don't really affect the employees on a day to day basis and much of the information we may need doesn't get shared in those moments and we don't learn until WAY later.","This is imperative to keeping the team up to date on all issues, concerns, and goals.","Some department to department communication could use some work. I feel that it breaks down between produce and grocery.","We are generally improving over time, but there are still lots of avoidable surprises for all hourly supervisors. We can't go a couple weeks without one of us being left out of the loop on something important.","In the workplace i really enjoy learning new things.","Mangers have pretty effective ways to communicate with employees.","check ins with manager is helpful as well","Communication is good for the most part.","if we are heard the answer is 99% of the time no or a \"compromise\" that ends up being unhelpful.","Front end had hours cut without any notice, which had financial ramifications for the entire staff that we didn’t have time to prepare for","We have greatly improved our internal communication with The Need to Know and there is a lot of effort put forth in ensuing that document is part of weekly communication and is made available via Paylocity.  We need to continue improving internal email communication of marketing/promotions to the front end and Department managers by creating templates for Marketing to use to communicate upcoming campaigns and events.","Workplace communication is good especially with the grocery department manager. Tim and Nick Brown are also easy to get hold of when they are needed.","I am often blindsided on changes happening within my own department, especially regarding changing of shifts. I had shifts cut from me to give to full-time employees (which is perfectly fine as they need to get the hours that they signed up to get), but when asking about this to my manager I was told that it was a one time situation and that I wouldn't need to worry about it happening again. Come next week that shift was given to another employer once more and I was not informed that it would now be a regular thing and I shouldn't expect to work that day. Not being told the reason for shifts being cut or even told that our shifts are getting cut is very annoying and puts us in a position where we aren't sure if we will be making that money back or if we can eve go to our managers about getting more shifts.","Moving the weekly need to know to the punch in/out tablet would be useful, I don't linger on the staircase, rarely use the employee bathroom and I don't spend time in the breakroom so I usually don't see it","As someone who doesn't work in produce or grocery or front end, it feels like a lot of extra info getting dumped on me through Paylocity notifications and emails about those depts. Just more stuff to open and delete. That could simply be printed and posted in the break room if anyone was really interested. It seems like HR could be spending time handling more serious issues than emailing the entire staff about what apples are in season. I also get constant notifications about training and surveys that don't even concern my dept. I'd rather have my serious issues about harassment and healthcare addressed than hear about murals happening at Hertel or community events off site.","My store manager does an excellent job keeping his ops Managers informed and up to date on all goings on. Also my store manager is always available to hear my concerns. He has an open door policy."]},{"Question":"25. Comments on Open Book Management","Comments":["It does help. Transparency is a good thing","Allows us to be informed and know what's going on.","Huddles are great! They do so much for team members who come to work to be a part of the team, and who share the Co-ops vision. However for the folks who work at Hertel that just come for the paycheck, they feel like its a waste of time.","I don't think we use OBM effectively it just seems like a weekly task instead of a session to solve or brainstorm areas where we need to.","I like it.","Helps inform decision making, helps me do my job and understand the job of others!","This is one of the best things the Co-op offers, and I have gotten excellent feedback from team members on its usefulness and how included it makes the staff feel - information is not selective or \"private\" as it is at many other places of employment. The more our team knows, the more they can do their job in the best way possible.","I'm not super familiar with what this is..","Sure the book is open, but its in a locked room with no windows.","Grocery transparency is clear, whole store transparency is not.","I'd love to see more employees engaged in the huddles.","Are you referring to what comes from the closed ops retreats?","OBM isn't really convenient (time wise) or the overnight staff to attend.   I do appreciate the Weekly Need to Know being sent out through Paylocity.  I would like to see a weekly appreciations list come back though, I feel like this is a good morale exercise/builder.","I have none.","We used to get WAY more numbers in our past huddles. We often saw a cash on hand line that we no longer see, and there are many less numbers on the white board that are used in the Wednesday \"big\" huddle than there used to be. I often feel like we are getting told less and that more information is \"siloed\" in the SLT meeting.","I'm not sure what open book management refers to","It doesn't feel like Open Book management when there are significant costs we aren't allowed to know - for example, our legal consulting fees, Tim Bartlett's salary, etc. I don't trust that the financials I'm reading are complete. I know how much money our store makes and in each department, but I feel we aren't transparent on certain expenses based on the comfort of senior management being held accountable for the efficiency and necessity of those costs. This is a very old school practice that doesn't sit well with the millennial and gen z workforce over all. I find it hard to wrap my head around how we have to carry SPLH when I don't know how much of it is going back into the retail floor vs. how much is being given to lawyers and senior salaries. When we were cutting hours through winter, a lot of questions were raised about senior salaries. The optics were not good. When I've asked questions like this in the past, it's always deflected. We don't have open book management. We have transparent profit and loss reporting.","I'd like to know more about the upstairs side of the business","I don't know if this does or doesn't. Like I'm not in a position to where this information would be applicable.","helps me understand that hands are tied.","Always knowing how the co-op is doing performance wise helps me feel like im contributing to the coop","I think huddles are super important, especially at the co-op. Since I am part-time and in school, it is hard for me to know what is going on within the store and that is especially difficult when a customer asks me about a certain thing (e.g. sales, owner voting times, events). The huddle really helps me get the information I nee to help customers and myself know what is currently happening at the co-op.","I really like that we practice open book management here at the Co-op!!"]},{"Question":"31. Comments on compensation","Comments":["Health insurance should be available to part-time employees.","Benefits are important for everyone. The salaries here are competitive and make cost of living easier","I feel fairly compensated for my work and believe the pay scale is fair.","Very grateful for the salary offered to me, but I think there could be room for an increase in wages as we continue to see dept. managers implement new systems requested by their superiors, bring the growth of their departments up substantially, etc.","I decline to comment on pay at this juncture. Our benefits here are better than any other job that I have worked, although it took union representation for us to gain many of them. I believe that we could still do some things to improve pay rates for our employees, as it is yet difficult for me (with two paychecks: my own and my partner's, who also works here) to afford to pay for food and rent here in Buffalo at the end of the month.","I think our staff discount could be better, especially PFD items, and I feel some type of lunch compensation should be implemented. I have feelings about my starting wage as a new supervisor, but I'm just holding out for my yearly review ^^","The benefits are very nice. The pay is good, but sometimes I wish we weren't paid the way the union structured our pay. It would feel better if raises were based off performance and not length of time working","Pay is good thanks to Workers United contract. Health insurance is insane tho! HELP!","Merit based raises need to come back. Not everyone’s quality of work is the same","All of the health benefits are extremely over priced and not at all worth losing 1/3 of a paycheck. Some of us already live paycheck to paycheck, so the health benefits are so unhelpful and I'd rather be uninsured.","While the benefits and environment of working at our Co op are very nice, the pay can lack because there are regularly lots of call outs and all that responsibility falls on the shoulders of the employees that came in.","The Co-op is incredibly competitive in the job market. We have excellent benefits, a work culture that continuously works to be supportive, and the pay is on par, if not more, than other jobs that are similar. I think our biggest strength currently is a departmental management team that really cares to make this place great to work for, flexible when possible, and interested in growth of all members of the staff. Having a team that bonds over a true belief in what we are capable of is potent and changing.","Understanding with what is happening in the world it hard to afford anything anymore. Pay increase would help with overall.","Longer lead times with regards to insurance company changes need to be set in place. I personally lost surgery opportunities due to this(part of the reason I took the job in the first place) and if I had a longer time-frame I would have had more opportunity to plan around it, rather than settle for worse options. If the reason was the new Highmark options would have been a similar price after the new premiums were introduced, it is confusing as to why the change occurred in the first place.","As a part time employee I'd like to receive partial access to medical benefits","Bureaucracy. Benefits are a moving goalpost here. They seem to come and go with the labor-cost-profit","I don't have access to floating holiday as a part-time employee.","While I feel I am paid well for the position and my experience at the moment, I'm coming up against the ceiling for my position and hope that ceiling moves up before the next wage review to move with inflation and cost of living.","Payment and benefits can always be better, especially in the hell world we live in now.Within the department, I do feel underpaid based on the amount of work that is assigned and expected from me in comparison to my coworkers. Some people seem to get preferential treatment or if this isn't the case, some employees get leaned on WAY too much in comparison. New wage scales should be made to reflect a more fair work to pay rate.","It feels like it's the pay scale is healthy but it doesn't pay well enough to afford to shop here for the bulk of my groceries. The prices are high for what we sell","I do not believe all supervisors should be in the same pay category, and many of us have brought this up for years - dept managers included. Our medical benefits are no longer affordable as of March 2025, which was unbelievably disappointing. Is it valuable? Sure, in that I have no other options.... but is it affordable? No. I had to downgrade multiple levels to keep my cost the same, and as a result, have to find a few thousand more dollars a year for medical expenses. As for compensation, I make more than I would make at major chains at this point, but I'm still living paycheck to paycheck and picking up odd jobs to stop treading water. I am not satisfied with my pay, and this is supposed to be a satisfaction survey, but that's not what the question is asking (which feels like we're trying to skew the data favorably, to be honest).","The benefits are best in class. Especially the amount of PTO given.","Would prefer a slightly higher staff discount, especially on prepared foods for lunch breaks when I am working.","I do wish our employee discount was 20% throughout the store, and that it would stack on top of sales.","Benefits are a main reason I continue to work here.","I do not believe wages have held up compared to the rate of inflation increase. I cannot afford to shop here, even with the employee discount. I do not feel like the accrual rate for PTO for employees in the 2-5 year bracket is enough, 3 years is too long to stay at the same accrual rate, it should go up every year. or at least every 2 years.","I believe that pay can be increased further and discussed with the union since the prices of food and rent are increasing drastically. I think that at least improving the wage a dollar would be beneficial for being able to afford the necessities like food, housing and transportation.","The amount I paid for the labor I do is fair, I will say. More...Free...Food...Please","i don't know anyone making a livable wage right now. to ask for a comparison is laughable. the insurance is valuable to me because i desperately need it but it doesn't feel like much of a benefit when i can barely afford it anyways.","The pay rate is abysmal, I can work full time and barely afford the food in the store I am working at, along with being at fear of not being able to afford rent every month. I know that nearby grocery stores pay their employees more, which is unacceptable considering the image that the co-op portrays. Additionally, the employee discount is somewhat helpful, but ultimately should be higher.","Out health insurance is very expensive and covers very little until the deducible is met.","I can't complain about any of the co-ops compensation plans. However I do want it to be a bit more clear about why and when we get our raises.When I got my wage increase I wasn't really sure when I was going to receive it and why I was given the amount I did. More clarity in that would be nice but other than that I do feel I am paid well and fairly.","My only suggestion is that SLT level management should be on a different time off accrual basis than team members. There was also a period of time after the contract implementation where I earned less time off than before the contract and was limited in how I could use half of the time because it was sick time. I still think the benefits are very good overall.","The pay rate does not give me a livable wage and requires me to get another job to add more income. I am a big fan of knowing that I do have a guaranteed raise because of the union, but after the first year the guaranteed raises do not fully benefit me that much as the times in between to get them get larger and larger. The raise itself is not the greatest especially if the highest I can make is still under $24 and that's only if I have been here for 11 years. I love being in a union and having this guaranteed raise, but with how expensive gas, groceries, rent, and necessities are getting, the starting pay and raises should get higher and better so the employees are actually able to live off of the salary. It is also quite hard to make sick time or PTO as a part-time employee that barely works because they are a full-time student. For the most part I can understand that and it is fair, but getting penalized for not using either or when calling off is not the greatest an makes employees scared to call off even if they are extremely sick. It creates a hostile workplace and can affect how your employee works as they might not want to put in the effort because they know they won't be benefiting from it.","I do not need health care, vision or dental insurance. I  should be receiving payment in lieu of services ."]},{"Question":"40. Comments on Store Operations","Comments":["Its nice to come to work and feel like I have everything I need to do the job effectively. The online courses are informative and keep the staff ( new and old) on the same page of understanding.","There are certainly systems inconsistencies between both stores and spots where Hertel has branched off over the years. Some larger systems like Delivery Protocols (maintaining cold chain), and also smaller systems like assigning backup cashiers each shift. (At Elmwood, we assign backup cashiers numerically throughout each shift ex: Joe is backup number one, Sally is backup number 2, etc.) This means that when a need for backup arises, we don't have multiple employees stopping work every five minutes to check the registers, which can wreaks havoc on SPLH. \n\nIt would be worth a systems check in between all leadership roles to make sure we're all aligned on what best practices are when more than one system is being utilize at each store.","Then overall operations for what I know seem to run smoothly. As an overnight employee it's kind of hard to really know everything that goes on, but from my perspective it seems to operate well.","Store operations feel fleshed out, consistent and safe.  However, communication between stores can continue to be improved.","The store does not feel safe. There is a constant scramble of difficulty as a back room worker regarding back stock overflow, and at least 2 hours of my week is often dedicated simply to moving things out of the way so I may access things within my own department. There is a constant flow of back stock from other departments that makes its way into my department, gumming up the works even more. The parking lot is exceptionally unsafe, I am not comfortable being around our customers' driving habits whatsoever. I often feel at odds with other departments when I require space to do some of my work, even if we are able to communicate and work time out for each of us to share equipment.","Supervisor training needs a system in place. As it was told to me, I was kind of thrown into the wind to see how well I float. Yes, there are references & information for me to depend on, and the management team was nothing but incredible my first few months, but there objectively isn't a training program in place.","Sometimes it feels as though Elmwood and Hertel do things differently which isn't necessarily a bad thing, but is interesting","I think Store Operations have improved over the last year. There is still a disconnect between stores.","Customer areas are clean and shiny. Employee areas are dirty and dusty.","I would like to see a culture shift to less clutter in work areas and detailed store cleanliness.","Hertel kitchen and Elmwood kitchen need to be on the exact same page with recipes etc. There should be no “Hertel does it this way” etc","Redistributing labor from department to department is very helpful when one department is short staffed and others have extra hands.","Communication between Elmwood and Hertel may be good in other departments but I do find in PFD it can be a bit lacking","While safety policies are clear, it’s sometimes difficult to enact due to staffing. Hard to keep uboats low enough when there aren’t enough people to work the product, hard to keep the snow shoveled/ice salted and also get your daily task list done. Communications between the stores depends on the specific people involved, sometimes effective, very often not.","Until I see that working 50+ hours or more every week for some members of management declines, I will withhold a strong agree towards efficiency. I understand implicitly that not all positions have the same type of responsibility, but I believe deeply that a work culture that makes people feel they need to work that much constantly, or not have a work-life balance, does not show passion to me - it shows subpar time management, or job expectations that are not easily delegated in order to help shoulder a burden.","PFD has gotten some new equipment but elmwood specifically needs to be cleaned and reorganized. Even new organizing shelves, equipped for an average high person. Not everyone is 6 foot. Also the safety procedures for like a fire drill was changed last year to meet at Pasturized Tees and it still says in the break room still to meet in the 7/11 parking lot. We have to change that.","There needs to be an addendum to the next 5 year outlook starting 2027 immediately addressing the reduction of our sprawling software contracts and commitments. There are enough options, albeit limited for a small business-large sales volume environment to consolidate our POS/WFM/Inventory/Online communications all into one service rather than rely on paylocity/basecamp/catapult/microsoft suite. Addition of carpal tunnel/arthritis aids provided by store would be helpful as many members of my team alone have issues with these and currently self-provide solutions; something akin to the new knee pads and backbraces which have been helpful would be a plus. Parking lot should have an attendant or worker at all times to enforce parking requirements, ensure the proper usage of handicap spot, and deal with a rise of unsafe drivers in and around the parking lot which are a danger to employees, customers, passerbys, and pets that all share the common space.","I am not included in the communications regarding operations.  Despite what I wad told upon my hire, I  have been denied trainings that would put me remotely in the know of operations","Safety concerns are taken seriously.","Everyone works well together and help is always given when needed","I do not feel like our communications between Hertel and Elmwood are effective or timely. I often feel I don't know what's going on at Hertel, or have a good idea of why we we're having trouble with certain aspects of inter store production, like bakery, due to staffing level issues/pto.","Equipment could definitely improve. It is always down and we are constantly having to find work arounds, which both makes work harder and inefficient.","I feel like it operates in a very corporate way, even more so than when I first started.","We could improve our technology by implementing Planograms that work with our scanners, Freshness Reports that update daily (via technology), Live Inventory, and a proper pull report. Live inventory with a proper pull report would completely eliminate our need for backstock nights and allow overnight to operate more effectively with a smaller team.","Our inherently poor communication culture leads to operational inefficiencies and coverage gaps on the retail floor. Produce often struggles with productivity, and has for the last few years, and it does not change. The kitchen can only function with the help of TMs from other departments, which pulls them away from their jobs to do jobs they don't know as well. This leads to lots of efficiency and productivity problems. I don't get responses from my emails to Hertel unless it's extremely urgent or safety related, and I know that to be true for many people at Elmwood. I don't feel appreciated or respected as a worker making compromises in their life for their job whenever I help Hertel.","Conditions in the kitchen are sometimes unsafe feeling and claustrophobic. This mainly occurs during AM to PM shift change. The space issue seems largely unsolvable however.","Not sure what communication I'm looking for between stores... unless it's one of us physically calling the other for a question, is there anything else I should be more aware of?","As a team member I have no idea what is going on at Hertel. Other departments are not trained in grocery so we can help them when they need it but they can't help us.","I think the coop does its best to keep its workers safe and informed.","if you wanted to run things more efficiently talk to workers about how best to complete tasks instead of cutting hours to save money.","I have been working in all types of kitchens for 13 years and have never had the horrific experience of having a dish machine break/stop working close to 10 times a few months time.","This is a pretty straightforward section. I don't have any further comments here.","The parking lot is hectic and sometimes unsafe as people fly through it and are careless of those who are walking in it. Obviously this is not something the co-op can really do something about and there is not way to make the parking lot bigger, but sometimes it is terrifying going to through out the trash even if the visor vest on at night because [people fly through the lot like mad men.","I think some of my time in produce is redundant. I appreciate the hours but it always feels a little overstaffed on tuesday and understaffed on wednesday","per #37 it operates mostly independently from other departments?\n\nper #39 managers need to compare products more regularly, customers tell us regularly how different things are between elmwood PFD vs Hertel PFD. By that I mean actually look at and taste products, managers frequently don't know the extent of issues within their department, and many of the inconsistencies are not able to be seen, but the taste is noticeable.","There are plenty of obvious and simple solutions to problems that could be utilized, but change moves too slowly to make use of those solutions. Plus there are plenty of employees who are told to make those changes and they ignore instruction or simply don't care.","The communication between the two stores in my opinion has only gotten better."]},{"Question":"47. Comments on department operations","Comments":["The department works hard and gets things done well. I find respect between employees and a good camaraderie.","I think our department puts out quality work that I am proud of. I do feel like a bit of an outsider coming from Hertel but as time goes on I feel that less. But I suppose that's to be a bit expected going from a place I worked for a while and had made friends and connections then going somewhere where I didn't really know anyone. Kind of like being a new kid in school lol. I am happy to get the new experience of working here and learning new things from different people that I may not have otherwise. It's interesting to see the difference in the way things are done differently between the stores and both still have a positive quality results.","I am often confused as to what the goals of my department are, as notes and details regarding our long term goals often do not seem to make it out of the Admin Office.","As the MMS training defines it, \"The Line of Responsibility\", is something that has a couple breaks & bends in it within PFD. As a newer supervisor & worker to Hertel, it is noticeable that peoples preferences have influenced the daily work flow (i.e, \"I don't like to work this station, so I will switch with someone if I get scheduled on it\" or \"I don't like doing packout\").","We have a good, hard working team in the Elmwood kitchen. They always know what to do to get things done on time.","I love my department.","People need to be spoken to asap about mistakes/quality issues and held accountable and followed through with to make sure these mistakes don’t keep happening.","There are some people in the front end department who do not like to stay on register, which is generally fine, except when I need a bathroom break or just a break from register in general and they are nowhere to be found for long periods of time without letting me know what they're doing. I think its fine, but maybe we can try to communicate to each other where we are going before just running off with no warning.","As a baker, I highly respect my manager! I do often find that PFD can be pretty discombobulated though.","My direct manager does a great job of organizing and directing the department, to the benefit of our goals. Truly, the department cohesion is the best I could ask for.","I struggle to not put \"partly agree\" for organization and clearly defined goals, but it is because I see a lot of potential that is untapped that I could fix with time. I think that my work can always be improved on and that there is never an \"end\" to goals, and that is more about my personal viewpoint in my position than something the Co-op itself is creating.","I feel my department has grown to be more organized and we are getting there!","Grocery department has consistently exceeded my own expectations and I have a lot of trust in my immediate colleagues and superiors within the department.","Sometimes communications about decisions that affect my work don't happen.","Stumbling inaccuracy around goals. We are expected to arrive on time. Cooperation and communication are not particularly emphasized. Andrew Stachura has said that \"nuance\" is of great importance here and has often shirked directness in communication. The food prep industry needs to be run through direct communication. Any measurable quality comes from individual efforts. And gratitude for these efforts might appear around Thanksgiving,  but might not","Most of my peers are very good at their job, care about the products we put out, and understand our department relies on working as a team. Some (few) don't seem to care.","While I partly agree that our department does good work, I do feel we have some staff who could be friendlier and more efficient. I believe we're working on this but it's not where I'd like it to be.","My department is good, but could be way better. No clear expectations and goals are really set by leadership. A lot of the time it all feels random to me, but thanks to the work of some of the employees, the end products do result well.","Old habits die hard... It is sometimes clear that the longest term kitchen employees voice negative opinions when the word \"CHANGE\" is mentioned.","The time with which I work puts a spin on how I view the operation. It is it's own thing and it operates well with its system.","I love my department, but I don't think we're completely consistent. We do a good job of setting the example of how a lot of personnel management things should work, but I think we can do even better! We've started integrating systems for more timely action on personnel issues and security issues, but we will have to stick to these systems for long term cultural change. I think, for the most part, we are all very good at our jobs, and just need reminders from time to time.","There are a small number of team members and supervisors that do not effectively coordinate or work in a “team member” fashion. Often prioritizing themselves to a fault while avoiding providing basic help to team members that may need it. Work lists done by some supervisors seem ill informed as to what product we may actually have in stock in order to produce the things that are put on the list. Also labor distribution is sometimes off-kilter on these work lists.","I sometimes feel ignored in certain aspects of my job, especially when it comes to procedures/expectations that no one else is encouraging our team to carry out, leaving me with the burden, to the point where I will stop caring.","Workers care about quality work and efficiency","There is perceived favoritism towards certain other employees in my department. the standards do not seem to apply to everyone.","I think there's some work to be done in organizing/coordinating our department, especially when it comes to creating the work list and keeping ingredients stocked. Oftentimes, there are assignments on our work list that are impossible to complete with the current ingredients on hand.","we all act together as a team, at times we just jump in and help one another to achieve the mission","There are a couple of times where me and my coworkers feel like they have been doing more work than others. Like preparing more recipes or certain tasks more so than the people who only do one to two a shift","Department runs itself at least on overnight. julian Perez is a great leader, his work ethic is inspiring but he over exerts. Our team members, and receiver are a big help.","i understand the main goal is to make a profit. it is hard to be motivated to do more work when any extra help is another exhausted/overworked employee now getting stretched between departments and no compensation.","Oftentimes we are expected to do more than we are capable of. For example, we are told to complete a ridiculous amount of tasks, while at the same time having to deal with a long line.","Our workload is consistently too heavy for one staff to handle. The Co-op takes on too many initiatives, events and promotions to be effective. We should focus more on food-based events, outreach, promotions and scale back on things that are not food related until we have more staff to accommodate the desire to be a community based orgazation, vs a food based organization that is part of the community. \n\nLet's do great on fewer events vs barely completing the task because there are too many of them.","My biggest gripe with overnights over about the past year is the expectations of team members compared to supervisors. I do believe sometimes supervisors (specifically overnights because no other higher ups are here) can be overly strict with team members and have too much of an expectation of them too early on in there careers. I understand its is VERY hard to find consistent overnight workers but we haven't had any overnight team members stay for longer than a 6 month period (most of the time less than 6 months) since the hires in summer July 2022. I do believe this is due team members being treated harshly and sometimes unfairly by the overnight supervisors. As a supervisor myself I believe in lead by example, if team members see you come in and work hard and treat all employees with respect then they also will do the same. We have new time systems(how long it should take to do certain tasks) but only team members seem to be affected by this time system, not supervisors. This can lead to that unfairness and double standards in the workplace. The best way to combat this is by having more 1:1 check ins (maybe once a month) where maybe 5-10 minute conversations can be had to address issues that some people may be facing. This way the grocery manager has a better understanding about how overnight policies are being ran and can hold supervisors accountable.","A lot of new systems are being put in place, some may or may not be effective","We are working toward holding team members accountable during their shift now with using paylocity and \"notes\" format. Some employees are still moving at a pace that is not the most productive- we are moving toward outlining TM responsibilities and goals for each position.","per #42-45 AM managers and supervisors are great about making sure policies are followed/rolled out by staff that are typically there in AM, but if Ritch or Merlo aren't the ones to tell an employee a message, it doesn't get shared by any other supervisor/manager. 85% of communication on policy change/ways of doing things/updated standards is communicated by Ritch and Merlo and it's ridiculous.","There are employees in my dept who make mistakes constantly and never care to take instruction or correction, and I don't feel the corrections are given clearly enough by supervisors/management. What normally happens is an individual makes a mistake, and the dept at large is issued the correction without ever singling out that one individual. They end up not knowing they, specifically, need to shape up. Correction and instruction becomes too vague and lax in order to avoid making any person feel targeted. There are also employees in my dept who behave and speak inappropriately and disrespectfully, and it really gets on my nerves and the nerves of other coworkers.","The biggest obstacle my department faces is space. It's tight in the kitchen with both deli and bakery sharing space."]},{"Question":"57. Comments on HR practices","Comments":["Doing a good job.","HR can at times feel distant to a lot of team members and I think that a little more one on one store level experiences with team members can go a long way.","I haven't had many encounters with HR but when I have they were helpful and understanding.","There have been moments during my time working here where I have seen injustices and discrimination from our shoppers towards our employees that have been dealt with very sloppily. Since then, my ability to trust the way that we deal with situations like that has not been mended.","HR practices are very slow moving some weeks, and it reflects poorly when staff has needs. Like maybe, don't plan a week vacation where the entire store needs to sign up for new health insurance, and the people responsible for helping staff with questions/concerns, are therefore not in the building. Or! if the vacation had been planned, someone else should've been assigned as the go to for staff.","We have a great HR team, but I would like to see better communication from HR to department managers. Communication from our SM about HR related topics can be delayed and often our SM can't answer the questions the Ops Team has. More direct communication to the Ops team would improve efficiency and feedback.","Our HR department is non-existent for the most part and from coworkers experiences very difficult to communicate with or reach out to, also inexperienced and ineffective in their role. I do not feel confident in our HR department if I were to need them for something.","Half of the HR team is friendly and helpful.","I feel more comfortable going to my direct managers with confidential information than going to HR.","The handbook has not been updated in several years and does not include changes that the contract addresses. A version that is updated and consistent with current policies would be more helpful to me.","Sofia has curated an incredibly confidential environment for HR. She is professional, thoughtful, and well educated in all aspects of her position.","Since the previous year I think HR has gotten better at getting back to people in a timely manner.","Not an HR practice, but management needs to enforce respect of employees identity in dealing with problem customers, although this can be very difficult to spot when it occurs and I personally do not often call management to assist in these situations. Respect of pronouns needs to be continued however it seems to me some people have issues remembering everyones, which is understandable and I dont currently feel offended by anything by my colleagues.","I don't think there is intentional inequity...but it does exist in subtle ways.","There is discrimination here. A staff survey is not the forum to put these down. Discrimination comes in very individualized scenarios and this would eliminate the supposed confidential nature of this survey","I believe the Employee Handbook, while made with the best of intentions, is not always entirely clear and or comprehensive.","HR is not the most reliable department.","I have little interaction with HR, but they did help me when I needed it.","Our handbook should be updated with examples of commonly misunderstood situations as some people will take instructions more literally than others.","Question 50: I think we can do a better job of outlining accommodations vs. preferences vs. exceptions. We have several cashiers who refuse to help in the kitchen, though on some days one could argue this is a function of their job. They report that they have anxiety and can't function with it in the kitchen, but we do not ask for an accommodation. When it comes to another employee saying they are unable to cash customers, however, we require an accommodation. It feels unclear and potentially messy if staff members want to dig their heels in on one of these issues.","HR to me often times feels hollow and my feelings aren't taken seriously. There is also a communication problem; once I asked for something and when the day arrived for my request to be fulfilled, no one spoke to me. I let it drop but didn't find out until months later why my requested meeting was canceled (without anyone telling me it was).","When I was first hired I had very bad experiences with HR but the current HR team has been fine. As someone who is perceived as male, I do not know if harassment is happening. Others' opinions are more insightful in this area.","to this day I have not had to bring anything to HR, but if i did i would strongly agree that issues would and will be confidential","They are helpful.","Does HR bring matters not only to the Store Manager, but also to the General Manager when warranted? My impression is that this does not happen.","I dont know what HR for me","in situations with dealing with HR the experience leaves me feeling dismissed and the issue misunderstood. i feel like if i go to HR with any issues it will be handled in a way that only makes the issue worse. but yeah, sure, they're confidential about it. i wonder why.","I personally have never had to go to HR with a problem so I'm not sure how things can get handled, but from what ive seen the co-op does a great job in hiring a diverse set of employees,","HR is always available and gets back to me in a timely manner whenever I am in need of their guidance or assistance."]},{"Question":"68. Comments on training and development","Comments":["I have not seen opportunities for job openings","I feel there is an adequate amount of information given through training. It is a useful tool to give you a reminder of what is expected of you.","We removed development opportunities when we cut all of the sub-department coordinators and streamlined our job titles to Team Member I and II. The only actual development opportunities I have access to are Management opportunities, and I have little trust in our ability to adequately prepare and support our managers and set them up for success.","More consistency between days of on-the-job training (ie. working with one individual over the course of the training rather than multiple individuals who may not have communicated) would lead to more cohesive training.","PFD needs a shared training program between stores, especially if a third store is a potential. Having a common SOP between the two stores would then allow team members to pick up shifts at the other store without fear of doing something differently, or wrong.","Hands on training could be beneficial - watching numerous videos can be tiresome and hard to learn from","There is little to no training for most employees. My job description does not match what I actually do. I am supposed to be able to develop new items for sale. That's actually not allowed. Upper management does not want new products.","Training in the kitchen needs to be treated more seriously as complete or not complete. It is rushed, and therefore never complete which leads to inconsistency etc","It has been quite a few years since I had orientation but from what I hear, it's very useful!","There are parts of my job that I was not trained on, and find out later there were pieces missing, and that I’ve been making someone else’s job more difficult due to my ignorance.","I have had no formal evaluations on my work performance since starting this position. I am working towards making our training program is functional, exciting, and informative with every new team member hired, there is a lot to fix on my end. Outlined responsibilities and clear work criteria for performance are partly agree due to lack of evaluations. No opinion on training programs because I am not sure what that refers to - is that our training programs from HR? Do we have another \"training program\" in place for diversity?","Specifically in pfd there needs to be only certain people training a new hire not everyone. Experienced and someone who is knowledgeable of the co-ops goals and standards are.","The union had a scheduling conflict and was not present at my orientation so that is the only portion I cannot really speak to, and why I chose that option. I have a very specific tech skillset that can be utilized by the co-op, however in the current organization of category management/sales backend the room for that position does not exist. I understand there was previously an employee in a similar position by the name of Josh, however I was unable to get much information regarding him as he was no longer employed when I began at the co-op. I dont currently remember any of the DEI onboarding but I think the environment among the coworkers works quite well.","We have training tools but they are never used by other supervisors","I can see that there are many holes in training of day to day details of the work.","Denial of promotions. Poor explanation. Sometimes  no explanations","While I do feel that my work is valued and I'm given trainings pertaining to my job, I also feel like I'm not asked for my input often or used for my intellectual abilities on the job almost ever, especially at a store wide level. The supervisor retreat is very basic, without much room for input and true impact. I feel like I'm getting the clif notes version of what the department managers get, and much less than what SLT gets.","Some of my long-term colleagues seem to downplay the importance of \"on-going learning\" which disrups departmental goal achievement.","There is a lot of supervisor responsibility in job descriptions that aren't explicitly outlined. What policies and procedures we do have aren't up to date for the most part, and don't cover anything around prioritizing and decision making. I think that one online training a year about diversity is not enough to understand what our colleagues of color and other marginalized folx are going through.","On the job training in PFD needs improvement at least in the TM 1 position. More time spent learning recipes and general procedures with a trainer would help. There are instances where fairly new employees are left to train new people leading to inconsistencies in the training process and further issues later on.","In the kitchen, we need a concrete training regime. It is too important to continue being brushed aside. Expectations are constantly coming into question, and I feel like everyone in the kitchen, new and seasoned hires, all have different ideas of what their job expectations are.","There aren't many opportunities for promotion for me. Job description is vague. Diversity training is important. I am grateful for opportunities to learn.","There is no room for growth or development in my department. it is impossible to grow in the company","The training offered in the kitchen is currently (to my knowledge) offered to new employees by other team members. Yes, the team members training know how to perform their job, but to train/teach another employee is a completely different skill set that they are oftentimes not equipped with! I don't think any of the new hire training in the last year has been comprehensive.\n\n In my experience, I learned how to do my job by asking a TON of questions every day, which just happens to work in my favor. Many other employees won't ask uber-specific questions - they don't know what they don't know! I would only find out how to properly complete a task when I needed that task done in the moment. \n\n I think it'd be so helpful to have some sort of training checklist or rubric just to make sure that vital skills aren't glossed over. I felt like there were so many holes in my knowledge and it took months to fill them.  \n\nIt'd also help if there was ONE uniform way to complete a task that was taught to EVERYONE. If the employee wants to perform that task in their own way, they should be able to do so (with supervisor approval), but it shouldn't be taught as the standard.","Pretty effective","I have been trained well on how to do my job. As for development I do not expect to go anywhere here. I have made it abundantly clear that im willing to learn and advance. Given the fact that every job i apply for goes to some one else tells me exactly what the coop thinks of me and where they want me. the social inequities between myself and others in my area tells me how alot of so called peers view me.","i've brought up possible trainings that would make the coop a more inclusive place and learned there's no interest unless there's a profit.","There is very little room to be promoted in my department. I've discussed my need for career advancement for years with no progress. There is no timeline or outlines set-up to get promoted despite several discussions that I have the skills needed to move into a higher position.","I personally feel like before team members and even supervisors, can work/ assist in different departments they should have sufficient amount of training in the department first. This prevents costly mistakes from being made and can avoid frustrations. I understand needing help from other parts in the store, but that employee needs to be trained in that specific area before they are expected to perform well. This should apply strongly to Produce, Dairy, and cashing.","There continues to be no cohesive and consistent set of training standards applied in the departement, despite this being an issue brought up repeatedly and acknowledged by management as a major problem holding back productivity","I believe every new employee should get one training closing shift and one training opening shift regardless of what they might continuously work. When I first started I was only nigh shifts and was always closing. My first opening shift I was the actual opener and I had no idea what I was doing. I didn't even know there was a doorbell to ring to let me in and I was standing outside so confused. I think training should be revised every other year or so and department managers should get feedback from employees for what needs to be added. New employees should not be confused on how a shift works once training is over, it benefits no one.","per #58-59 WE BARELY TRAIN GOOD GOD PLEASE FIX THIS","Although training is good. It can definitely be better."]},{"Question":"77. Comments on Supervision","Comments":["Management, including dept managers make things clear and fair. Any issues are usually brought up as quickly as possible.","The supervisors let me know what is expected of me and the best way to get things done.","Although it is encouraged, I often do not feel as if certain things I mention to my manager are heard.","Sometimes communications are lacking, and it leads to confusion/frustration with staff. Holding team members accountable in the moment is something I wish more of, out of our future assistant kitchen supervisor, and the current Kitchen manager.","My department manager rocks!","Supervisors need to supervise!","There is one manager who has to work on when and where they give constructive feedback. I once witnessed them confront an employee while cashing out a customer in front of a line of customers. I think that was the wrong move, and they should have waited until the employee was alone to give that feedback, because it might have been a little embarrassing to her.","Tasha rocks!","Truly have never been happier with the direct manager I report to. He does a phenomenal job, and I’m so happy to be on his team.","Reiterating lack of evaluations regarding timely feedback.","My department manager has been great to me and been inclusive about dept. goals and procedures","Rachel has been an pillar in my time here and is doing great work!","Much of the work and effort to do my job goes callously unobserved, and evaluations are often based on second hand reoorts","Tori is very fair, supportive, and genuinely feels like she cares for her team.","Supervisors are a position I increasingly question the value of, as they seem to do less and less as more work seems to be pushed onto employees. There is a bit of distrust between management and employees","They are a well respected team!","Julian is an excellent manger. He's kind, knowledgeable,  clear in expectations, very reasonable and good at delegating tasks.  Lucky to be on his team.","Tasha is the best manager I've had. She's very personable, approachable, and easy to talk to. I also know that she'll listen to suggestions I have and implement them if they seem feasible.","I wish my manager would be more encouraging with their critiques... or rather, just being more complimentary. I often feel like I'm just floating around without guidance- positive or negative. But I know I would do a better job if I was told what I'm doing a good job in... and at the same time, having more constructive conversations that allow me to learn and grow in my role.","I think Rachael does a great job.","They do a good job. When I have an issue they listen.","As per question #76, I feel I can go to my department manager who listens to what I have to say, but doesn't actually hear what I have to say, generally because it makes him very uncomfortable.","The micro managing from a certain supervisor is a waste of time. I understand the coop wants to keep track of labor hours but she is the only person who constantly evaluates my every move. No other supervisor or my department manager has had any issues with my speed or how much i get done. i check in constantly and assuming they are being truthful then her concerns are invalid. unless productivity isnt the main concern, creating the narrative that any lack of productivity can be attributed to the fact that she has to keep tabs on others.  Me being watched is one thing, but to see this person constantly talking to everyone else, in the office, or in produce cannot be wrong to just me. she goes out her way to tell everyone she has a problem with my work but me. what she will tell me about is her parental life, dating life, intimate life, and other personal things. despite dragging me in a office, and threatening to \"discipline\" me if i do the same.","Front end supervisors are all great and helpful.","My department manager is fair and always encourages feedback for me. I am listened to and my opinion is valued. We work very well together.","Our department manager is great. Certainly better than what we had before, he has fair policies and is clear on what the expectation of what is supposed to get done during the overnight shift. I do believe that more check ins should be done to avoid conflict/ drama in the department, this will eventually lead to better productivity and well being of employees.","There have been times where I feel my manager prefers some employees to others and treats them differently, especially if their bond is closer or such. I also find it hard to being up concerns about other employees or ideas to my manager as it is not always the most welcoming environment. I find that it is easier to talk to other department managers than my own and that shouldn't be the case. If I had a complaint about a coworker and how they are working, I am unsure if I am even able to talk to my manager about it without feeling like a snitch or mean. If I have an honest concern, I shouldn't be afraid to bring it up to my manager. It is also hard to make that bond needed with certain managers as they sometimes are always locked away in their office. Granted they are most definitely getting work done that is more of their concern, but not checking on us for a couple hours and just coming to chat and see how we are doing definitelycreates an icy relationship that cannot always be fixed.","Although I can go to my dept manager and feel heard on my concerns about other coworker behavior/performance, sometimes I never know what happens with that information. I might report a problem and not know if that person faced any type of talk or meeting about the concerns.","Nick Brown is a great Store Manager."]},{"Question":"84. Comments on job satisfaction","Comments":["It's a great place to work, and I would recommend it to others.","I stand with the ideals and values of the Co-Op and that is something that is important for me to feel comfortable in a workplace. That makes me grateful for my job snd proud of the work I do for the people in the community.","Given the overall difficulties the Union has faced with our General Manager, and the general lack of clear communication regarding the direction of the coop to the floor workers (whom feel constantly overworked and are currently facing labor cuts and hiring pauses), I have a lot of difficulty giving an overall positive review of my time working here. Although it is marginally better than other places that I have worked, we can do much better. My disappointment comes from what feels like a constant downward spiral of difficulties that seem to be shouldered only by the lowest paid and hardest working individuals at the store.","I do love it here! but we have some major system issues that need to be ironed out, that will push us to be a super competitive work environment.","I feel fortunate to work at the Coop, a place that shares many of my values and works to build each other and our community up. We've made improvements on communication and operations over the past year and I'm really proud to be a part of that. I appreciate the relationships that I've built with the people that I work with and know that we work with each other with the best intentions. I feel satisfied and happy to come to work each day!","I love working for the Co-op!! What an honor and privilege to be its steward.","While our Co-op is great to work for the pay is not enough to live off of making it a difficult place to work long term or career wise.","It’s really hard work, for not a lot of money. I enjoy the work I do, and the people I work with, but it takes a lot out of you in the long run.","I know we can be better and always improve - I think we have the right path in mind, the right people, and a dedication to staying true to ourselves regarding diversity, inclusion, community, and communication that is the direct opposite of what the general state of the news and politics is right now. We are incredibly strong in refusing to kowtow to attempts at policies of hatred, bigotry, judgment, and otherwise from our country's top leaders today.","I enjoy the mission and goal of the Co-op all together.","The potential for upward movement to a tech positions does not seem to exist, whether that just be a quirk of the weird size of the business as a whole, or if that room could be carved out in the future with potential consolidation of other marketing roles has yet to be seen. When the marketing team is larger than the produce team, it becomes difficult to see their continued impact on the profits as a whole given the occasional focus on broad outreach, where many people seeing advertisement for the store on platforms like Instagram and Facebook may not be remotely close to the co-op to come in and have an experience with us.","I do like working at a place that our community values so much. I appreciate our repeat customers and the generations of coop shoppers who make a choice to go out of their way to shop regularly at the coop.","I like my job, but it could be better and I do hope it improves.","As a retiree, I am thrilled to be working part-time for the Lexington Co-op.  I repsect management, my departmental colleagues, and, our memeber customers.","I feel good about the work I do here, and the skills I have learned.","I love my job and am proud to work at the Co-Op. I plan on working here for a long time.","im satified with my job but i can offer more to the CoOp with my knowledge and experience","Co-op is my first job, and it has been a pretty nice environment to work at for the last couple years.","Some departments in the Co-op provide a more pleasant work environment than others.","Considering the communication aspect can be worked on when someone goes home or some things have been changed, the coop is a good place to work. I like what I do but I feel like there is a lot of work left to be done. There are also people who don’t do as much work as others and don’t get reprimanded for that and it makes me upset. The sole foundation to having a kitchen running effectively is communication and being able to uplift your coworkers. For example, not doing something on your list purposely just because you “don’t feel like doing it”. It makes more work for other people and themselves as well.","i'm proud of what the union fights for at this job. i dont have faith our ceo is making good decisions. i thought the coop would have good values and morals but over time i've learned that the most important thing here is profit. the customers feel it too, the coop puts up a facade of diversity and inclusion for a profit.","I enjoy working at the co-op, but the pay makes it difficult to even consider staying employed long-term, as I am unable to pay my bills with the current salary.","I do feel satisfied here. This is only my 3rd job but this is certainty better than the other 2. I do like the co-ops mission and everything that is accomplished here. I'm happy to be part of it.","The co-op is hands down the best place i've ever worked and I truly believe we are one of the best employers in WNY","I think for people at front end it is sometimes hard to be happy to go into work since we sometimes are never able to get away from the register and do something different for a change. Constantly standing and talking to the same customers every day becomes a bore and makes the days seem like they are just flying away. There is nothing new to bring up when people ask about work and it is just not that interesting to come in anymore. It can definitely make you feel burnt out and may make you want to explore different options. I think it is nice when we have those days where we can help out in different departments or just get time to walk away and do some tasks. I can bring your mood up and get the blood flowing back in your bodies again. It really takes a toll on your body when you are stuck at one area for 8.5hrs every shift and makes you quite unenthusiastic.","This is a great place to work!"]}],"results":{"Overall":{"response":"The survey reveals a moderately negative overall sentiment (-0.063). While many employees express genuine appreciation for the co-op's mission, values, and a generally welcoming workplace culture, these positives are significantly overshadowed by systemic issues across various operational areas.\n\nA strong undercurrent of dissatisfaction centers on compensation and benefits, with numerous employees struggling to afford a livable wage, citing unaffordable health insurance and inadequate pay that doesn't keep pace with the cost of living. Furthermore, there are widespread concerns regarding internal inconsistencies, particularly in management practices, communication flow, and training/development. Many feel their voices are not heard, decisions are made without their input, and there's a perceived shift towards a more corporate rather than cooperative identity, undermining the democratic principles employees value. Trust in HR and overall management transparency, especially concerning financial details and accountability, appears to be a major challenge, leading to a sense of frustration and disempowerment among staff.","sentiment":-0.063},"8. Comments on Co-op Overall":{"Sentiment":[1,0.9,0.85,-0.8,-0.75,0,-0.5,1,-0.4,0,-0.6,0.8,0.6,0.1,-0.7,-0.65,0.3,-0.7,0,-0.7,0.1,0.8,0,0.1,0.9,-0.3,1,0.7,0.6,-0.7,-0.9,0.8,0,-0.6,0,0.9,0.9,1,-0.2,0.3,-0.7,1],"Highlights":["Many employees praise the co-op for fostering a welcoming, inclusive, and friendly environment, valuing diversity, and aligning with their personal values, setting a great example for the community.","A significant number of comments express dissatisfaction with the co-op's democratic processes, citing a lack of employee voice in operations, inconsistent information sharing from management, and decisions being made without feedback.","There's a recurring sentiment that the co-op feels increasingly corporate, departing from its original values, with specific mentions of reduced member participation (e.g., volunteering) and influence from larger entities like NCG."]},"15. Comments on storewide management practices":{"Sentiment":[0.8,0.7,-0.4,-0.8,-0.6,0,-0.3,-0.9,0.1,0.2,0.7,-0.6,0.5,-0.9,-0.4,-0.7,-1,0.4,1,0.3,-0.9,0.5,0.7,-0.7,0,-0.7,0.9,0.6,0.8,0.6,-0.2,0,-0.6,0.7,-0.8,-0.5],"Highlights":["Many comments reveal a lack of uniformity in disciplinary actions, coaching, and policy enforcement across departments and shifts, leading to confusion and frustration among employees.","A notable segment of feedback suggests that management is perceived as prioritizing financial outcomes over employee well-being, with some feeling their voices are unheard and that previous employee advocacy has diminished.","While several employees express satisfaction with their direct managers, praising them as fair, approachable, and supportive, upper management faces criticism for transparency issues, especially regarding critical incidents (e.g., bed bugs) and perceived biases in hiring practices."]},"23. Comments on workplace communication":{"Sentiment":[0.8,0.3,-0.4,0,-0.6,-0.3,0.2,0.9,0.1,0.7,0.8,-0.5,0.6,0,-0.3,-0.7,-0.4,-0.8,-0.4,-0.7,0.4,-0.5,-0.6,0.5,-0.4,-0.5,0.6,0.7,0.5,0.6,-0.8,-0.9,0.4,0.7,-0.8,0.1,-0.6,0.9],"Highlights":["Despite some perceived improvements, many employees report a significant disconnect in communication, with crucial information not trickling down to floor staff, and employees feeling consistently left out of decisions or opportunities to provide meaningful input.","Specific incidents, such as unannounced shift changes, uncommunicated benefit information, or critical health/safety issues (like bed bugs in Q15), highlight a failure to provide timely, clear, and relevant communication, leading to frustration and financial hardship for employees.","Communication is often fragmented across departments, with specific concerns about inter-store and inter-departmental information sharing. Additionally, the proliferation of multiple communication platforms (Paylocity, Basecamp, Teams) creates an overwhelming and inefficient experience for employees."]},"25. Comments on Open Book Management":{"Sentiment":[0.7,0.6,0.3,-0.5,0.7,0.8,0.9,0,-0.9,-0.2,0.2,0,0.1,0,-0.7,0,-0.9,0.1,0,0,0.7,0.8,0.9],"Highlights":["A significant concern is raised about the lack of true \"Open Book Management,\" with employees questioning the completeness of financial reporting, especially regarding senior management salaries, legal fees, and the allocation of funds versus retail floor investment.","Huddles are praised by many as an effective tool for engaged team members to stay informed and feel included, aiding in their understanding of co-op performance and customer interactions. However, accessibility for specific shifts (e.g., overnight staff) and the perception of huddles as a \"waste of time\" for less engaged employees are noted.","Some employees feel that the amount of information shared in huddles and general communications has decreased over time, leading to more information being \"siloed\" and a growing distrust in management's commitment to full transparency."]},"31. Comments on compensation":{"Sentiment":[-0.4,0.7,0.8,0.3,0,-0.3,0.3,-0.1,-0.3,-1,-0.2,0.9,-0.3,-0.7,-0.4,-0.6,-0.3,0.2,-0.6,-0.1,-0.9,0.9,-0.2,-0.2,0.7,-0.7,-0.4,0.1,-0.8,-1,-0.7,0.3,0.2,-0.9,-0.3],"Highlights":["A dominant theme is the inadequacy of current pay rates, with many employees reporting difficulty affording basic necessities like food and rent, often needing second jobs, which is amplified by rising inflation and the high cost of shopping at the co-op itself.","Health insurance is consistently highlighted as \"extremely overpriced\" and largely unaffordable, especially for those living paycheck-to-paycheck or part-time employees who desire access, with some experiencing personal negative impacts due to poorly communicated changes.","While some acknowledge the union's role in securing competitive benefits and guaranteed raises, there's also dissatisfaction with the union-structured pay, with calls for merit-based raises and concerns that long-term raises do not keep pace with the cost of living or workload."]},"40. Comments on Store Operations":{"Sentiment":[0.8,-0.5,0.6,0.3,-0.9,-0.5,0,0.3,-0.6,-0.4,-0.4,0.6,-0.3,-0.6,-0.7,-0.6,-0.8,-0.7,0.7,0.8,-0.7,-0.6,-0.6,-0.4,-0.9,-0.5,0,-0.5,0.7,-0.5,-0.9,0,-0.6,-0.1,-0.7,-0.7,0.5],"Highlights":["There are widespread concerns about a lack of standardized systems, recipes, and communication between the Elmwood and Hertel stores, particularly in departments like PFD, leading to operational inefficiencies and product quality discrepancies.","Multiple comments highlight safety issues, including an unsafe parking lot, back room clutter and overflow making movement difficult, and dirty, claustrophobic employee areas, contrasting sharply with clean customer spaces.","Employees point to staffing shortages, frequently broken equipment, outdated technology, and a management culture that is slow to implement necessary changes or incorporate worker feedback as major impediments to efficient operations and productivity."]},"47. Comments on department operations":{"Sentiment":[0.9,0.7,-0.5,-0.6,0.8,1,-0.5,-0.4,-0.1,0.9,0.1,0.6,0.9,-0.3,-0.7,0.3,0.2,-0.2,-0.3,0.6,0.4,-0.7,-0.6,0.7,-0.6,-0.5,0.8,-0.4,0.7,-0.7,-0.6,-0.7,-0.9,0,0,-0.6,-0.9,-0.5],"Highlights":["Many employees highlight issues with accountability for mistakes and quality, inconsistent application of standards, and a lack of clear expectations or defined goals from leadership. This leads to preference-driven workflows and unaddressed performance issues.","There's a strong sentiment of being overburdened, with consistently heavy workloads and unrealistic expectations, especially for departments dealing with multiple initiatives or limited space. This contributes to employee exhaustion, lack of motivation, and high turnover (e.g., overnight staff).","While many praise their direct managers and departmental colleagues for hard work, camaraderie, and team cohesion, there are also reports of favoritism, unequal workload distribution, some employees exhibiting inappropriate behavior, and insufficient communication about departmental goals or changes."]},"57. Comments on HR practices":{"Sentiment":[0.6,-0.3,0.7,-0.9,-0.7,0.2,-1,0.3,-0.6,-0.4,0.9,0.5,0.1,-0.3,-1,-0.3,-0.6,0.6,-0.3,-0.6,-0.9,0.3,0.7,0.6,-0.4,0,-0.9,0.6,0.8],"Highlights":["A large number of comments express a profound lack of trust in HR's ability to handle sensitive issues confidentially, fairly, or effectively. Many feel dismissed, misunderstood, or that their issues are made worse, leading some to prefer confiding in direct managers.","Employees report that HR can be slow-moving, difficult to reach, and has communicated poorly around critical events (e.g., health insurance sign-ups). There's also a perception of inconsistent policy application and an outdated, unclear employee handbook.","Direct claims of discrimination within the workplace and \"sloppy\" handling of injustices from shoppers towards employees are deeply concerning, severely impacting trust in HR's role in ensuring a fair and safe environment."]},"68. Comments on training and development":{"Sentiment":[-0.3,0.6,-0.8,-0.4,-0.4,-0.3,-0.9,-0.6,0.5,-0.6,-0.2,-0.4,0,-0.4,-0.5,-0.7,-0.5,-0.3,-0.6,-0.7,-0.8,-0.1,-1,-0.9,0.4,-0.9,-0.7,-0.8,-0.5,-0.8,-0.6,-1,0.2],"Highlights":["There is overwhelming feedback indicating a severe deficiency in training, described as \"little to no training,\" \"rushed,\" \"incomplete,\" \"inconsistent,\" and largely peer-led by often untrained staff, leading to employees lacking vital skills, making mistakes, and having unclear job expectations.","Many employees report a significant lack of pathways for career advancement, with development opportunities removed, denied promotions, vague job descriptions, and a perception that growth is \"impossible\" unless tied directly to profit motives.","Concerns are raised about the effectiveness of existing training tools not being utilized, outdated policies, and the inadequacy of current diversity training. The overall sentiment suggests a fundamental failure in preparing and supporting employees for their roles and future growth."]},"77. Comments on Supervision":{"Sentiment":[0.8,0.7,-0.4,-0.5,1,-0.3,-0.5,1,1,-0.4,0.8,1,-0.6,0.9,-0.7,0.8,1,1,-0.4,0.9,0.7,-0.7,-1,0.9,0.9,0.7,-0.9,-0.5,1],"Highlights":["While many employees express strong positive sentiment towards specific direct managers, praising their fairness, support, approachability, and clarity, there's also significant criticism of others for fostering an unwelcoming environment, favoritism, and inaccessibility.","A recurring issue is the lack of consistent, timely, and constructive feedback from supervisors. Employees report feeling unobserved, evaluated based on second-hand reports, and a general lack of accountability for team members, which contributes to distrust and a sense of drifting without guidance.","Some comments question the overall value of supervisors, feeling more work is pushed onto employees. Specific instances of micromanagement, unprofessional conduct (e.g., public confrontations, sharing inappropriate personal details), and managers who listen but don't \"hear\" or act on concerns, severely undermine trust and respect."]},"84. Comments on job satisfaction":{"Sentiment":[0.9,1,-0.9,0.3,1,1,-0.2,-0.4,0.8,0.9,-0.5,0.9,0.3,1,0.8,1,0.4,0.8,0,-0.2,-1,-0.6,0.9,1,-0.7,0.9],"Highlights":["Many employees express deep satisfaction, pride, and comfort in working for the co-op due to its mission, values (diversity, inclusion), and the positive relationships with colleagues. However, this positive sentiment often clashes with practical concerns like insufficient pay, workload issues, and a perceived shift towards corporate priorities over co-op principles.","A critical barrier to sustained job satisfaction is the struggle for a livable wage, with employees unable to afford basic living expenses or even shop at the co-op itself. This makes the co-op a difficult place for long-term careers despite enjoyment of the work and environment.","Beyond pay, issues like front-end burnout from repetitive tasks, limited opportunities for career advancement (especially in tech or other non-management roles), and feelings of being underutilized, negatively impact enthusiasm and long-term engagement."]}}}