{"comments":[{"Question":"6. Please share your comments about Co-op Values.","Comments":["I really love the Co-op model vs traditional business model.  I love that we are all working together for the good of our staff and community, not only focused on the bottom line.","The co-op is very accepting and kind to its customers and staff.","They are ideal","While there have been times in the past where I feel as though I have been under-valued and disrespected in the workplace, it is typically not at the fault of my fellow employees. I also feel as though these days, this company has seen my worth and has done a great job at listening to my needs, and has also been great at working around my schedule.","The only reason these are not strongly agree is because we always have work to do. We are heading in a good direction, but there is always room for improvement.","I do not believe all team members embody \"self-responsibility\". For example, a team member trained in a certain process, does well, not too long after the team members fall into poor habits and are no longer doing the process the way they were trained. Management follows up time and time again to remind the team member of the correct process, though nothing changes. The team member then does not take responsibility of the mistakes made, instead casts blame on others, and there is not accountability for the individual who continues to not follow process. It is a vicious cycle that will only perpetuate if individuals do not take ownership of not following process nor learn from these experiences. \nAnother example is that you have a well-trained team member, knowledgeable, had been in a position of leadership, yet their participation is inconsistent, they no longer apply the knowledge they have acquired, no longer follows the processes that they once held the line with others the past as a leader, they do not take ownership instead casts blame on others.","No different than Walmart or any other large corporation.","The longer I've work at the Grain Train, the less confident I've felt that my co-workers value me and enjoy working with me, and that the higher-ups are acting in my best interest.","My values align with the Co-op values for community, healthy food, DEI, and supporting local. These are important values.","The Grain Train co-op is a benefit to everyone in the area, employees as well as customers and patrons.","I feel like the Grain Train is doing a pretty good job fulfilling the Co-op Values. There is room for improvement though.","Question # 1, I’m not really familiar with the Grain Train policy’s.","I feel as though the coop virtue signals a bit. We claim to be a place for every community member, a wonderful place to work, and a firmly environmentally focused company, but we fail in many ways. Many of our efforts forget the underprivileged in our community, often targeting the affluent and tourists. (Why hasn’t the Food Farmacy program been restarted?) We also do not provide a livable wage to our employees—many of us work two jobs and/or devote ourselves to side projects in order to make ends meet when, realistically, our jobs could simply offer us a truly competitive wage. This may also help with employee retention and sour attitudes. In a similar vein, the extended hours are a burden on employees. There were no points in which the employees were notified about the switch, until after it had been determined, which is deeply hurtful as we are the individuals who bear the brunt of the impact. Employees are required, due to the extension, to act as managers while lacking experience, energy, or compensation and it is infuriating. Further, the many projects which require attention (dripping ceilings over the register, in the cash office, and the employee bathroom, broken seals, alarms, thermometers, and coolers/freezers, and ancient plumbing) often hinder the experience of both employees and customers, as well as impact our environmental footprint. \n\nComing from a firm believer in the mission of coops, I am happy to work for the Grain Train, but I also feel as though there is significantly more we can do to help our community, our employees, and our environment.","At times I feel like it has felt more concerned with agenda/politics than the wellbeing of the employees or customers.","Bringing quality items and service to the community is a fulfilling and rewarding experience. We should endeavor to provide that on a consistent basis and looking for more ways to do that is appreciated."]},{"Question":"15. Please share your comments about Co-op Management Practices.","Comments":["I feel like we are in transition right now with more departments and supervisors being created, which is such a good thing!  I think it has felt a little disjointed and this move is helping things a lot.  I think it will help create much clearer departments and expecations for everyone.","Management is kind and patient with the staff.","The managers are amazing","There is a severe lack of communication between upper management and the rest of the store.","There was one time around early Febuary where I feel as though corrective action was handled fairly recklessly, but since then I was delivered a proper apology for that day and have since gotten over it. Lately, management has been great to be around- even if the time I see them is few and far between. Often times, because of the recent shortage of MODs, they've been scheduled for more midshifts and been leaving cashier staff to close things down on their own. Thankfully, it seems as though most of our staff that have worked in the store for a few years have been trained properly on these procedures, and we've all been able to close things down with little to no issue. Although, I hope this doesn't become a habit in the years to come. I understand that it's hard to find new people to be able to promote, as they need a lot of experience working in our store to be able to perform the job well... but it would be nice to be able to get a bit of extra help once in a while. Not every night we close, obviously- but maybe a few times a week.","We do well here at applying and offering these practices.","As skeptical as I am of how the higher-ups and most of my co-workers feel about me, my immediate supervisor has been great at helping me out and listening to my concerns. However, I've heard stories from people who haven't had the same luck.","There is room for improvement when it comes to management, especially regarding communication, support, and allowing for staff input. It can be easy to feel undervalued as an employee at times from higher management.","We need better training programs","Generally, management is very attentive and proactive. Not particularly a fan of the recent trend of managers going home early and leaving the store in the hands of those who aren't managers.","The management are doing a good job in a difficult situation, given all they’ve had to change and adapt too in our semi recent situation of management leaving or taking on different roles. Expectations for staff have changed since this change, more people have definitely stepped up and taken on some roles to help support our management. Great examples of this are our replenishment staff who have almost become part time managers for when the managers are not in. They do a great job supporting the cashiers and making sure what we need to get done is getting done in an organized and efficient way.","There has been a notable lack of leadership for the past few months, and a frustrating lack of communication between upper management and employees.","This was a difficult section to answer questions. I have no experience with grievance procedures, or how management handles performance issues.","My direct supervisors (Mary M., Nick, and Sarah S.) are broadly reliable in answering questions, providing support, and addressing issues, but I feel as though their support may be lacking. They, too, have been dealing harshly with staffing problems in Boyne, the extended hours of the Petoskey store, and the overall business of the summertime in northern Michigan, oftentimes working massive stretches of days without days off, and in turn neglecting their own needs. In this, I rarely see Chelsea or any other higher-ups stepping in to close Boyne City, answer employee/guest questions after-hours, or receive/replenish huge orders on their days off. Further, it feels as though there is a barrier between the employees and upper management. Specifically when Chelsea walks through the door, there is a collective held breath, for fear that one mess up in the slightest. Her way of correcting us often feels like being chastised as a child, rather than treated as an equal, and is remarkably frequent. While I can see the need for reminders of best business practices and safety measures, there is no need to passive-aggressively belittle the employees one works with. I also believe that she has favorites, evidenced by her correction of specific employees over others, and willingness to have a friendly conversation with some versus others, and it rubs me the wrong way. \n\nCollectively, I feel as though we have a strong team, but do feel as though we need to reconsider what strong management looks like.","I think management can do better at following through with employees to ensure they are correctly preforming the tasks given to them.","There’s a level of understanding with certain needs of employees that have chronic issues but truthfully it feels more like a begrudging acceptance of those limits. There’s still a tension and frustration that’s felt in the department. I understand that on small teams a call in can be disruptive but it feels discouraging when it becomes tense because it feels invalidating to prioritize your wellbeing over “the task list.” I personally feel that expectations should adjust in those moments rather than someone on staff feeling obligated to “pick up the slack” from a call in as that can exhaust people who could make it in."]},{"Question":"20. Please share your comments about Compensation.","Comments":["I have no idea what other employees are paid so I don't know if my pay is in fair relation to the coop's wage scale or not","I think we have great benefits.  I think the only thing that would make it better is if we offered a family plan for health insurance.","N/A. I do not know enough on this subject to have an opinion. I feel like I am fairly paid for my work.","As a full time employee in the summer I receive no benefits and after working 8 months I have only received a small pay increase compared to what I was expecting","Compensation is fair","I could not afford life if this was my one and only job. I have to work multiple jobs to make ends meet. If I could choose only one of my jobs to work full-time and if I could survive off of the compensation, I would absolutely choose the Grain Train.","This job pays very well for the work I put in. I made $15.00 an hour when I first started in the summer, which was already higher than the rate I was being paid at my previous job of almost 2 years. Now I make $16.50! That's nothing to snuff at when it comes to entry level positions. My benefits are pretty nice too, such as employee discounts and access to Provisions (which is typically an Owner Only program). Overall, I think my rate of pay is fair for the work I put in.","While understanding where we live and the benefits we offer, the rate of pay may balance out. However, we have team members making the same as others, yet do not contribute equally, one is hardworking and cares about their job, whereas the other team member paid the same does minimal work in comparison and is inconsistent with processes in place. This does put a weight on the hard-working individuals to continuously carry the weight of responsibilities, while being paid the same as the ones who don't. This eventually leads to burn out and losing valuable team members.","I am only paid fairly after confronting management repeatedly about being openly discriminated against since my hire date, which eventually requiried a complaint filed with the EEOC, after being told in writing I was being paid several dollars an hour less because I am on disability. I have never feared losing a job, or been treated like less of a person, than I have at the Grain Train. The situation has improved since the change in CEO/my supervisor.","I'm not going to lie and say that I wouldn't like to be paid more, but I guess I don't know how much more I can realistically expect.","The Co-op strives to give employee's livable wages, which is mostly accurate, however some work loads feel heavier and harder than others and that doesn't always match the wages.","I feel proud that our starting wage is at least $15 per hour. I think it is important for the Grain Train to continue to raise the bar for entry level pay so that team members can actually afford to pay their rent or mortgages. I appreciate the transparency in how annual evaluations are directly correlated with wage increases.","Working at the Grain Train, I’ve felt like my employers definitely care about me and my needs and try their best to give me the options and support that each of us need.","I believe the pay scale should be moving up as the cost of living does. $16/hour would have been fairly sufficient a few years ago- now that is no longer the case.","I have two part time jobs in the area, Grain Train pays me $16.51 per hour, the other job pays me $18. The other job also has one 1/2 lunch, and also two 15 minute breaks, for 8 hour shifts.","It's hard to not be specific about my department in relation to pay. It is both physically and mentally demanding. And it has been hard to retain people in this department, and I also feel underpaid in relation to the work I do for the co-op.","I feel lucky to be paid well with the ability to get full time hours and insurance. Occasionally it can feel like my or others contributions are not recognized especially during more hectic times. Everyone feels too busy in such situations to offer more than “ok do this next” which while informative and useful as direction lends an air of coldness or un-appreciation. As if there’s no recognition of the person and they exist as a means to an end for the production of tasks and goods for the customers."]},{"Question":"26. Please share your comments about Store Operations.","Comments":["We all know the back room is tough!  But also know that is something we plan to make better with expansion.","In reference to question 22, the floor in the deli is very outdated and has many cracks and crevices where food, debris, and bacteria collect. This often can lead to bad smells, especially in the dish pit area.","Produces very good product and sells very nice items to the community.","The building isn’t safe we are finding new items that need fixing and sometimes it takes a while to get them fixed","More communication is needed","No big notes here, I think we handle operations well. I can't really think of any glaring issues with the store's infrastructure off the top of my head that haven't already been addressed. Sometimes it takes a while for maintenence to be done on things, but eventually- things get fixed!","It seems that safety concerns are addressed promptly when brought up but there seems to be a culture of working around things rather than letting someone know that could fix them about the problem.","The store operations we have in place are fair and clear, though most processes have never been a part of each department's trainings. We have systems set in place that have been communicated or passed along throughout time that need to be put into an SOP and while communicated verbally, these can be interpreted differently amongst others. The problem here is employees rely on the team members who know, and it enables the ones who don't know, and the ones who don't know continuously as the same questions about process. They in the areas we have SOP's, not all team members know where to find these. The ones who are aware and yet choose to not follow process and skip the steps they prefer not to do. \nWhen there is communication passed along to inform team members on the recent processes, most team members are still asking questions to the information that has been provided verbally, on paper as well as in teams.","I don't think my work area is anywhere near as safe as it could be, and it doesn't seem like I'm always kept in the loop when it comes to changes in how things are done.","Operations tend to go smoothly and safely most times however there there do tend to be some safety issues at times which are not always within the Co-ops control (deliveries) but there are space issues and at times it can be too crowded to safely and effectively work, especially in the back of the store (receiving, backstock, coolers) and not every staff member has the same safety knowledge and at times heavy items are stored too high and cause injury.","We run a tight ship.","Some of our equipment is definitely due for an upgrade. It would make our jobs more efficient. Also the store seems to be doing well, we have been ordering a lot of new and more things. But the store, especially the back, seems to small to be able to keep an orderly back-stock. The back is usually a place of chaos where we’re all just trying to do our jobs without getting in each others ways as much as possible. The coolers and freezers in the back have been so full lately that organization has been tried the best as possible but there’s only so much one can do. In general it just seems cramped, especially when trucks are being checked in.","The parking lot is always a bit of a concern and a challenge. I would love to see a dedicated receiving dock in the future...","Most times it feels like the tools needed to perform well are available and that’s appreciated. Unfortunately there can be stretches of time (likely out of most people’s control) where things don’t arrive when they should and there’s often a cramped feeling in lots of areas in the store in regards to space needed to execute effectively. All departments seem to have ambitions to achieve what can happen with a team twice as large in a space that accommodates half as many of the actual people on staff. I worry that high demands aiming to “do more with less” can facilitate unease and frustration. No easy answer of course as no one wants to hear “we should scale back a little” because year over year always needs to be up.","The cramped backstock spaces make it hard to accomplish certain tasks in an ergonomic manner."]},{"Question":"32. Please share your comments about HR Practices.","Comments":["We have the best HR manager!","Everyone seems treated fairly.","Most part good but you would have to reach out to Bailey specifically or else there can be backlash as I saw with Norman","Great atmosphere to work","No notes here either. HR is doing a great job these days. Keep up the good work :)","I feel very supported by HR Practices, and I have a safe space to speak freely and feel heard and supported.","I have the feeling that the Grain Train is better with regards to discrimination than other places, but there are still some areas for improvement that I don't expect to be addressed any time soon.","Staff is kind to each other and we all work together to make sure the Co-op is a safe place for everyone, staff and customers alike. If there is ever an issue, we have a wonderful HR person to confide in that ensures the issues are addressed in a timely manner.","The people at the Grain Train are typically very diligent in addressing concerns, whether it be among the staff or the public.","I feel safe, respected, and valued at the Grain Train.","I am frequently misgendered by my superiors, though seemingly without malicious intent","As long as people feel comfortable communicating their needs and boundaries I feel HR can perform effectively. The tricky part can be if people DO voice their concerns or if they sit on them. Maybe it’s not a fear of retaliation exactly but it could be a concern that their grievances may lead to seemingly nothing happening. Over the years there have been times where someone in management was experiencing consistent frustrations from their department staff and after a while it was hard to tell if anything really came of it beyond behind closed doors disciplinary action if any happened at all. Maybe some things got resolved but if there were consistent frustrations with a specific manager it could feel like there was an unwillingness to remove that person. These are issues of the past I don’t necessarily see today but anyone here long enough to have seen that could have internalized that “why bother” feeling despite everyone’s best efforts or intentions."]},{"Question":"40. Please share your comments about Training & Development.","Comments":["My supervisor and I share an office, so we are in constant communication and flow and shift together with whatever is needed.  And we get along great!","My supervisors help me grow in my job. They are patient and kind.","I wish we were trained more all around instead of a tiny bit in some and lots in others.","It's not my department, but I do believe we could have more thorough training over a longer period of time for cashiers and replenishment members. There is so much to learn, and I often feel that (especially with cashiers) they are thrown into the mix without truly feeling comfortable.","Training and development is on opportunity for the Grain Train to improve upon.","I got the hang of things pretty early on in my time working here, so I don't have too many notes here either. I'm mainly just glad that this job is able to work around some of my medical conditions. The first aid kit is always stocked with what I need in case of emergencies, and I never feel pressured to clean or stock items from trucks that would end up causing me harm. Thanks for that!","I have been trained, developed and invested in.","My supervisor is doing a pretty good job in helping me take on new responsibilities, but I feel like it's getting to a point that I'm being asked to do more than I am being fairly paid for.","No comments.","The training or instructions are utilitarian, but occasionally haphazard. Sometimes coherent communication gets out-paced by speed and efficiency.","Personally I see room for improvement on training. The process was semi rushed. I believe that I know how to do my job, but a good amount I’ve just learned from observing others and learning on my own as opposed to it being taught to me in my training.","I am unclear how receiving specifically is evaluated as it is unlike other departments. I would love clarification on that but I also have not had an evaluation as they are now, only what we previously considered \"yearly check-ins\"","As things get more hectic the feedback can be quite delayed sometimes. As result it can feel “saved up” for a singular conversation or evaluation where it can end up being a bit shocking to discover some shortcomings or criticisms that would otherwise feel easily fixable in the moment of observation. In addition, because of the disjointed nature of check ins and updates due to the high production demands of any one department sometimes the goals can feel muddled and unclear even after taking initiative to ask. In general the idea is clear but specifics within HOW to get there can occasionally feel confusing. A number of moments have occurred where one goal was being worked on and then something else seemed to have manifested as a concern that now becomes the new goal despite its contradiction with the original goal. Improvisation is needed of course but it can be hard to feel that it’s not so much that but rather the bridge is being built as the schematics are being drawn up simultaneously which feels chaotic.","It's less clear in recent months whether there will be opportunities to develop skills and knowledge related to the kind of work I do.  I haven't had an evaluation with my direct supervisor in a number of years, making it hard to know how my performance is being evaluated, although there was communication within the past few months about what sort of criteria would be used when considering pay raises."]},{"Question":"41. Please share any final comments.","Comments":["I truly love working here and am so happy with the direction that the Co-op is going.  It really feels like a Co-op again and I'm excited for all the new oppurtunities that will come with expansion.","Grain Train has been a safe, nice place to work. The staff are kind and the work is good.","I love graintrain I wish I was more compensated for my efforts but for the most part it’s amazing to work here even when it’s not entirely safe physically.","I do see people getting burnt out, especially people that work solely in the store and people that have more responsibilities. But I suppose they will speak for themselves on this platform. \nOne final comment I have is that I felt discouraged when I went to HR with an interpersonal issue with a coworker and felt like it didn't really solve anything. HR did empathize with me and validate my feelings, which I appreciated. And of course, I know that no one can solve personal things for me, but I had previously tried just about everything I could to fix it on my own. The other party didn't seem to want to try and talk it out so I figured they wouldn't want to have a meeting with HR with me, so I left it at that. Bailey asked me at the end of the meeting if I was okay with what solutions we came up with, and I said yes at the time. So in many ways, it is my fault that I didn't try harder. Things are better with the coworker now, but there is still an air of unresolved feelings. I hope that in the future, HR will see the situation through and follow up with the grieved employee to check in with how they're feeling and track the progress.","Great place to work, good atmosphere, fair wages. Lack of communication, and training and development are areas that have room for improvement.","I continue to work at the Grain Train because of the connections I have made with co-workers and customers.","Overall, my time here has been great... but there have been some rough patches that could use some smoothing out. Mainly, more managerial support during closing shifts in the future. I'm hoping the upcoming season changes will help alleviate some of the stress that comes from closing the store without MODs, but we'll have to wait and see. Also, I have to ask: I noticed that in the latest Staff Update, we mention that we're hiring for various positions at the Boyne City store... but we're only hiring a Full Time Baker at the Petoskey Location. I remember overhearing that a lot of our summer cashiers will end up leaving once the fall hits, and I'd be lying if I said that didn't worry me about the possibility of short staffing once September rolls around. Do you guys have any plans on hiring anybody to help offset the workers we'll be losing soon? Just some food for thought.\n\nOverall, thanks for having me here! Let's hope we can continue working together in the future. (I'm aiming for at least 2 years!)","I do not have enough time in a day to the requirements of my job, once home I'm having to finish the tasks that I was not able to achieve. The demands of the job are not supported by other team members, as it is viewed that I do everything in this area. I'm torn at times to do the part the customer sees and their needs in a way that meets the standards of both departments and our store and to do the behind-the-scenes tasks to make any of those even possible. Ultimately, I know the customer is the priority, I can't have one without the other, so achieving the balance without consistent support is exhausting. I have been told there will be support and upper management is aware and are taking steps to make this happen, however it will be some time until it is possible. While I know there is light at the end of the tunnel, it does not change the fact that this experience and feelings that come along with it are difficult to manage.","Overall, my time at the Grain Train has had its ups and downs over the years, and right now it seems like it's somewhere in the middle.","The Grain Train can be a stressful, high intensity, busy place to work but it can also be fun, light, and feel accomplishing. Having clearer communication not just amongst management but with all staff would be helpful. Often, especially on weekends or nights, it can be overwhelming and issues may come up that highlight a lack of support from upper management and or staff that isn't always in the store. There feels like a divide between office staff and store floor staff at times that can be small in moments or feel monumental.","Whatever gripes or confusion I may have, I am lucky to be employed at a fine establishment such as the Grain Train Co-Op, and to work with so many friendly and professional co-workers.","As a whole I feel like we are all doing our best to support each other while we try to make sure that both stores have the management that they need, people have definitely been stepping up to help each other out. There is definitely room for improvement as always. In particular our equipment such as carts, card readers, storage in general, etc. As well as in scheduling, the schedules are all over the place, which I know is because we need to cover for those who are having time off or days off, but I believe that more consistency is possible with some more organized schedules. This could really help our employees enjoy their job more and help their work and home life.","The Grain Train is a nice place to work, the fellow employees and customers are very nice, I enjoy coming to work, but my opinion might be biased, because I only work one day a week.","I look forward for what is to come and hope for the best.","Despite taking time to elaborate on many different criteria and criticisms it’s precisely because I care and believe in the general principles and vision that I want to help us all strive to get ever closer to fully realizing that vision. I enjoy my job and am invested and if I wasn’t I would likely have been less elaborate in my comments."]}],"results":{"Overall":{"response":"The survey reveals a moderately positive but highly nuanced overall sentiment among employees. Many express a deep affection for the Co-op's mission, their colleagues, and customers, frequently highlighting the unique value of the Co-op model. However, this positive foundation is coupled with significant concerns across several key areas. There's a clear distinction between appreciation for direct supervisors and a more critical view of upper management, particularly concerning communication, support, and follow-through.\n\nCompensation is a major point of contention, with many employees struggling to make ends meet and feeling undervalued, while others find their pay fair. Operational inefficiencies, such as cramped spaces, maintenance issues, and a lack of clear SOPs, are frequently cited, alongside a widespread demand for more robust and consistent training and development programs. HR practices generally receive high praise for support and diligence, though historical concerns about grievance resolution persist. The comments collectively paint a picture of an organization with a strong cultural foundation that is currently grappling with operational and structural challenges that impact employee well-being and efficiency.","sentiment":0.038},"6. Please share your comments about Co-op Values.":{"Sentiment":[0.9,0.8,0.7,0.6,0.2,-0.9,-0.6,-0.8,0.7,0.7,0.4,0,-0.7,-0.5,0.6],"Highlights":["Many employees express strong alignment with the Co-op model and its values (community, staff welfare, DEI, supporting local), seeing it as a benefit to the area.","Significant criticism exists regarding a perceived disconnect between espoused Co-op values and actual practices, especially concerning livable wages, employee burden from extended hours, and addressing community needs (e.g., Food Farmacy program).","Concerns are raised about individual team member accountability, consistency in following processes, and the impact of these issues on the overall work environment."]},"15. Please share your comments about Co-op Management Practices.":{"Sentiment":[0.7,0.7,0.8,-0.7,0.3,0.6,0.1,-0.6,-0.2,0.4,0.7,-0.8,0,-0.7,-0.3,-0.6],"Highlights":["A significant and recurring issue is the 'severe' or 'frustrating' lack of communication between upper management and employees, creating a perceived barrier and feelings of being undervalued.","Direct supervisors are often praised for being kind, patient, and supportive, but concerns exist about the burden on them due to staffing issues and a perceived lack of support from higher-ups.","There is critical sentiment regarding specific upper management styles, described as belittling or creating an atmosphere of fear, alongside a desire for clearer expectations and more consistent management presence, especially during closing shifts."]},"20. Please share your comments about Compensation.":{"Sentiment":[0,0.6,0.5,-0.6,0.6,-0.4,0.8,-0.7,-0.9,-0.1,-0.3,0.7,0.7,-0.6,-0.5,-0.7,0.1],"Highlights":["There is a significant disparity in satisfaction with compensation, with some employees feeling fairly paid and appreciating benefits/starting wages, while many struggle to make ends meet and need multiple jobs.","A recurring concern is that wages are not keeping pace with the rising cost of living, with explicit calls for the Co-op to raise entry-level pay and adjust the pay scale upwards.","Issues of pay equity and recognition are prominent, with concerns about hard-working employees being paid the same as less contributive colleagues, leading to burnout, and a perceived lack of appreciation for individual contributions."]},"26. Please share your comments about Store Operations.":{"Sentiment":[0.2,-0.6,0.7,-0.6,-0.2,0.5,-0.1,-0.4,-0.6,-0.5,0.6,-0.6,-0.4,-0.3,-0.6],"Highlights":["Recurring and strong concerns exist about cramped spaces, particularly in the backroom, receiving, backstock, coolers, and freezers, leading to inefficiency, chaos, and safety/ergonomic issues.","Several comments highlight maintenance and infrastructure deficiencies, including outdated deli floors, general building safety concerns, and equipment needing upgrades.","Lack of clear Standard Operating Procedures (SOPs) and inconsistent training are identified as issues, leading to reliance on experienced staff and inconsistent adherence to processes."]},"32. Please share your comments about HR Practices.":{"Sentiment":[0.9,0.6,0.1,0.7,0.8,0.9,0.3,0.9,0.7,0.8,-0.5,-0.2],"Highlights":["There is overwhelmingly positive sentiment towards HR, with multiple mentions of a 'best HR manager,' and employees feeling supported, safe, heard, and respected, with issues often addressed diligently.","Some historical or perceived issues exist regarding follow-through on grievances, where employees feel that concerns, especially with specific managers, might not lead to visible action, potentially fostering a 'why bother' attitude.","A specific, though potentially unintentional, issue of misgendering by superiors highlights the need for ongoing awareness and sensitivity training within leadership."]},"40. Please share your comments about Training & Development.":{"Sentiment":[0.8,0.7,-0.3,-0.7,-0.3,0.7,0.8,0.1,0,-0.5,-0.6,-0.2,-0.8,-0.6],"Highlights":["Many employees report training being rushed, inconsistent, haphazard, or insufficient, leading them to learn by observation rather than structured instruction, especially for roles like cashiers and replenishment.","There's significant concern about the lack of consistent performance evaluations and clear feedback, with delayed or 'saved up' criticisms creating confusion and making it hard for employees to understand their performance or development path.","While some praise their direct supervisors for fostering growth, there's a general sentiment that overall training, development opportunities, and clarity on goals/evaluation criteria need substantial improvement."]},"41. Please share any final comments.":{"Sentiment":[0.9,0.8,0.4,-0.3,0.3,0.7,0.2,-0.8,0,-0.2,0.6,0.1,0.7,0.6,0.8],"Highlights":["Many employees express a strong attachment to the Co-op, enjoying their work, colleagues, and the overall mission, indicating a positive underlying commitment despite criticisms.","Recurring concerns include employee burnout, demanding workloads without sufficient support, and a lack of consistent communication (especially between different levels of staff) leading to feelings of being overwhelmed.","Specific operational issues like physical safety concerns, outdated equipment, inadequate storage, and chaotic scheduling are highlighted as areas needing immediate improvement to enhance employee well-being and efficiency."]}}}