{"comments":[{"Question":"11. Comments on the Co-op's values?","Comments":["I hear negative comments about boomers. When it comes to age diversity and inclusion are not respected.","I would like to see even more discussion of how the co-op is contributing to local events that are not just school. I would like marketing to reach out to organizations in the area that are for diverse groups on campus at U of I or Inland Oasis and offer food/drink as much as they do for other local orgs. Discussions of why we support the organizations and how and how often is important to me.","The values of the coop was what brought me to the bakehouse in the first place. Its been a delight to see those values practiced and encouraged in person, and to see it spread in our community."]},{"Question":"32. Comments on Compensation?","Comments":["A huge reason I value this job is that the compensation and benefits are useful to me. I appreciate that all of these benefits are available to both part time and full time employees. I have utilized the EAP and Ally Health throughout my time here.","I feel I do more work than others in the same position.","Fairly satisfied, thank-you.","I believe the pay scale pays upper management and marketing too much for the lack of actual strenuous work they do. The kitchen and front end all deserve at least a dollar raise. This is due to the kitchen being a hot and stressful environment to work in and the front end having to clean bathrooms. The turnover rate is so high because young people in this town know they can do better elsewhere."]},{"Question":"41. Comments on Store Operations?","Comments":["The working environment of the bakery does not always feel adequate. Our bathroom is outdated and not well-ventilated, and the first aid kit is meager in comparison to the downtown store; we don't even have eye wash.\nI have been served food at least 3 times that had hair/machine parts/glove pieces in it. Sometimes people handling ready to eat food do not have gloves or if they do they touch other things and then touch food again which could risk contamination. \nThe bakery does not do a lot of work with other departments but in the instances we have I feel as if those opportunities succeeded. Sometimes beyond my expectations which is nice. Sometimes things are coordinated last minute or aren't planned out thoroughly.","We could do better in terms of cooperation. The line of communication is there (beekeper) but it doesn't mean it is fruitful in my experience.","There are things that could run better and more effectively with some newer technology","Each department seems to have run pretty cohesively with each other.","Store Operations in regards to my department have been very good overall.","The printed emergency decision tree who to call for which kind of problem is way out of date and hard to find. The current tree seems to exist mostly verbally or in people's heads. It boils down to \"call the GM or Ops manager\" and hope one of them is available to tell you who to call next."]},{"Question":"50. Comments on Department Operations?","Comments":["I feel that because I am  not as talkative as other employees they perhaps complain about me or assume things about me. I am ready and willing to communicate with others when it is absolutely necessary but sometimes I will not communicate with others if I can figure something out on my own. Often times notes that I leave on Beekeeper are only read by 4 other people here on a good day, and 2 or 3 on average days. I feel respected when it comes to my work and how I want to work but not always respected as a person. I consistently feel re-invigorated when I attend huddles or leadership meetings here. I tend to care less about how much my coworkers like me after huddles and leadership meetings because then it is apparent that regardless of the social aspects of work, I can contribute to the co-op meaningfully.","things could be more coordinated and organized with SOPs. Meetings are sometimes drawn out to long. Expectations are not even and each individual has their own level expected from them.","my department runs ok. It would be beneficial for my department to have short/long term goals that we could work together as a team. It feels like we are all here doing different jobs with our own goals.. if we set them ourselves for the day. It feels a little chaotic sometimes with everyone on a different page. We need department goals and work Together to achieve them. more consistency with checklists and follow up.","My department feels disorganized and without consistency. It should not fall on any one person to carry the load\nwhen things fall through the cracks. I think all of us should know who to call or what to do"]},{"Question":"58. Comments on Human Resources Practices?","Comments":["I appreciate that Heather in HR always encourages  talking with out direct manager first.","Unfortunately the hiring practices of inclusivity despite disabilities can put a strain on the department when that individual can not perform their duties required by the job effectively.  When there are such individuals, it seems the rest of the team is expected to pick up the slack.","I find our HR department to be extremely helpful and approachable. Our HR manager Heather has always helped answer any questions.","The co op being a clearly left leaning political business means upper management will sometimes make a beekeeper post in regards to \"straight white privilege\". Though I've only seen this once, I haven't been here that long so there's a strong possibility it's happened in the past. Frankly political garbage of any kind no matter what it is, has no place in any work environment. This type of propaganda made by actual upper management makes coming forward with any issues as a straight white person uneasy and awkward.","I think we do a good job with diversity in our hiring process. I value that we are inclusive for all.","Works really well! And always have a positive experience expressing concerns.","Time set aside for an open door policy could be beneficial.","In my experience HR does not keep information private.  I do not think HR likes regular kitchen staff.","Seems good","I personally do not have a claim of harassment, but I know some of my coworkers do, and I don't think anyone has said anything because 1. not knowing how to report it or 2. because of fear of retaliation. \n*This specific claim I am thinking of is harassment based on sex.","I am honored to work for an informative and caring HR manager who is concerned about not just the overall success but my personal department and my success","Again, steady improvement here."]}],"results":{"Overall":{"response":"The survey comments reveal a generally mixed, but slightly negative sentiment across the Co-op, with several areas requiring attention. While there is strong appreciation for the Co-op's stated values, inclusive hiring practices, and the helpfulness of the HR manager, significant issues persist in other operational aspects.\n\nKey areas of concern include perceived unfair compensation and high turnover in front-line departments, profound disorganization and lack of consistency in department operations, and critical health and safety concerns in the bakery. Trust and effective communication are also highlighted as problematic, with reports of HR privacy breaches, political messaging from management causing discomfort, and a fear of retaliation preventing the reporting of harassment. Addressing these specific operational, compensation, and trust-related challenges will be crucial for improving employee satisfaction and the overall working environment.","sentiment":-0.071},"11. Comments on the Co-op's values?":{"Sentiment":[-0.85,0.15,0.9],"Highlights":["Concerns about age diversity and inclusion not being respected within the Co-op.","Suggestions for expanding community engagement and outreach to diverse groups beyond schools.","Strong appreciation for the Co-op's values being actively practiced and evident in the community."]},"32. Comments on Compensation?":{"Sentiment":[0.85,-0.4,0.5,-0.9],"Highlights":["High appreciation for comprehensive benefits that are available to both part-time and full-time employees.","Significant concerns about perceived pay inequity, with a belief that upper management and marketing are overpaid relative to their work.","Requests for pay raises for kitchen and front-end staff, citing stressful working conditions and high turnover rates."]},"41. Comments on Store Operations?":{"Sentiment":[-0.95,-0.45,-0.3,0.6,0.8,-0.8],"Highlights":["Significant concerns regarding health, safety, and facility adequacy in the bakery, including outdated bathrooms, inadequate first aid, and reports of food contamination.","Issues with outdated, hard-to-find, or verbally communicated emergency protocols and decision trees.","Mixed feedback on inter-departmental cooperation, with some departments praised for cohesiveness while others report communication challenges."]},"50. Comments on Department Operations?":{"Sentiment":[-0.25,-0.6,-0.55,-0.8],"Highlights":["Significant issues with disorganization, lack of consistency, and unclear departmental goals.","Concerns about uneven expectations and communication breakdowns, including internal notes not being consistently read by team members.","A perception of individual contributors working in silos, leading to a 'chaotic' environment where responsibilities fall through the cracks."]},"58. Comments on Human Resources Practices?":{"Sentiment":[0.7,-0.85,0.9,-0.95,0.8,0.95,0.2,-0.9,0.6,-1,0.9,0.65],"Highlights":["Highly positive feedback for the HR manager, Heather, citing her helpfulness, approachability, and support for direct manager communication.","Significant concerns about privacy breaches, perceived bias against specific staff (e.g., kitchen staff), and a lack of trust that prevents reporting harassment due to fear of retaliation.","Criticism regarding politically-charged communications from upper management, making some employees feel uneasy and awkward."]}}}